/*
SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
Copyright(c) 2013 by LG Electronics Inc.
 
This program is free software; you can redistribute it and/or 
modify it under the terms of the GNU General Public License 
version 2 as published by the Free Software Foundation.
 
This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of 
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
GNU General Public License for more details.
*/



/** @file
 *
 *  PNG register details. ( used only within kdriver )
 *
 *  author     Youngwoo Jin (youngwoo.jin@lge.com)
 *  version    1.0
 *  date       2011.11.27
 *
 */

#ifndef _PNG_REG_H13_H_
#define _PNG_REG_H13_H_

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/
#include "os_util.h"


#ifdef __cplusplus
extern "C" {
#endif

/*-----------------------------------------------------------------------------
	0x0000 cmd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	start                           : 1,	//     0
	                                : 7,	//  1: 7 reserved
	mid_start                       : 1;	//     8
} CMD;

/*-----------------------------------------------------------------------------
	0x0004 read_base_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0008 read_byte_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x000c write_base_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0010 image_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	image_height                    :16,	//  0:15
	image_width                     :16;	// 16:31
} IMAGE_INFO1;

/*-----------------------------------------------------------------------------
	0x0014 image_info2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bitdepth                        : 5,	//  0: 4
	                                : 3,	//  5: 7 reserved
	color_type                      : 3,	//  8:10
	                                : 5,	// 11:15 reserved
	out_format                      : 2;	// 16:17
} IMAGE_INFO2;

/*-----------------------------------------------------------------------------
	0x0018 intr_enable ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	png_done_en                     : 1,	//     0
	inflate_done_en                 : 1,	//     1
	tcopt_err_en                    : 1,	//     2
	tlen_err_en                     : 1,	//     3
	tgen_err_en                     : 1,	//     4
	win_err_en                      : 1,	//     5
	code_err_en                     : 1,	//     6
	btype_err_en                    : 1,	//     7
	len_err_en                      : 1,	//     8
	row_err_en                      : 1,	//     9
	ftype_err_en                    : 1,	//    10
	read_done_en                    : 1,	//    11
	time_out_en                     : 1;	//    12
} INTR_ENABLE;

/*-----------------------------------------------------------------------------
	0x001c intr_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	png_done                        : 1,	//     0
	inflate_done                    : 1,	//     1
	tcopy_err                       : 1,	//     2
	tlen_err                        : 1,	//     3
	tgen_err                        : 1,	//     4
	win_err                         : 1,	//     5
	code_err                        : 1,	//     6
	btype_err                       : 1,	//     7
	len_err                         : 1,	//     8
	row_err                         : 1,	//     9
	ftype_err                       : 1,	//    10
	read_done                       : 1,	//    11
	time_out                        : 1;	//    12
} INTR_STATUS;

/*-----------------------------------------------------------------------------
	0x0020 intr_clear ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	png_done_clear                  : 1,	//     0
	inflate_done_clear              : 1,	//     1
	tcopt_err_clear                 : 1,	//     2
	tlen_err_clear                  : 1,	//     3
	tgen_err_clear                  : 1,	//     4
	win_err_clear                   : 1,	//     5
	code_err_clear                  : 1,	//     6
	btype_err_clear                 : 1,	//     7
	len_err_clear                   : 1,	//     8
	row_err_clear                   : 1,	//     9
	ftype_err_clear                 : 1,	//    10
	read_done_clear                 : 1,	//    11
	time_out_clear                  : 1;	//    12
} INTR_CLEAR;

/*-----------------------------------------------------------------------------
	0x0024 read_gmau_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cmd_rpri2                       : 4,	//  0: 3
	cmd_rpri1                       : 4,	//  4: 7
	cmd_rdly                        :16,	//  8:23
	cmd_rtxid                       : 4;	// 24:27
} READ_GMAU_CONFIG;

/*-----------------------------------------------------------------------------
	0x0028 write_gmau_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cmd_wpri2                       : 4,	//  0: 3
	cmd_wpri1                       : 4,	//  4: 7
	cmd_wdly                        :16,	//  8:23
	cmd_wtxid                       : 4;	// 24:27
} WRITE_GMAU_CONFIG;

/*-----------------------------------------------------------------------------
	0x002c inflate_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	window_size                     : 3;	//  0: 2
} INFLATE_CONFIG;

/*-----------------------------------------------------------------------------
	0x0030 fifo_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	in_fifo_valid_bits              : 8,	//  0: 7
	                                : 4,	//  8:11 reserved
	r_fifo_space                    : 5;	// 12:16
} FIFO_STATUS;

/*-----------------------------------------------------------------------------
	0x0034 inflate_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	main_state                      : 4,	//  0: 3
	                                : 4,	//  4: 7 reserved
	table_state                     : 4,	//  8:11
	                                : 4,	// 12:15 reserved
	inflate_state                   : 4;	// 16:19
} INFLATE_STATUS;

/*-----------------------------------------------------------------------------
	0x0038 cur_read_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x003c cur_ftr_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0040 ftr_wptr_bnd ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0044 cur_write_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0048 ftr_sl_cnt_msb ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x004c ftr_sl_cnt_lsb ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0050 ftr_in_cnt_msb ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0054 ftr_in_cnt_lsb ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0058 ftr_type ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ftr_type                        : 8;	//  0: 7
} FTR_TYPE;

/*-----------------------------------------------------------------------------
	0x005c ftr_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filter_done                     : 1,	//     0
	                                : 3,	//  1: 3 reserved
	filter_last_line                : 1,	//     4
	inflate_done                    : 1;	//     5
} FTR_STATUS;

/*-----------------------------------------------------------------------------
	0x0060 time_out_mask ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0064 cur_time_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

typedef struct {
	CMD                             	cmd                             ;	// 0x0000 : ''
	UINT32                          	read_base_addr                  ;	// 0x0004 : ''
	UINT32                          	read_byte_size                  ;	// 0x0008 : ''
	UINT32                          	write_base_addr                 ;	// 0x000c : ''
	IMAGE_INFO1                     	image_info1                     ;	// 0x0010 : ''
	IMAGE_INFO2                     	image_info2                     ;	// 0x0014 : ''
	INTR_ENABLE                     	intr_enable                     ;	// 0x0018 : ''
	INTR_STATUS                     	intr_status                     ;	// 0x001c : ''
	INTR_CLEAR                      	intr_clear                      ;	// 0x0020 : ''
	READ_GMAU_CONFIG                	read_gmau_config                ;	// 0x0024 : ''
	WRITE_GMAU_CONFIG               	write_gmau_config               ;	// 0x0028 : ''
	INFLATE_CONFIG                  	inflate_config                  ;	// 0x002c : ''
	FIFO_STATUS                     	fifo_status                     ;	// 0x0030 : ''
	INFLATE_STATUS                  	inflate_status                  ;	// 0x0034 : ''
	UINT32                          	cur_read_addr                   ;	// 0x0038 : ''
	UINT32                          	cur_ftr_wptr                    ;	// 0x003c : ''
	UINT32                          	ftr_wptr_bnd                    ;	// 0x0040 : ''
	UINT32                          	cur_write_addr                  ;	// 0x0044 : ''
	UINT32                          	ftr_sl_cnt_msb                  ;	// 0x0048 : ''
	UINT32                          	ftr_sl_cnt_lsb                  ;	// 0x004c : ''
	UINT32                          	ftr_in_cnt_msb                  ;	// 0x0050 : ''
	UINT32                          	ftr_in_cnt_lsb                  ;	// 0x0054 : ''
	FTR_TYPE                        	ftr_type                        ;	// 0x0058 : ''
	FTR_STATUS                      	ftr_status                      ;	// 0x005c : ''
	UINT32                          	time_out_mask                   ;	// 0x0060 : ''
	UINT32                          	cur_time_cnt                    ;	// 0x0064 : ''

	UINT32								debug_rsvd_1;					;	// 0x0068
	UINT32								debug_valid_chk;				;	// 0x006c
	UINT32								debug_rd_addr;					;	// 0x0070
	UINT32								debug_rd_len;					;	// 0x0074
	UINT32								debug_wr_addr;					;	// 0x0078
	UINT32								debug_wr_len;					;	// 0x006c
} PNG_REG_T;
/* 26 regs, 26 types */

/* 26 regs, 26 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegPNG : real register of PNG.
 * gpRegPNG     : shadow register.
 *
 * @def PNG_RdFL: Read  FLushing : Shadow <- Real.
 * @def PNG_WrFL: Write FLushing : Shadow -> Real.
 * @def PNG_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def PNG_Wr  : Write whole register(UINT32) from Shadow register.
 * @def PNG_Rd01 ~ PNG_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def PNG_Wr01 ~ PNG_Wrnn: Write given '01~nn' fields to   Shadow register.
 *
