/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

#ifndef _REG_OVI_H13B0_h
#define _REG_OVI_H13B0_h

/*
	OVI_TCON
*/

/*-----------------------------------------------------------------------------
	0x0000 tcon_nop ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0004 tcon_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_en                          : 1,	//     0
	wb_en                           : 1,	//     1
	dga_en                          : 1,	//     2
	dither_en                       : 1,	//     3
	xtr_en                          : 1,	//     4
	cinema_en                       : 1,	//     5
	two_port_60_en                  : 1,	//     6
	double_line_en                  : 1;	//     7
} H13B0_OVI_TCON_CONTROL;

/*-----------------------------------------------------------------------------
	0x0008 tcon_test_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_left_en                     : 1,	//     0
	wb_left_en                      : 1,	//     1
	dga_left_en                     : 1,	//     2
	dither_left_en                  : 1,	//     3
	tosel0                          : 1,	//     4
	tosel1                          : 1,	//     5
	_rsvd                            : 1,	//     6
	bypass_en                       : 1;	//     7
} H13B0_OVI_TCON_TEST_CTL;

/*-----------------------------------------------------------------------------
	0x000c tcon_sync_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	out_de_inv                      : 1,	//     0
	out_hsync_inv                   : 1,	//     1
	out_vsync_inv                   : 1,	//     2
	out_vsync_sel                   : 1,	//     3
	in_de_inv                       : 1,	//     4
	in_hsync_inv                    : 1,	//     5
	in_vsync_inv                    : 1,	//     6
	_rsvd                            : 1;	//     7
} H13B0_OVI_TCON_SYNC_CTL;

/*-----------------------------------------------------------------------------
	0x0010 tcon_sts ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pix2_lock                       : 1,	//     0
	init_done1                      : 1,	//     1
	init_done2                      : 1,	//     2
	_rsvd                            : 5;	//  3: 7
} H13B0_OVI_TCON_STS;

/*-----------------------------------------------------------------------------
	0x0014 tcon_dga_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dga_sel0                        : 1,	//     0
	dga_sel1                        : 1,	//     1
	dga_upload                      : 1,	//     2
	_rsvd                            : 5;	//  3: 7
} H13B0_OVI_TCON_DGA_SEL;

/*-----------------------------------------------------------------------------
	0x0018 tcon_odc_opt1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame_freeze_on                 : 1,	//     0
	lodc_en_3d                      : 1,	//     1
	lodc_en_2d                      : 1,	//     2
	_rsvd                            : 2,	//  3: 4
	subpix_shift_right_en           : 1,	//     5
	first_last_subpix_en            : 1,	//     6
	pcid20_en                       : 1;	//     7
} H13B0_OVI_TCON_ODC_OPT1;

/*-----------------------------------------------------------------------------
	0x001c tcon_odc_opt2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_rsvd                            : 3,	//  0: 2
	lr_ind_inv                      : 1,	//     3
	odc_bypass                      : 1,	//     4
	odc_upload                      : 1,	//     5
	lodc_upload                     : 1,	//     6
	wb_odc_en                       : 1;	//     7
} H13B0_OVI_TCON_ODC_OPT2;

/*-----------------------------------------------------------------------------
	0x0020 tcon_btc_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_still_en                    : 1,	//     0
	btc_still_mode0                 : 1,	//     1
	btc_still_mode1                 : 1,	//     2
	btc_last_de_mode                : 1,	//     3
	_rsvd                            : 3,	//  4: 6
	uv_still_en                     : 1;	//     7
} H13B0_OVI_TCON_BTC_CONFIG;

/*-----------------------------------------------------------------------------
	0x0024 tcon_btc_config_iodc_opt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_rsvd_00                         : 1,	//     0
	hk_en                           : 1,	//     1
	k_lsb_mode0                     : 1,	//     2
	k_lsb_mode1                     : 1,	//     3
	hk_still                        : 1,	//     4
	th_mux                          : 1,	//     5
	prev_en                         : 1,	//     6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_BTC_CONFIG_IODC_OPT;

/*-----------------------------------------------------------------------------
	0x0028 tcon_odc_lut1_opt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut1_same_opt                   : 1,	//     0
	lut1_zero_opt                   : 1,	//     1
	lut1_full_opt                   : 1,	//     2
	lut1_add_opt                    : 1,	//     3
	_rsvd                            : 4;	//  4: 7
} H13B0_OVI_TCON_ODC_LUT1_OPT;

/*-----------------------------------------------------------------------------
	0x002c tcon_btc_config_3d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_3d_odc_still_en                 : 1,	//     0
	_3d_btc_still_mode0              : 1,	//     1
	_3d_btc_still_mode1              : 1,	//     2
	_3d_btc_last_de_mode             : 1,	//     3
	_rsvd                            : 3,	//  4: 6
	_3d_uv_still_en                  : 1;	//     7
} H13B0_OVI_TCON_BTC_CONFIG_3D;

/*-----------------------------------------------------------------------------
	0x0030 tcon_btc_config_iodc_opt_3d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_rsvd_00                         : 1,	//     0
	_3d_hk_en                        : 1,	//     1
	_3d_k_lsb_mode0                  : 1,	//     2
	_3d_k_lsb_mode1                  : 1,	//     3
	_3d_hk_still                     : 1,	//     4
	_3d_th_mux                       : 1,	//     5
	prev_en                         : 1,	//     6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_BTC_CONFIG_IODC_OPT_3D;

/*-----------------------------------------------------------------------------
	0x0034 tcon_odc_lut2_opt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_2d_lut2_same_opt                : 1,	//     0
	_2d_lut2_zero_opt                : 1,	//     1
	_2d_lut2_full_opt                : 1,	//     2
	_2d_lut2_add_opt                 : 1,	//     3
	_3d_lut2_same_opt                : 1,	//     4
	_3d_lut2_zero_opt                : 1,	//     5
	_3d_lut2_full_opt                : 1,	//     6
	_3d_lut2_add_opt                : 1;	//     7
} H13B0_OVI_TCON_ODC_LUT2_OPT;

/*-----------------------------------------------------------------------------
	0x0038 tcon_btc_config_lodc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lodc_still_en                   : 1,	//     0
	lodc_still_mode0                : 1,	//     1
	lodc_still_mode1                : 1,	//     2
	lodc_uv_still_en                : 1,	//     3
	_rsvd                            : 4;	//  4: 7
} H13B0_OVI_TCON_BTC_CONFIG_LODC;

/*-----------------------------------------------------------------------------
	0x003c tcon_btc_config_thrsh_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_th_r                        : 8;	//  0: 7
} H13B0_OVI_TCON_BTC_CONFIG_THRSH_R;

/*-----------------------------------------------------------------------------
	0x0040 tcon_btc_config_thrsh_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_th_g                        : 8;	//  0: 7
} H13B0_OVI_TCON_BTC_CONFIG_THRSH_G;

/*-----------------------------------------------------------------------------
	0x0044 tcon_btc_config_thrsh_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_th_b                        : 8;	//  0: 7
} H13B0_OVI_TCON_BTC_CONFIG_THRSH_B;

/*-----------------------------------------------------------------------------
	0x0048 tcon_btc_config_thrsh_lodc_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lodc_th_r                       : 8;	//  0: 7
} H13B0_OVI_TCON_BTC_CONFIG_THRSH_LODC_R;

/*-----------------------------------------------------------------------------
	0x004c tcon_btc_config_thrsh_lodc_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lodc_th_g                       : 8;	//  0: 7
} H13B0_OVI_TCON_BTC_CONFIG_THRSH_LODC_G;

/*-----------------------------------------------------------------------------
	0x0050 tcon_btc_config_thrsh_lodc_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lodc_th_b                       : 8;	//  0: 7
} H13B0_OVI_TCON_BTC_CONFIG_THRSH_LODC_B;

/*-----------------------------------------------------------------------------
	0x0054 tcon_btc_line_margin ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	btc_margin                      : 8;	//  0: 7
} H13B0_OVI_TCON_BTC_LINE_MARGIN;

/*-----------------------------------------------------------------------------
	0x0058 tcon_v_sync_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsyn_st_val                     : 8;	//  0: 7
} H13B0_OVI_TCON_V_SYNC_START;

/*-----------------------------------------------------------------------------
	0x005c tcon_v_sync_end ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsyn_end_val                    : 8;	//  0: 7
} H13B0_OVI_TCON_V_SYNC_END;

/*-----------------------------------------------------------------------------
	0x0060 tcon_wb_rgain_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_r_gain                       : 8;	//  0: 7
} H13B0_OVI_TCON_WB_RGAIN_U;

/*-----------------------------------------------------------------------------
	0x0064 tcon_wb_rgain_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_r_gain                       : 8;	//  0: 7
} H13B0_OVI_TCON_WB_RGAIN_L;

/*-----------------------------------------------------------------------------
	0x0068 tcon_wb_roffset_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_r_offset                     : 8;	//  0: 7
} H13B0_OVI_TCON_WB_ROFFSET_U;

/*-----------------------------------------------------------------------------
	0x006c tcon_wb_roffset_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_r_offset                     : 8;	//  0: 7
} H13B0_OVI_TCON_WB_ROFFSET_L;

/*-----------------------------------------------------------------------------
	0x0070 tcon_wb_ggain_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_g_gain                       : 8;	//  0: 7
} H13B0_OVI_TCON_WB_GGAIN_U;

/*-----------------------------------------------------------------------------
	0x0074 tcon_wb_ggain_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_g_gain                       : 8;	//  0: 7
} H13B0_OVI_TCON_WB_GGAIN_L;

/*-----------------------------------------------------------------------------
	0x0078 tcon_wb_goffset_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_g_offset                     : 8;	//  0: 7
} H13B0_OVI_TCON_WB_GOFFSET_U;

/*-----------------------------------------------------------------------------
	0x007c tcon_wb_goffset_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_g_offset                     : 8;	//  0: 7
} H13B0_OVI_TCON_WB_GOFFSET_L;

/*-----------------------------------------------------------------------------
	0x0080 tcon_wb_bgain_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_b_gain                       : 8;	//  0: 7
} H13B0_OVI_TCON_WB_BGAIN_U;

/*-----------------------------------------------------------------------------
	0x0084 tcon_wb_bgain_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_b_gain                       : 8;	//  0: 7
} H13B0_OVI_TCON_WB_BGAIN_L;

/*-----------------------------------------------------------------------------
	0x0088 tcon_wb_boffset_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_b_offset                     : 8;	//  0: 7
} H13B0_OVI_TCON_WB_BOFFSET_U;

/*-----------------------------------------------------------------------------
	0x008c tcon_wb_boffset_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_b_offset                     : 8;	//  0: 7
} H13B0_OVI_TCON_WB_BOFFSET_L;

/*-----------------------------------------------------------------------------
	0x0090 tcon_sgen_hbp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_hbp                        : 8;	//  0: 7
} H13B0_OVI_TCON_SGEN_HBP;

/*-----------------------------------------------------------------------------
	0x0094 tcon_sgen_hs ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_hs                         : 8;	//  0: 7
} H13B0_OVI_TCON_SGEN_HS;

/*-----------------------------------------------------------------------------
	0x0098 tcon_sgen_hfp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_hfp                        : 8;	//  0: 7
} H13B0_OVI_TCON_SGEN_HFP;

/*-----------------------------------------------------------------------------
	0x009c tcon_sgen_vbp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_vbp                        : 8;	//  0: 7
} H13B0_OVI_TCON_SGEN_VBP;

/*-----------------------------------------------------------------------------
	0x00a0 tcon_sgen_vs ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_vs                         : 8;	//  0: 7
} H13B0_OVI_TCON_SGEN_VS;

/*-----------------------------------------------------------------------------
	0x00a4 tcon_sgen_vfp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_vfp                        : 8;	//  0: 7
} H13B0_OVI_TCON_SGEN_VFP;

/*-----------------------------------------------------------------------------
	0x00a8 tcon_sgen_dewidth_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_dewidth                    : 3;	//  0: 2
} H13B0_OVI_TCON_SGEN_DEWIDTH_U;

/*-----------------------------------------------------------------------------
	0x00ac tcon_sgen_dewidth_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_dewidth                    : 8;	//  0: 7
} H13B0_OVI_TCON_SGEN_DEWIDTH_L;

/*-----------------------------------------------------------------------------
	0x00b0 tcon_sgen_denum_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_denumber                   : 4;	//  0: 3
} H13B0_OVI_TCON_SGEN_DENUM_U;

/*-----------------------------------------------------------------------------
	0x00b4 tcon_sgen_denum_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_denumber                   : 8;	//  0: 7
} H13B0_OVI_TCON_SGEN_DENUM_L;

/*-----------------------------------------------------------------------------
	0x00b8 tcon_vblank_width ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ver_blank_width                 : 8;	//  0: 7
} H13B0_OVI_TCON_VBLANK_WIDTH;

/*-----------------------------------------------------------------------------
	0x00bc tcon_vsync_width ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsync_width                     : 8;	//  0: 7
} H13B0_OVI_TCON_VSYNC_WIDTH;

/*-----------------------------------------------------------------------------
	0x00c0 tcon_abn_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	abn_en                          : 1;	//     0
} H13B0_OVI_TCON_ABN_EN;

/*-----------------------------------------------------------------------------
	0x00d4 tcon_pgen_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_test                       : 1,	//     0
	pgen_sync_mode                  : 1,	//     1
	pgen_reverse                    : 1,	//     2
	pgen_mode                       : 5;	//  3: 7
} H13B0_OVI_TCON_PGEN_CTL;

/*-----------------------------------------------------------------------------
	0x00d8 tcon_mode_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mode_test                       : 1,	//     0
	mode_test_sel                   : 1;	//     1
} H13B0_OVI_TCON_MODE_CTL;

/*-----------------------------------------------------------------------------
	0x00dc tcon_pgen_vscr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_vscr_en                    : 1,	//     0
	pgen_vscr_up                    : 1,	//     1
	pgen_vscr_val                   : 6;	//  2: 7
} H13B0_OVI_TCON_PGEN_VSCR;

/*-----------------------------------------------------------------------------
	0x00e0 tcon_pgen_hscr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_hscr_en                    : 1,	//     0
	pgen_hscr_left                  : 1,	//     1
	pgne_hscr_val                   : 6;	//  2: 7
} H13B0_OVI_TCON_PGEN_HSCR;

/*-----------------------------------------------------------------------------
	0x00e4 tcon_pgen_agpr1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_r1                   : 2;	//  0: 1
} H13B0_OVI_TCON_PGEN_AGPR1_U;

/*-----------------------------------------------------------------------------
	0x00e8 tcon_pgen_agpr1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_r1                   : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_AGPR1_L;

/*-----------------------------------------------------------------------------
	0x00ec tcon_pgen_agpg1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_g1                   : 2;	//  0: 1
} H13B0_OVI_TCON_PGEN_AGPG1_U;

/*-----------------------------------------------------------------------------
	0x00f0 tcon_pgen_agpg1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_g1                   : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_AGPG1_L;

/*-----------------------------------------------------------------------------
	0x00f4 tcon_pgen_agpb1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_b1                   : 2;	//  0: 1
} H13B0_OVI_TCON_PGEN_AGPB1_U;

/*-----------------------------------------------------------------------------
	0x00f8 tcon_pgen_agpb1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_b1                   : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_AGPB1_L;

/*-----------------------------------------------------------------------------
	0x00fc tcon_pgen_agpr2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_r2                   : 2;	//  0: 1
} H13B0_OVI_TCON_PGEN_AGPR2_U;

/*-----------------------------------------------------------------------------
	0x0100 tcon_pgen_agpr2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_r2                   : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_AGPR2_L;

/*-----------------------------------------------------------------------------
	0x0104 tcon_pgen_agpg2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_g2                   : 2;	//  0: 1
} H13B0_OVI_TCON_PGEN_AGPG2_U;

/*-----------------------------------------------------------------------------
	0x0108 tcon_pgen_agpg2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_g2                   : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_AGPG2_L;

/*-----------------------------------------------------------------------------
	0x010c tcon_pgen_agpb2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_b2                   : 2;	//  0: 1
} H13B0_OVI_TCON_PGEN_AGPB2_U;

/*-----------------------------------------------------------------------------
	0x0110 tcon_pgen_agpb2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_b2                   : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_AGPB2_L;

/*-----------------------------------------------------------------------------
	0x0114 tcon_pgen_vline1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_vline1                     : 4;	//  0: 3
} H13B0_OVI_TCON_PGEN_VLINE1_U;

/*-----------------------------------------------------------------------------
	0x0118 tcon_pgen_vline1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_vline1                     : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_VLINE1_L;

/*-----------------------------------------------------------------------------
	0x011c tcon_pgen_vline2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_vline2                     : 4;	//  0: 3
} H13B0_OVI_TCON_PGEN_VLINE2_U;

/*-----------------------------------------------------------------------------
	0x0120 tcon_pgen_vline2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_vline2                     : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_VLINE2_L;

/*-----------------------------------------------------------------------------
	0x0124 tcon_pgen_hline1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_hpixel1                    : 4;	//  0: 3
} H13B0_OVI_TCON_PGEN_HLINE1_U;

/*-----------------------------------------------------------------------------
	0x0128 tcon_pgen_hline1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_hpixel1                    : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_HLINE1_L;

/*-----------------------------------------------------------------------------
	0x012c tcon_pgen_hline2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_hpixel2                    : 4;	//  0: 3
} H13B0_OVI_TCON_PGEN_HLINE2_U;

/*-----------------------------------------------------------------------------
	0x0130 tcon_pgen_hline2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_hpixel2                    : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_HLINE2_L;

/*-----------------------------------------------------------------------------
	0x0134 tcon_pgen_x1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_x1                         : 4;	//  0: 3
} H13B0_OVI_TCON_PGEN_X1_U;

/*-----------------------------------------------------------------------------
	0x0138 tcon_pgen_x1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_x1                         : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_X1_L;

/*-----------------------------------------------------------------------------
	0x013c tcon_pgen_x2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_x2                         : 4;	//  0: 3
} H13B0_OVI_TCON_PGEN_X2_U;

/*-----------------------------------------------------------------------------
	0x0140 tcon_pgen_x2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_x2                         : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_X2_L;

/*-----------------------------------------------------------------------------
	0x0144 tcon_pgen_y1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_y1                         : 4;	//  0: 3
} H13B0_OVI_TCON_PGEN_Y1_U;

/*-----------------------------------------------------------------------------
	0x0148 tcon_pgen_y1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_y1                         : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_Y1_L;

/*-----------------------------------------------------------------------------
	0x014c tcon_pgen_y2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_y2                         : 4;	//  0: 3
} H13B0_OVI_TCON_PGEN_Y2_U;

/*-----------------------------------------------------------------------------
	0x0150 tcon_pgen_y2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_y2                         : 8;	//  0: 7
} H13B0_OVI_TCON_PGEN_Y2_L;

/*-----------------------------------------------------------------------------
	0x0154 tcon_dither_carry ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither_sel                      : 2;	//  0: 1
} H13B0_OVI_TCON_DITHER_CARRY;

/*-----------------------------------------------------------------------------
	0x0160 tcon_base_address0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	base_address                    : 8;	//  0: 7
} H13B0_OVI_TCON_BASE_ADDRESS0;

/*-----------------------------------------------------------------------------
	0x0164 tcon_base_address1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	base_address                    : 8;	//  0: 7
} H13B0_OVI_TCON_BASE_ADDRESS1;

/*-----------------------------------------------------------------------------
	0x0168 tcon_base_address2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	base_address                    : 8;	//  0: 7
} H13B0_OVI_TCON_BASE_ADDRESS2;

/*-----------------------------------------------------------------------------
	0x016c tcon_base_address3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	base_address                    : 8;	//  0: 7
} H13B0_OVI_TCON_BASE_ADDRESS3;

/*-----------------------------------------------------------------------------
	0x0170 tcon_offset0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          : 8;	//  0: 7
} H13B0_OVI_TCON_OFFSET0;

/*-----------------------------------------------------------------------------
	0x0174 tcon_offset1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          : 8;	//  0: 7
} H13B0_OVI_TCON_OFFSET1;

/*-----------------------------------------------------------------------------
	0x0178 tcon_offset2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          : 8;	//  0: 7
} H13B0_OVI_TCON_OFFSET2;

/*-----------------------------------------------------------------------------
	0x017c tcon_offset3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          : 8;	//  0: 7
} H13B0_OVI_TCON_OFFSET3;

/*-----------------------------------------------------------------------------
	0x0180 tcon_pri_user ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	write_priority                  : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	read_priority                   : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_PRI_USER;

/*-----------------------------------------------------------------------------
	0x0184 tcon_axi_status0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err0_cnt              : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS0;

/*-----------------------------------------------------------------------------
	0x0188 tcon_axi_status1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err1_cnt              : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS1;

/*-----------------------------------------------------------------------------
	0x018c tcon_axi_status2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err2_cnt              : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS2;

/*-----------------------------------------------------------------------------
	0x0190 tcon_axi_status3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err3_cnt              : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS3;

/*-----------------------------------------------------------------------------
	0x0194 tcon_axi_status4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err4_cnt              : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS4;

/*-----------------------------------------------------------------------------
	0x0198 tcon_axi_status5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_sequence_err                : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS5;

/*-----------------------------------------------------------------------------
	0x019c tcon_axi_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	flush_en_vsync                  : 1,	//     0
	flush_en_cpu                    : 1,	//     1
	flush_en_self                   : 1,	//     2
	flush_done_mask                 : 1;	//     3
} H13B0_OVI_TCON_AXI_CTL;

/*-----------------------------------------------------------------------------
	0x01a0 tcon_axi_write_wait ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	write_wait                      : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_WRITE_WAIT;

/*-----------------------------------------------------------------------------
	0x01a4 tcon_axi_read_wait ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	read_wait                       : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_READ_WAIT;

/*-----------------------------------------------------------------------------
	0x01a8 tcon_axi_burst_wait ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	burst_wait                      : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_BURST_WAIT;

/*-----------------------------------------------------------------------------
	0x01ac tcon_tmp0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01b0 tcon_tmp1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01b4 tcon_tmp2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01b8 tcon_tmp3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01bc tcon_tmp4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01c0 tcon_tmp5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01c4 tcon_tmp6 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01c8 tcon_tmp7 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01cc tcon_tmp8 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01d0 tcon_tmp9 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01d4 tcon_mem_ls ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_ls_en                       : 1,	//     0
	axi_ls_en                       : 1,	//     1
	dga_ls_en                       : 1,	//     2
	dither_ls_en                    : 1,	//     3
	_rsvd                            : 4;	//  4: 7
} H13B0_OVI_TCON_MEM_LS;

/*-----------------------------------------------------------------------------
	0x01d8 tcon_mon_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mon_sel0                        : 1,	//     0
	mon_sel1                        : 1;	//     1
} H13B0_OVI_TCON_MON_SEL;

/*-----------------------------------------------------------------------------
	0x01dc tcon_init_test ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	init1_test                      : 1,	//     0
	init2_test                      : 1;	//     1
} H13B0_OVI_TCON_INIT_TEST;

/*-----------------------------------------------------------------------------
	0x01e0 tcon_axi_status6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_read_err0_cnt               : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS6;

/*-----------------------------------------------------------------------------
	0x01e4 tcon_axi_status7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_read_err1_cnt               : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS7;

/*-----------------------------------------------------------------------------
	0x01e8 tcon_axi_status8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_read_err2_cnt               : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS8;

/*-----------------------------------------------------------------------------
	0x01ec tcon_axi_status9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_rsvd                            : 8;	//  0: 7
} H13B0_OVI_TCON_AXI_STATUS9;

/*-----------------------------------------------------------------------------
	0x01f0 tcon_bit_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bit_sel                         : 1;	//     0
} H13B0_OVI_TCON_BIT_SEL;

/*-----------------------------------------------------------------------------
	0x01f4 tcon_x_start_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x_start                         : 1;	//     0
} H13B0_OVI_TCON_X_START_U;

/*-----------------------------------------------------------------------------
	0x01f8 tcon_x_start_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x_start                         : 8;	//  0: 7
} H13B0_OVI_TCON_X_START_L;

/*-----------------------------------------------------------------------------
	0x01fc tcon_x_end_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x_end                           : 1;	//     0
} H13B0_OVI_TCON_X_END_U;

/*-----------------------------------------------------------------------------
	0x0200 tcon_x_end_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x_end                           : 8;	//  0: 7
} H13B0_OVI_TCON_X_END_L;

/*-----------------------------------------------------------------------------
	0x0204 tcon_y_start_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_start                         : 3;	//  0: 2
} H13B0_OVI_TCON_Y_START_U;

/*-----------------------------------------------------------------------------
	0x0208 tcon_y_start_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_start                         : 8;	//  0: 7
} H13B0_OVI_TCON_Y_START_L;

/*-----------------------------------------------------------------------------
	0x020c tcon_y_end_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_end                           : 3;	//  0: 2
} H13B0_OVI_TCON_Y_END_U;

/*-----------------------------------------------------------------------------
	0x0210 tcon_y_end_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_end                           : 8;	//  0: 7
} H13B0_OVI_TCON_Y_END_L;

/*-----------------------------------------------------------------------------
	0x0214 tcon_th_gray_diff_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gray_diff_th                    : 2;	//  0: 1
} H13B0_OVI_TCON_TH_GRAY_DIFF_U;

/*-----------------------------------------------------------------------------
	0x0218 tcon_th_gray_diff_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gray_diff_th                    : 8;	//  0: 7
} H13B0_OVI_TCON_TH_GRAY_DIFF_L;

/*-----------------------------------------------------------------------------
	0x021c tcon_th_pat_value_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_th                    : 4;	//  0: 3
} H13B0_OVI_TCON_TH_PAT_VALUE_U;

/*-----------------------------------------------------------------------------
	0x0220 tcon_th_pat_value_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_th                    : 8;	//  0: 7
} H13B0_OVI_TCON_TH_PAT_VALUE_M;

/*-----------------------------------------------------------------------------
	0x0224 tcon_th_pat_value_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_th                    : 8;	//  0: 7
} H13B0_OVI_TCON_TH_PAT_VALUE_L;

/*-----------------------------------------------------------------------------
	0x0228 tcon_pat_id_hold ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_id_hold                     : 1;	//     0
} H13B0_OVI_TCON_PAT_ID_HOLD;

/*-----------------------------------------------------------------------------
	0x022c tcon_pat_id_dec ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_id_dec                      : 4;	//  0: 3
} H13B0_OVI_TCON_PAT_ID_DEC;

/*-----------------------------------------------------------------------------
	0x0230 tcon_pat_id_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_id_1                        : 4;	//  0: 3
} H13B0_OVI_TCON_PAT_ID_1;

/*-----------------------------------------------------------------------------
	0x0234 tcon_pat_value_1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_1                     : 4;	//  0: 3
} H13B0_OVI_TCON_PAT_VALUE_1_U;

/*-----------------------------------------------------------------------------
	0x0238 tcon_pat_value_1_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_1                     : 8;	//  0: 7
} H13B0_OVI_TCON_PAT_VALUE_1_M;

/*-----------------------------------------------------------------------------
	0x023c tcon_pat_value_1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_1                     : 8;	//  0: 7
} H13B0_OVI_TCON_PAT_VALUE_1_L;

/*-----------------------------------------------------------------------------
	0x0240 tcon_pat_id_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_id_2                        : 4;	//  0: 3
} H13B0_OVI_TCON_PAT_ID_2;

/*-----------------------------------------------------------------------------
	0x0244 tcon_pat_value_2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_2                     : 4;	//  0: 3
} H13B0_OVI_TCON_PAT_VALUE_2_U;

/*-----------------------------------------------------------------------------
	0x0248 tcon_pat_value_2_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_2                     : 8;	//  0: 7
} H13B0_OVI_TCON_PAT_VALUE_2_M;

/*-----------------------------------------------------------------------------
	0x024c tcon_pat_value_2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_2                     : 8;	//  0: 7
} H13B0_OVI_TCON_PAT_VALUE_2_L;

/*-----------------------------------------------------------------------------
	0x0250 tcon_pat_mask_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_mask                        : 2;	//  0: 1
} H13B0_OVI_TCON_PAT_MASK_1;

/*-----------------------------------------------------------------------------
	0x0254 tcon_pat_mask_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_mask                        : 8;	//  0: 7
} H13B0_OVI_TCON_PAT_MASK_2;

/*-----------------------------------------------------------------------------
	0x0258 tcon_frontdummy ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fdummy                          : 4;	//  0: 3
} H13B0_OVI_TCON_FRONTDUMMY;

/*-----------------------------------------------------------------------------
	0x025c tcon_backdummy ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bdummy                          : 5;	//  0: 4
} H13B0_OVI_TCON_BACKDUMMY;

/*-----------------------------------------------------------------------------
	0x0260 tcon_vertline_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vline                           : 4;	//  0: 3
} H13B0_OVI_TCON_VERTLINE_U;

/*-----------------------------------------------------------------------------
	0x0264 tcon_vertline_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vline                           : 8;	//  0: 7
} H13B0_OVI_TCON_VERTLINE_L;

/*-----------------------------------------------------------------------------
	0x0268 tcon_ltd_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ltd_right                       : 1,	//     0
	ltd_even                        : 1,	//     1
	ltd_en                          : 1;	//     2
} H13B0_OVI_TCON_LTD_MODE;

/*-----------------------------------------------------------------------------
	0x026c tcon_swap_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	swap_eo                         : 1,	//     0
	swap_rgb                        : 1;	//     1
} H13B0_OVI_TCON_SWAP_MODE;

/*-----------------------------------------------------------------------------
	0x0270 tcon_hor_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hor_reverse                     : 1,	//     0
	hor_divide                      : 1;	//     1
} H13B0_OVI_TCON_HOR_MODE;

/*-----------------------------------------------------------------------------
	0x0274 tcon_dfhd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dfhd                            : 1;	//     0
} H13B0_OVI_TCON_DFHD;

/*-----------------------------------------------------------------------------
	0x0278 tcon_mtest_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_en                        : 4;	//  0: 3
} H13B0_OVI_TCON_MTEST_EN;

/*-----------------------------------------------------------------------------
	0x027c tcon_mtest_p0r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p0r                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P0R;

/*-----------------------------------------------------------------------------
	0x0280 tcon_mtest_p0g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p0g                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P0G;

/*-----------------------------------------------------------------------------
	0x0284 tcon_mtest_p0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p0b                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P0B;

/*-----------------------------------------------------------------------------
	0x0288 tcon_mtest_p1r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p1r                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P1R;

/*-----------------------------------------------------------------------------
	0x028c tcon_mtest_p1g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p1g                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P1G;

/*-----------------------------------------------------------------------------
	0x0290 tcon_mtest_p1b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p1b                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P1B;

/*-----------------------------------------------------------------------------
	0x0294 tcon_mtest_p2r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p2r                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P2R;

/*-----------------------------------------------------------------------------
	0x0298 tcon_mtest_p2g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p2g                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P2G;

/*-----------------------------------------------------------------------------
	0x029c tcon_mtest_p2b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p2b                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P2B;

/*-----------------------------------------------------------------------------
	0x02a0 tcon_mtest_p3r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p3r                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P3R;

/*-----------------------------------------------------------------------------
	0x02a4 tcon_mtest_p3g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p3g                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P3G;

/*-----------------------------------------------------------------------------
	0x02a8 tcon_mtest_p3b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_p3b                       : 8;	//  0: 7
} H13B0_OVI_TCON_MTEST_P3B;

/*-----------------------------------------------------------------------------
	0x02ac tcon_epi_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_mode                         : 1,	//     0
	epi_num0                        : 1,	//     1
	epi_num1                        : 1,	//     2
	epi_sel_en                      : 1,	//     3
	epi_last_en                     : 1;	//     4
} H13B0_OVI_TCON_EPI_MODE;

/*-----------------------------------------------------------------------------
	0x02b0 tcon_epi_sel0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel                         : 8;	//  0: 7
} H13B0_OVI_TCON_EPI_SEL0;

/*-----------------------------------------------------------------------------
	0x02b4 tcon_epi_sel1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel                         : 8;	//  0: 7
} H13B0_OVI_TCON_EPI_SEL1;

/*-----------------------------------------------------------------------------
	0x02b8 tcon_epi_sel2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel                         : 8;	//  0: 7
} H13B0_OVI_TCON_EPI_SEL2;

/*-----------------------------------------------------------------------------
	0x02bc tcon_epi_sel3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel                         : 8;	//  0: 7
} H13B0_OVI_TCON_EPI_SEL3;

/*-----------------------------------------------------------------------------
	0x02c0 tcon_epi_sel4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel                         : 8;	//  0: 7
} H13B0_OVI_TCON_EPI_SEL4;

/*-----------------------------------------------------------------------------
	0x02c4 tcon_epi_sel5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel                         : 8;	//  0: 7
} H13B0_OVI_TCON_EPI_SEL5;

/*-----------------------------------------------------------------------------
	0x02c8 tcon_epi_sel6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel                         : 8;	//  0: 7
} H13B0_OVI_TCON_EPI_SEL6;

/*-----------------------------------------------------------------------------
	0x02cc tcon_epi_sel7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel                         : 8;	//  0: 7
} H13B0_OVI_TCON_EPI_SEL7;

/*-----------------------------------------------------------------------------
	0x02d0 tcon_soe_start0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start0                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START0;

/*-----------------------------------------------------------------------------
	0x02d4 tcon_soe_width0_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width0                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH0_U;

/*-----------------------------------------------------------------------------
	0x02d8 tcon_soe_width0_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width0                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH0_L;

/*-----------------------------------------------------------------------------
	0x02dc tcon_soe_start1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start1                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START1;

/*-----------------------------------------------------------------------------
	0x02e0 tcon_soe_width1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width1                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH1_U;

/*-----------------------------------------------------------------------------
	0x02e4 tcon_soe_width1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width1                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH1_L;

/*-----------------------------------------------------------------------------
	0x02e8 tcon_soe_start2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start2                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START2;

/*-----------------------------------------------------------------------------
	0x02ec tcon_soe_width2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width2                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH2_U;

/*-----------------------------------------------------------------------------
	0x02f0 tcon_soe_width2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width2                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH2_L;

/*-----------------------------------------------------------------------------
	0x02f4 tcon_soe_start3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start3                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START3;

/*-----------------------------------------------------------------------------
	0x02f8 tcon_soe_width3_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width3                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH3_U;

/*-----------------------------------------------------------------------------
	0x02fc tcon_soe_width3_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width3                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH3_L;

/*-----------------------------------------------------------------------------
	0x0300 tcon_soe_start4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start4                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START4;

/*-----------------------------------------------------------------------------
	0x0304 tcon_soe_width4_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width4                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH4_U;

/*-----------------------------------------------------------------------------
	0x0308 tcon_soe_width4_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width4                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH4_L;

/*-----------------------------------------------------------------------------
	0x030c tcon_soe_start5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start5                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START5;

/*-----------------------------------------------------------------------------
	0x0310 tcon_soe_width5_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width5                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH5_U;

/*-----------------------------------------------------------------------------
	0x0314 tcon_soe_width5_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width5                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH5_L;

/*-----------------------------------------------------------------------------
	0x0318 tcon_soe_start6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start6                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START6;

/*-----------------------------------------------------------------------------
	0x031c tcon_soe_width6_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width6                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH6_U;

/*-----------------------------------------------------------------------------
	0x0320 tcon_soe_width6_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width6                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH6_L;

/*-----------------------------------------------------------------------------
	0x0324 tcon_soe_start7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start7                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START7;

/*-----------------------------------------------------------------------------
	0x0328 tcon_soe_width7_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width7                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH7_U;

/*-----------------------------------------------------------------------------
	0x032c tcon_soe_width7_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width7                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH7_L;

/*-----------------------------------------------------------------------------
	0x0330 tcon_soe_start8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start8                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START8;

/*-----------------------------------------------------------------------------
	0x0334 tcon_soe_width8_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width8                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH8_U;

/*-----------------------------------------------------------------------------
	0x0338 tcon_soe_width8_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width8                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH8_L;

/*-----------------------------------------------------------------------------
	0x033c tcon_soe_start9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start9                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START9;

/*-----------------------------------------------------------------------------
	0x0340 tcon_soe_width9_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width9                      : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH9_U;

/*-----------------------------------------------------------------------------
	0x0344 tcon_soe_width9_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width9                      : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH9_L;

/*-----------------------------------------------------------------------------
	0x0348 tcon_soe_start10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start10                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START10;

/*-----------------------------------------------------------------------------
	0x034c tcon_soe_width10_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width10                     : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH10_U;

/*-----------------------------------------------------------------------------
	0x0350 tcon_soe_width10_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width10                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH10_L;

/*-----------------------------------------------------------------------------
	0x0354 tcon_soe_start11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start11                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START11;

/*-----------------------------------------------------------------------------
	0x0358 tcon_soe_width11_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width11                     : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH11_U;

/*-----------------------------------------------------------------------------
	0x035c tcon_soe_width11_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width11                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH11_L;

/*-----------------------------------------------------------------------------
	0x0360 tcon_soe_start12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start12                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START12;

/*-----------------------------------------------------------------------------
	0x0364 tcon_soe_width12_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width12                     : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH12_U;

/*-----------------------------------------------------------------------------
	0x0368 tcon_soe_width12_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width12                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH12_L;

/*-----------------------------------------------------------------------------
	0x036c tcon_soe_start13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start13                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START13;

/*-----------------------------------------------------------------------------
	0x0370 tcon_soe_width13_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width13                     : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH13_U;

/*-----------------------------------------------------------------------------
	0x0374 tcon_soe_width13_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width13                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH13_L;

/*-----------------------------------------------------------------------------
	0x0378 tcon_soe_start14 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start14                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START14;

/*-----------------------------------------------------------------------------
	0x037c tcon_soe_width14_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width14                     : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH14_U;

/*-----------------------------------------------------------------------------
	0x0380 tcon_soe_width14_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width14                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH14_L;

/*-----------------------------------------------------------------------------
	0x0384 tcon_soe_start15 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_start15                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_START15;

/*-----------------------------------------------------------------------------
	0x0388 tcon_soe_width15_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width15                     : 2;	//  0: 1
} H13B0_OVI_TCON_SOE_WIDTH15_U;

/*-----------------------------------------------------------------------------
	0x038c tcon_soe_width15_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	soe_width15                     : 8;	//  0: 7
} H13B0_OVI_TCON_SOE_WIDTH15_L;

/*-----------------------------------------------------------------------------
	0x0390 tcon_gmaen_0123 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gmaen_0_1                         : 1,	//     0
	gmaen_0_2                         : 1,	//     1
	gmaen_1_1                         : 1,	//     2
	gmaen_1_2                         : 1,	//     3
	gmaen_2_1                         : 1,	//     4
	gmaen_2_2                         : 1,	//     5
	gmaen_3_1                         : 1,	//     6
	gmaen_3_2                         : 1;	//     7
} H13B0_OVI_TCON_GMAEN_0123;

/*-----------------------------------------------------------------------------
	0x0394 tcon_gmaen_4567 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gmaen_4_1                         : 1,	//     0
	gmaen_4_2                         : 1,	//     1
	gmaen_5_1                         : 1,	//     2
	gmaen_5_2                         : 1,	//     3
	_rsvd_00                         : 1,	//     4
	_rsvd_01                         : 1,	//     5
	_rsvd_02                         : 1,	//     6
	_rsvd_03                         : 1;	//     7
} H13B0_OVI_TCON_GMAEN_4567;

/*-----------------------------------------------------------------------------
	0x0398 tcon_gmaen_89ab ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gmaen_8                         : 2,	//  0: 1
	gmaen_9                         : 2,	//  2: 3
	gmaen_a                         : 2,	//  4: 5
	gmaen_b                         : 2;	//  6: 7
} H13B0_OVI_TCON_GMAEN_89AB;

/*-----------------------------------------------------------------------------
	0x039c tcon_gmaen_cdef ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gmaen_c                         : 2,	//  0: 1
	gmaen_d                         : 2,	//  2: 3
	gmaen_e                         : 2,	//  4: 5
	gmaen_f                         : 2;	//  6: 7
} H13B0_OVI_TCON_GMAEN_CDEF;

/*-----------------------------------------------------------------------------
	0x03a0 tcon_epi_ctr2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mode                            : 1,	//     0
	ltd1                            : 1,	//     1
	ltd2                            : 1,	//     2
	pwrc1                           : 1,	//     3
	pwrc2                           : 1,	//     4
	csc                             : 1,	//     5
	polc                            : 1,	//     6
	_rsvd                            : 1;	//     7
} H13B0_OVI_TCON_EPI_CTR2;

/*-----------------------------------------------------------------------------
	0x03a4 tcon_gspline_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gspline                         : 3;	//  0: 2
} H13B0_OVI_TCON_GSPLINE_U;

/*-----------------------------------------------------------------------------
	0x03a8 tcon_gspline_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gspline                         : 8;	//  0: 7
} H13B0_OVI_TCON_GSPLINE_L;

/*-----------------------------------------------------------------------------
	0x03ac tcon_dpm_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpm_on_fra0                     : 1,	//     0
	dpm_on_fra1                     : 1,	//     1
	dpm_on_fra2                     : 1,	//     2
	dpm_on_fra3                     : 1,	//     3
	dpm_mask_fra0                   : 1,	//     4
	dpm_mask_fra1                   : 1,	//     5
	dpm_mask_fra2                   : 1,	//     6
	dpm_mask_fra3                   : 1;	//     7
} H13B0_OVI_TCON_DPM_CNT;

/*-----------------------------------------------------------------------------
	0x03b0 tcon_vst_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_en                          : 1,	//     0
	vst_m1_en                       : 1,	//     1
	vst_m2_en                       : 1,	//     2
	vst_m3_en                       : 1,	//     3
	vst_p2_en                       : 1,	//     4
	vst_v_m_d                       : 1,	//     5
	_rsvd                            : 2;	//  6: 7
} H13B0_OVI_TCON_VST_CONTROL;

/*-----------------------------------------------------------------------------
	0x03b4 tcon_vst_dpm ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_pre_dpm_en                  : 1,	//     0
	vst_dpm_en                      : 1,	//     1
	vst_post_dpm_en                 : 1,	//     2
	vst_dm_d                        : 1,	//     3
	_rsvd                            : 4;	//  4: 7
} H13B0_OVI_TCON_VST_DPM;

/*-----------------------------------------------------------------------------
	0x03b8 tcon_vst_m1_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_line1                    : 4,	//  0: 3
	vst_m1_line2                    : 4;	//  4: 7
} H13B0_OVI_TCON_VST_M1_LINE_U;

/*-----------------------------------------------------------------------------
	0x03bc tcon_vst_m1_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_line1                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M1_LINE1_L;

/*-----------------------------------------------------------------------------
	0x03c0 tcon_vst_m1_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_line2                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M1_LINE2_L;

/*-----------------------------------------------------------------------------
	0x03c4 tcon_vst_m1_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_pix1                     : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	vst_m1_pix2                     : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_VST_M1_PIX_U;

/*-----------------------------------------------------------------------------
	0x03c8 tcon_vst_m1_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_pix1                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M1_PIX1_L;

/*-----------------------------------------------------------------------------
	0x03cc tcon_vst_m1_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_pix2                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M1_PIX2_L;

/*-----------------------------------------------------------------------------
	0x03d0 tcon_vst_m12_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_d0                       : 1,	//     0
	vst_m1_d1                       : 1,	//     1
	vst_m1_d2                       : 1,	//     2
	_rsvd_00                         : 1,	//     3
	vst_m2_d0                       : 1,	//     4
	vst_m2_d1                       : 1,	//     5
	vst_m2_d2                       : 1,	//     6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_VST_M12_D;

/*-----------------------------------------------------------------------------
	0x03d4 tcon_vst_m2_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_line1                    : 4,	//  0: 3
	vst_m2_line2                    : 4;	//  4: 7
} H13B0_OVI_TCON_VST_M2_LINE_U;

/*-----------------------------------------------------------------------------
	0x03d8 tcon_vst_m2_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_line1                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M2_LINE1_L;

/*-----------------------------------------------------------------------------
	0x03dc tcon_vst_m2_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_line2                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M2_LINE2_L;

/*-----------------------------------------------------------------------------
	0x03e0 tcon_vst_m2_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_pix1                     : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	vst_m2_pix2                     : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_VST_M2_PIX_U;

/*-----------------------------------------------------------------------------
	0x03e4 tcon_vst_m2_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_pix1                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M2_PIX1_L;

/*-----------------------------------------------------------------------------
	0x03e8 tcon_vst_m2_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_pix2                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M2_PIX2_L;

/*-----------------------------------------------------------------------------
	0x03ec tcon_vst_m3_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_line1                    : 4,	//  0: 3
	vst_m3_line2                    : 4;	//  4: 7
} H13B0_OVI_TCON_VST_M3_LINE_U;

/*-----------------------------------------------------------------------------
	0x03f0 tcon_vst_m3_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_line1                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M3_LINE1_L;

/*-----------------------------------------------------------------------------
	0x03f4 tcon_vst_m3_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_line2                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M3_LINE2_L;

/*-----------------------------------------------------------------------------
	0x03f8 tcon_vst_m3_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_pix1                     : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	vst_m3_pix2                     : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_VST_M3_PIX_U;

/*-----------------------------------------------------------------------------
	0x03fc tcon_vst_m3_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_pix1                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M3_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0400 tcon_vst_m3_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_pix2                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_M3_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0404 tcon_vst_m3_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_d0                       : 1,	//     0
	vst_m3_d1                       : 1,	//     1
	vst_m3_d2                       : 1;	//     2
} H13B0_OVI_TCON_VST_M3_D;

/*-----------------------------------------------------------------------------
	0x0408 tcon_vst_p_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p1_line                     : 4,	//  0: 3
	vst_p2_line                     : 4;	//  4: 7
} H13B0_OVI_TCON_VST_P_LINE;

/*-----------------------------------------------------------------------------
	0x040c tcon_vst_p1_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p1_pix1                     : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	vst_p1_pix2                     : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_VST_P1_PIX_U;

/*-----------------------------------------------------------------------------
	0x0410 tcon_vst_p1_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p1_pix1                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_P1_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0414 tcon_vst_p1_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p1_pix2                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_P1_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0418 tcon_vst_p12_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p1_d0                       : 1,	//     0
	vst_p1_d1                       : 1,	//     1
	vst_p1_d2                       : 1,	//     2
	_rsvd_00                         : 1,	//     3
	vst_p2_d0                       : 1,	//     4
	vst_p2_d1                       : 1,	//     5
	vst_p2_d2                       : 1,	//     6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_VST_P12_D;

/*-----------------------------------------------------------------------------
	0x041c tcon_vst_p2_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p2_pix1                     : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	vst_p2_pix2                     : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_VST_P2_PIX_U;

/*-----------------------------------------------------------------------------
	0x0420 tcon_vst_p2_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p2_pix1                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_P2_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0424 tcon_vst_p2_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p2_pix2                     : 8;	//  0: 7
} H13B0_OVI_TCON_VST_P2_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0428 tcon_eo_fcon_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_en                      : 1,	//     0
	eo_fcon_f2_en                   : 1;	//     1
} H13B0_OVI_TCON_EO_FCON_CONTROL;

/*-----------------------------------------------------------------------------
	0x042c tcon_eo_fcon_dpm ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_pre_dpm_en              : 1,	//     0
	eo_fcon_dpm_en                  : 1,	//     1
	eo_fcon_post_dpm_en             : 1,	//     2
	eo_fcon_dm_d                    : 1;	//     3
} H13B0_OVI_TCON_EO_FCON_DPM;

/*-----------------------------------------------------------------------------
	0x0430 tcon_eo_fcon_f1_fra_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_fra                  : 3;	//  0: 2
} H13B0_OVI_TCON_EO_FCON_F1_FRA_U;

/*-----------------------------------------------------------------------------
	0x0434 tcon_eo_fcon_f1_fra_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_fra                  : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F1_FRA_L;

/*-----------------------------------------------------------------------------
	0x0438 tcon_eo_fcon_f1_pix1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_pix1                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F1_PIX1_U;

/*-----------------------------------------------------------------------------
	0x043c tcon_eo_fcon_f1_pix1_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_pix1                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F1_PIX1_M;

/*-----------------------------------------------------------------------------
	0x0440 tcon_eo_fcon_f1_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_pix1                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F1_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0444 tcon_eo_fcon_f1_pix2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_pix2                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F1_PIX2_U;

/*-----------------------------------------------------------------------------
	0x0448 tcon_eo_fcon_f1_pix2_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_pix2                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F1_PIX2_M;

/*-----------------------------------------------------------------------------
	0x044c tcon_eo_fcon_f1_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_pix2                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F1_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0450 tcon_eo_fcon_f1_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_d0                   : 1,	//     0
	eo_fcon_f1_d1                   : 1,	//     1
	eo_fcon_f1_d2                   : 1,	//     2
	eo_fcon_f1_d3                   : 1;	//     3
} H13B0_OVI_TCON_EO_FCON_F1_D;

/*-----------------------------------------------------------------------------
	0x0454 tcon_eo_fcon_f2_fra_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_fra                  : 3;	//  0: 2
} H13B0_OVI_TCON_EO_FCON_F2_FRA_U;

/*-----------------------------------------------------------------------------
	0x0458 tcon_eo_fcon_f2_fra_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_fra                  : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F2_FRA_L;

/*-----------------------------------------------------------------------------
	0x045c tcon_eo_fcon_f2_pix1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_pix1                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F2_PIX1_U;

/*-----------------------------------------------------------------------------
	0x0460 tcon_eo_fcon_f2_pix1_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_pix1                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F2_PIX1_M;

/*-----------------------------------------------------------------------------
	0x0464 tcon_eo_fcon_f2_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_pix1                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F2_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0468 tcon_eo_fcon_f2_pix2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_pix2                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F2_PIX2_U;

/*-----------------------------------------------------------------------------
	0x046c tcon_eo_fcon_f2_pix2_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_pix2                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F2_PIX2_M;

/*-----------------------------------------------------------------------------
	0x0470 tcon_eo_fcon_f2_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_pix2                 : 8;	//  0: 7
} H13B0_OVI_TCON_EO_FCON_F2_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0474 tcon_eo_fcon_f2_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f2_d0                   : 1,	//     0
	eo_fcon_f2_d1                   : 1,	//     1
	eo_fcon_f2_d2                   : 1,	//     2
	eo_fcon_f2_d3                   : 1;	//     3
} H13B0_OVI_TCON_EO_FCON_F2_D;

/*-----------------------------------------------------------------------------
	0x0478 tcon_gclk_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_en                         : 1,	//     0
	gclk_m1_en                      : 1,	//     1
	gclk_m2_en                      : 1,	//     2
	gclk_m3_en                      : 1,	//     3
	gclk_p2_en                      : 1,	//     4
	gclk_v_m_d                      : 1;	//     5
} H13B0_OVI_TCON_GCLK_CONTROL;

/*-----------------------------------------------------------------------------
	0x047c tcon_gclk_dpm ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_pre_dpm_en                 : 1,	//     0
	gclk_dpm_en                     : 1,	//     1
	gclk_post_dpm_en                : 1,	//     2
	gclk_dm_d                       : 1;	//     3
} H13B0_OVI_TCON_GCLK_DPM;

/*-----------------------------------------------------------------------------
	0x0480 tcon_gclk_m1_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_line1                   : 4,	//  0: 3
	gclk_m1_line2                   : 4;	//  4: 7
} H13B0_OVI_TCON_GCLK_M1_LINE_U;

/*-----------------------------------------------------------------------------
	0x0484 tcon_gclk_m1_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_line1                   : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M1_LINE1_L;

/*-----------------------------------------------------------------------------
	0x0488 tcon_gclk_m1_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_line2                   : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M1_LINE2_L;

/*-----------------------------------------------------------------------------
	0x048c tcon_gclk_m1_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	gclk_m1_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_GCLK_M1_PIX_U;

/*-----------------------------------------------------------------------------
	0x0490 tcon_gclk_m1_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M1_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0494 tcon_gclk_m1_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M1_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0498 tcon_gclk_m12_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_d0                      : 1,	//     0
	gclk_m1_d1                      : 1,	//     1
	gclk_m1_d2                      : 1,	//     2
	_rsvd_00                         : 1,	//     3
	gclk_m2_d0                      : 1,	//     4
	gclk_m2_d1                      : 1,	//     5
	gclk_m2_d2                      : 1,	//     6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_GCLK_M12_D;

/*-----------------------------------------------------------------------------
	0x049c tcon_gclk_m2_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_line1                   : 4,	//  0: 3
	gclk_m2_line2                   : 4;	//  4: 7
} H13B0_OVI_TCON_GCLK_M2_LINE_U;

/*-----------------------------------------------------------------------------
	0x04a0 tcon_gclk_m2_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_line1                   : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M2_LINE1_L;

/*-----------------------------------------------------------------------------
	0x04a4 tcon_gclk_m2_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_line2                   : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M2_LINE2_L;

/*-----------------------------------------------------------------------------
	0x04a8 tcon_gclk_m2_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	gclk_m2_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_GCLK_M2_PIX_U;

/*-----------------------------------------------------------------------------
	0x04ac tcon_gclk_m2_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M2_PIX1_L;

/*-----------------------------------------------------------------------------
	0x04b0 tcon_gclk_m2_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M2_PIX2_L;

/*-----------------------------------------------------------------------------
	0x04b4 tcon_gclk_m3_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_line1                   : 4,	//  0: 3
	gclk_m3_line2                   : 4;	//  4: 7
} H13B0_OVI_TCON_GCLK_M3_LINE_U;

/*-----------------------------------------------------------------------------
	0x04b8 tcon_gclk_m3_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_line1                   : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M3_LINE1_L;

/*-----------------------------------------------------------------------------
	0x04bc tcon_gclk_m3_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_line2                   : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M3_LINE2_L;

/*-----------------------------------------------------------------------------
	0x04c0 tcon_gclk_m3_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_pix1                    : 4,	//  0: 3
	gclk_m3_pix2                    : 4;	//  4: 7
} H13B0_OVI_TCON_GCLK_M3_PIX_U;

/*-----------------------------------------------------------------------------
	0x04c4 tcon_gclk_m3_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M3_PIX1_L;

/*-----------------------------------------------------------------------------
	0x04c8 tcon_gclk_m3_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_M3_PIX2_L;

/*-----------------------------------------------------------------------------
	0x04cc tcon_gclk_m3_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_d0                      : 1,	//     0
	gclk_m3_d1                      : 1,	//     1
	gclk_m3_d2                      : 1;	//     2
} H13B0_OVI_TCON_GCLK_M3_D;

/*-----------------------------------------------------------------------------
	0x04d0 tcon_gclk_p_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p1_line                    : 4,	//  0: 3
	gclk_p2_line                    : 4;	//  4: 7
} H13B0_OVI_TCON_GCLK_P_LINE;

/*-----------------------------------------------------------------------------
	0x04d4 tcon_gclk_p1_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p1_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	gclk_p1_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_GCLK_P1_PIX_U;

/*-----------------------------------------------------------------------------
	0x04d8 tcon_gclk_p1_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p1_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_P1_PIX1_L;

/*-----------------------------------------------------------------------------
	0x04dc tcon_gclk_p1_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p1_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_P1_PIX2_L;

/*-----------------------------------------------------------------------------
	0x04e0 tcon_gclk_p12_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p1_d0                      : 1,	//     0
	gclk_p1_d1                      : 1,	//     1
	gclk_p1_d2                      : 1,	//     2
	_rsvd_00                         : 1,	//     3
	gclk_p2_d0                      : 1,	//     4
	gclk_p2_d1                      : 1,	//     5
	gclk_p2_d2                      : 1,	//     6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_GCLK_P12_D;

/*-----------------------------------------------------------------------------
	0x04e4 tcon_gclk_p2_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p2_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	gclk_p2_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_GCLK_P2_PIX_U;

/*-----------------------------------------------------------------------------
	0x04e8 tcon_gclk_p2_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p2_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_P2_PIX1_L;

/*-----------------------------------------------------------------------------
	0x04ec tcon_gclk_p2_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p2_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_GCLK_P2_PIX2_L;

/*-----------------------------------------------------------------------------
	0x04f0 tcon_mclk_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_en                         : 1,	//     0
	mclk_m1_en                      : 1,	//     1
	mclk_m2_en                      : 1,	//     2
	mclk_m3_en                      : 1,	//     3
	mclk_p2_en                      : 1,	//     4
	mclk_v_m_d                      : 1;	//     5
} H13B0_OVI_TCON_MCLK_CONTROL;

/*-----------------------------------------------------------------------------
	0x04f4 tcon_mclk_dpm ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_pre_dpm_en                 : 1,	//     0
	mclk_dpm_en                     : 1,	//     1
	mclk_post_dpm_en                : 1,	//     2
	mclk_dm_d                       : 1;	//     3
} H13B0_OVI_TCON_MCLK_DPM;

/*-----------------------------------------------------------------------------
	0x04f8 tcon_mclk_m1_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_line1                   : 4,	//  0: 3
	mclk_m1_line2                   : 4;	//  4: 7
} H13B0_OVI_TCON_MCLK_M1_LINE_U;

/*-----------------------------------------------------------------------------
	0x04fc tcon_mclk_m1_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_line1                   : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M1_LINE1_L;

/*-----------------------------------------------------------------------------
	0x0500 tcon_mclk_m1_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_line2                   : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M1_LINE2_L;

/*-----------------------------------------------------------------------------
	0x0504 tcon_mclk_m1_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	mclk_m1_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_MCLK_M1_PIX_U;

/*-----------------------------------------------------------------------------
	0x0508 tcon_mclk_m1_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M1_PIX1_L;

/*-----------------------------------------------------------------------------
	0x050c tcon_mclk_m1_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M1_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0510 tcon_mclk_m12_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_d0                      : 1,	//     0
	mclk_m1_d1                      : 1,	//     1
	mclk_m1_d2                      : 1,	//     2
	_rsvd_00                         : 1,	//     3
	mclk_m2_d0                      : 1,	//     4
	mclk_m2_d1                      : 1,	//     5
	mclk_m2_d2                      : 1,	//     6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_MCLK_M12_D;

/*-----------------------------------------------------------------------------
	0x0514 tcon_mclk_m2_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_line1                   : 4,	//  0: 3
	mclk_m2_line2                   : 4;	//  4: 7
} H13B0_OVI_TCON_MCLK_M2_LINE_U;

/*-----------------------------------------------------------------------------
	0x0518 tcon_mclk_m2_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_line1                   : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M2_LINE1_L;

/*-----------------------------------------------------------------------------
	0x051c tcon_mclk_m2_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_line2                   : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M2_LINE2_L;

/*-----------------------------------------------------------------------------
	0x0520 tcon_mclk_m2_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	mclk_m2_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_MCLK_M2_PIX_U;

/*-----------------------------------------------------------------------------
	0x0524 tcon_mclk_m2_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M2_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0528 tcon_mclk_m2_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M2_PIX2_L;

/*-----------------------------------------------------------------------------
	0x052c tcon_mclk_m3_line_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_line1                   : 4,	//  0: 3
	mclk_m3_line2                   : 4;	//  4: 7
} H13B0_OVI_TCON_MCLK_M3_LINE_U;

/*-----------------------------------------------------------------------------
	0x0530 tcon_mclk_m3_line1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_line1                   : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M3_LINE1_L;

/*-----------------------------------------------------------------------------
	0x0534 tcon_mclk_m3_line2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_line2                   : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M3_LINE2_L;

/*-----------------------------------------------------------------------------
	0x0538 tcon_mclk_m3_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	mclk_m3_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_MCLK_M3_PIX_U;

/*-----------------------------------------------------------------------------
	0x053c tcon_mclk_m3_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M3_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0540 tcon_mclk_m3_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_M3_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0544 tcon_mclk_m3_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_d0                      : 1,	//     0
	mclk_m3_d1                      : 1,	//     1
	mclk_m3_d2                      : 1;	//     2
} H13B0_OVI_TCON_MCLK_M3_D;

/*-----------------------------------------------------------------------------
	0x0548 tcon_mclk_p_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_line                    : 4,	//  0: 3
	mclk_p2_line                    : 4;	//  4: 7
} H13B0_OVI_TCON_MCLK_P_LINE;

/*-----------------------------------------------------------------------------
	0x054c tcon_mclk_p1_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	mclk_p1_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_MCLK_P1_PIX_U;

/*-----------------------------------------------------------------------------
	0x0550 tcon_mclk_p1_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_P1_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0554 tcon_mclk_p1_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_P1_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0558 tcon_mclk_p12_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_d0                      : 1,	//     0
	mclk_p1_d1                      : 1,	//     1
	mclk_p1_d2                      : 1,	//     2
	_rsvd_00                         : 1,	//     3
	mclk_p2_d0                      : 1,	//     4
	mclk_p2_d1                      : 1,	//     5
	mclk_p2_d2                      : 1,	//     6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_MCLK_P12_D;

/*-----------------------------------------------------------------------------
	0x055c tcon_mclk_p2_pix_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p2_pix1                    : 3,	//  0: 2
	_rsvd_00                         : 1,	//     3
	mclk_p2_pix2                    : 3,	//  4: 6
	_rsvd_01                         : 1;	//     7
} H13B0_OVI_TCON_MCLK_P2_PIX_U;

/*-----------------------------------------------------------------------------
	0x0560 tcon_mclk_p2_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p2_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_P2_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0564 tcon_mclk_p2_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p2_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_MCLK_P2_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0568 tcon_eo_abn_pix1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_pix1                     : 8;	//  0: 7
} H13B0_OVI_TCON_EO_ABN_PIX1_U;

/*-----------------------------------------------------------------------------
	0x056c tcon_eo_abn_pix1_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_pix1                     : 8;	//  0: 7
} H13B0_OVI_TCON_EO_ABN_PIX1_M;

/*-----------------------------------------------------------------------------
	0x0570 tcon_eo_abn_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_pix1                     : 8;	//  0: 7
} H13B0_OVI_TCON_EO_ABN_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0574 tcon_eo_abn_pix2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_pix2                     : 8;	//  0: 7
} H13B0_OVI_TCON_EO_ABN_PIX2_U;

/*-----------------------------------------------------------------------------
	0x0578 tcon_eo_abn_pix2_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_pix2                     : 8;	//  0: 7
} H13B0_OVI_TCON_EO_ABN_PIX2_M;

/*-----------------------------------------------------------------------------
	0x057c tcon_eo_abn_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_pix2                     : 8;	//  0: 7
} H13B0_OVI_TCON_EO_ABN_PIX2_L;

/*-----------------------------------------------------------------------------
	0x0580 tcon_eo_abn_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_d0                       : 1,	//     0
	eo_abn_d1                       : 1,	//     1
	eo_abn_d2                       : 1;	//     2
} H13B0_OVI_TCON_EO_ABN_D;

/*-----------------------------------------------------------------------------
	0x0584 tcon_vst_abn_pix1_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_ABN_PIX1_U;

/*-----------------------------------------------------------------------------
	0x0588 tcon_vst_abn_pix1_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_ABN_PIX1_M;

/*-----------------------------------------------------------------------------
	0x058c tcon_vst_abn_pix1_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_pix1                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_ABN_PIX1_L;

/*-----------------------------------------------------------------------------
	0x0590 tcon_vst_abn_pix2_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_ABN_PIX2_U;

/*-----------------------------------------------------------------------------
	0x0594 tcon_vst_abn_pix2_m ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_ABN_PIX2_M;

/*-----------------------------------------------------------------------------
	0x0598 tcon_vst_abn_pix2_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_pix2                    : 8;	//  0: 7
} H13B0_OVI_TCON_VST_ABN_PIX2_L;

/*-----------------------------------------------------------------------------
	0x059c tcon_vst_abn_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_d0                      : 1,	//     0
	vst_abn_d1                      : 1,	//     1
	vst_abn_d2                      : 1;	//     2
} H13B0_OVI_TCON_VST_ABN_D;

/*-----------------------------------------------------------------------------
	0x05a0 tcon_pol_normal ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	normal_frame_num                : 3,	//  0: 2
	normal_h_conv                   : 1,	//     3
	normal_line_num                 : 2,	//  4: 5
	normal_line_t                   : 1,	//     6
	normal_pol_t                    : 1;	//     7
} H13B0_OVI_TCON_POL_NORMAL;

/*-----------------------------------------------------------------------------
	0x05a4 tcon_pol_xtr1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xtr_frame_num0                  : 1,	//     0
	xtr_frame_num1                  : 1,	//     1
	xtr_frame_num2                  : 1,	//     2
	xtr_h_conv                      : 1,	//     3
	xtr_line_num0                   : 1,	//     4
	xtr_line_num1                   : 1,	//     5
	xtr_line_t                      : 1,	//     6
	xtr_pol_t                       : 1;	//     7
} H13B0_OVI_TCON_POL_XTR1;

/*-----------------------------------------------------------------------------
	0x05a8 tcon_pol_xtr2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xtr_frame_shift0                : 1,	//     0
	xtr_frame_shift1                : 1,	//     1
	xtr_pol_en                      : 1;	//     2
} H13B0_OVI_TCON_POL_XTR2;

/*-----------------------------------------------------------------------------
	0x05ac tcon_pol_dpc1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc1_frame_num                  : 3,	//  0: 2
	dpc1_h_conv                     : 1,	//     3
	dpc1_line_num                   : 2,	//  4: 5
	dpc1_line_t                     : 1,	//     6
	dpc1_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC1;

/*-----------------------------------------------------------------------------
	0x05b0 tcon_pol_dpc2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc2_frame_num                  : 3,	//  0: 2
	dpc2_h_conv                     : 1,	//     3
	dpc2_line_num                   : 2,	//  4: 5
	dpc2_line_t                     : 1,	//     6
	dpc2_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC2;

/*-----------------------------------------------------------------------------
	0x05b4 tcon_pol_dpc3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc3_frame_num                  : 3,	//  0: 2
	dpc3_h_conv                     : 1,	//     3
	dpc3_line_num                   : 2,	//  4: 5
	dpc3_line_t                     : 1,	//     6
	dpc3_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC3;

/*-----------------------------------------------------------------------------
	0x05b8 tcon_pol_dpc4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc4_frame_num                  : 3,	//  0: 2
	dpc4_h_conv                     : 1,	//     3
	dpc4_line_num                   : 2,	//  4: 5
	dpc4_line_t                     : 1,	//     6
	dpc4_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC4;

/*-----------------------------------------------------------------------------
	0x05bc tcon_pol_dpc5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc5_frame_num                  : 3,	//  0: 2
	dpc5_h_conv                     : 1,	//     3
	dpc5_line_num                   : 2,	//  4: 5
	dpc5_line_t                     : 1,	//     6
	dpc5_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC5;

/*-----------------------------------------------------------------------------
	0x05c0 tcon_pol_dpc6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc6_frame_num                  : 3,	//  0: 2
	dpc6_h_conv                     : 1,	//     3
	dpc6_line_num                   : 2,	//  4: 5
	dpc6_line_t                     : 1,	//     6
	dpc6_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC6;

/*-----------------------------------------------------------------------------
	0x05c4 tcon_pol_dpc7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc7_frame_num                  : 3,	//  0: 2
	dpc7_h_conv                     : 1,	//     3
	dpc7_line_num                   : 2,	//  4: 5
	dpc7_line_t                     : 1,	//     6
	dpc7_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC7;

/*-----------------------------------------------------------------------------
	0x05c8 tcon_pol_dpc8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc8_frame_num                  : 3,	//  0: 2
	dpc8_h_conv                     : 1,	//     3
	dpc8_line_num                   : 2,	//  4: 5
	dpc8_line_t                     : 1,	//     6
	dpc8_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC8;

/*-----------------------------------------------------------------------------
	0x05cc tcon_pol_dpc9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc9_frame_num                  : 3,	//  0: 2
	dpc9_h_conv                     : 1,	//     3
	dpc9_line_num                   : 2,	//  4: 5
	dpc9_line_t                     : 1,	//     6
	dpc9_pol_t                      : 1;	//     7
} H13B0_OVI_TCON_POL_DPC9;

/*-----------------------------------------------------------------------------
	0x05d0 tcon_pol_dpc10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc10_frame_num                 : 3,	//  0: 2
	dpc10_h_conv                    : 1,	//     3
	dpc10_line_num                  : 2,	//  4: 5
	dpc10_line_t                    : 1,	//     6
	dpc10_pol_t                     : 1;	//     7
} H13B0_OVI_TCON_POL_DPC10;

/*-----------------------------------------------------------------------------
	0x05d4 tcon_hconv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	h_conv_pol                      : 1,	//     0
	xtr_delay                       : 1;	//     1
} H13B0_OVI_TCON_HCONV;

/*-----------------------------------------------------------------------------
	0x073c tcon_status ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0800 tcon_dga_low_rs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x13fc tcon_dga_low_re ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1400 tcon_dga_low_gs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1ffc tcon_dga_low_ge ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x2000 tcon_dga_low_bs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x2bfc tcon_dga_low_be ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x2c00 tcon_dga_med_rs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x37fc tcon_dga_med_re ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3800 tcon_dga_med_gs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x43fc tcon_dga_med_ge ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x4400 tcon_dga_med_bs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x4ffc tcon_dga_med_be ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x5000 tcon_dga_high_rs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x5bfc tcon_dga_high_re ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x5c00 tcon_dga_high_gs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x67fc tcon_dga_high_ge ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x6800 tcon_dga_high_bs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x73fc tcon_dga_high_be ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x7400 tcon_dither_start ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x77fc tcon_dither_end ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x7800 tcon_odc_start_2d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x7c80 tcon_odc_end_2d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x7cc0 tcon_odc_start_3d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x8140 tcon_odc_end_3d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x8180 tcon_lodc_start_3d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x8600 tcon_lodc_end_3d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x8640 tcon_end ''
------------------------------------------------------------------------------*/
/*	no field */

typedef struct {
	UINT32                          				tcon_nop                        ;	// 0x0000 : ''
	H13B0_OVI_TCON_CONTROL                    	tcon_control                    ;	// 0x0004 : ''
	H13B0_OVI_TCON_TEST_CTL                   	tcon_test_ctl                   ;	// 0x0008 : ''
	H13B0_OVI_TCON_SYNC_CTL                   	tcon_sync_ctl                   ;	// 0x000c : ''
	H13B0_OVI_TCON_STS                        	tcon_sts                        ;	// 0x0010 : ''
	H13B0_OVI_TCON_DGA_SEL                    	tcon_dga_sel                    ;	// 0x0014 : ''
	H13B0_OVI_TCON_ODC_OPT1                   	tcon_odc_opt1                   ;	// 0x0018 : ''
	H13B0_OVI_TCON_ODC_OPT2                   	tcon_odc_opt2                   ;	// 0x001c : ''
	H13B0_OVI_TCON_BTC_CONFIG                 	tcon_btc_config                 ;	// 0x0020 : ''
	H13B0_OVI_TCON_BTC_CONFIG_IODC_OPT        	tcon_btc_config_iodc_opt        ;	// 0x0024 : ''
	H13B0_OVI_TCON_ODC_LUT1_OPT               	tcon_odc_lut1_opt               ;	// 0x0028 : ''
	H13B0_OVI_TCON_BTC_CONFIG_3D              	tcon_btc_config_3d              ;	// 0x002c : ''
	H13B0_OVI_TCON_BTC_CONFIG_IODC_OPT_3D     	tcon_btc_config_iodc_opt_3d     ;	// 0x0030 : ''
	H13B0_OVI_TCON_ODC_LUT2_OPT               	tcon_odc_lut2_opt               ;	// 0x0034 : ''
	H13B0_OVI_TCON_BTC_CONFIG_LODC            	tcon_btc_config_lodc            ;	// 0x0038 : ''
	H13B0_OVI_TCON_BTC_CONFIG_THRSH_R         	tcon_btc_config_thrsh_r         ;	// 0x003c : ''
	H13B0_OVI_TCON_BTC_CONFIG_THRSH_G         	tcon_btc_config_thrsh_g         ;	// 0x0040 : ''
	H13B0_OVI_TCON_BTC_CONFIG_THRSH_B         	tcon_btc_config_thrsh_b         ;	// 0x0044 : ''
	H13B0_OVI_TCON_BTC_CONFIG_THRSH_LODC_R    	tcon_btc_config_thrsh_lodc_r    ;	// 0x0048 : ''
	H13B0_OVI_TCON_BTC_CONFIG_THRSH_LODC_G    	tcon_btc_config_thrsh_lodc_g    ;	// 0x004c : ''
	H13B0_OVI_TCON_BTC_CONFIG_THRSH_LODC_B    	tcon_btc_config_thrsh_lodc_b    ;	// 0x0050 : ''
	H13B0_OVI_TCON_BTC_LINE_MARGIN            	tcon_btc_line_margin            ;	// 0x0054 : ''
	H13B0_OVI_TCON_V_SYNC_START               	tcon_v_sync_start               ;	// 0x0058 : ''
	H13B0_OVI_TCON_V_SYNC_END                 	tcon_v_sync_end                 ;	// 0x005c : ''
	H13B0_OVI_TCON_WB_RGAIN_U                 	tcon_wb_rgain_u                 ;	// 0x0060 : ''
	H13B0_OVI_TCON_WB_RGAIN_L                 	tcon_wb_rgain_l                 ;	// 0x0064 : ''
	H13B0_OVI_TCON_WB_ROFFSET_U               	tcon_wb_roffset_u               ;	// 0x0068 : ''
	H13B0_OVI_TCON_WB_ROFFSET_L               	tcon_wb_roffset_l               ;	// 0x006c : ''
	H13B0_OVI_TCON_WB_GGAIN_U                 	tcon_wb_ggain_u                 ;	// 0x0070 : ''
	H13B0_OVI_TCON_WB_GGAIN_L                 	tcon_wb_ggain_l                 ;	// 0x0074 : ''
	H13B0_OVI_TCON_WB_GOFFSET_U               	tcon_wb_goffset_u               ;	// 0x0078 : ''
	H13B0_OVI_TCON_WB_GOFFSET_L               	tcon_wb_goffset_l               ;	// 0x007c : ''
	H13B0_OVI_TCON_WB_BGAIN_U                 	tcon_wb_bgain_u                 ;	// 0x0080 : ''
	H13B0_OVI_TCON_WB_BGAIN_L                 	tcon_wb_bgain_l                 ;	// 0x0084 : ''
	H13B0_OVI_TCON_WB_BOFFSET_U               	tcon_wb_boffset_u               ;	// 0x0088 : ''
	H13B0_OVI_TCON_WB_BOFFSET_L               	tcon_wb_boffset_l               ;	// 0x008c : ''
	H13B0_OVI_TCON_SGEN_HBP                   	tcon_sgen_hbp                   ;	// 0x0090 : ''
	H13B0_OVI_TCON_SGEN_HS                    	tcon_sgen_hs                    ;	// 0x0094 : ''
	H13B0_OVI_TCON_SGEN_HFP                   	tcon_sgen_hfp                   ;	// 0x0098 : ''
	H13B0_OVI_TCON_SGEN_VBP                   	tcon_sgen_vbp                   ;	// 0x009c : ''
	H13B0_OVI_TCON_SGEN_VS                    	tcon_sgen_vs                    ;	// 0x00a0 : ''
	H13B0_OVI_TCON_SGEN_VFP                   	tcon_sgen_vfp                   ;	// 0x00a4 : ''
	H13B0_OVI_TCON_SGEN_DEWIDTH_U             	tcon_sgen_dewidth_u             ;	// 0x00a8 : ''
	H13B0_OVI_TCON_SGEN_DEWIDTH_L             	tcon_sgen_dewidth_l             ;	// 0x00ac : ''
	H13B0_OVI_TCON_SGEN_DENUM_U               	tcon_sgen_denum_u               ;	// 0x00b0 : ''
	H13B0_OVI_TCON_SGEN_DENUM_L               	tcon_sgen_denum_l               ;	// 0x00b4 : ''
	H13B0_OVI_TCON_VBLANK_WIDTH               	tcon_vblank_width               ;	// 0x00b8 : ''
	H13B0_OVI_TCON_VSYNC_WIDTH                	tcon_vsync_width                ;	// 0x00bc : ''
	H13B0_OVI_TCON_ABN_EN                     	tcon_abn_en                     ;	// 0x00c0 : ''
	UINT32                          	                 _rsvd_00[   4];	// 0x00c4 ~ 0x00d0
	H13B0_OVI_TCON_PGEN_CTL                   	tcon_pgen_ctl                   ;	// 0x00d4 : ''
	H13B0_OVI_TCON_MODE_CTL                   	tcon_mode_ctl                   ;	// 0x00d8 : ''
	H13B0_OVI_TCON_PGEN_VSCR                  	tcon_pgen_vscr                  ;	// 0x00dc : ''
	H13B0_OVI_TCON_PGEN_HSCR                  	tcon_pgen_hscr                  ;	// 0x00e0 : ''
	H13B0_OVI_TCON_PGEN_AGPR1_U               	tcon_pgen_agpr1_u               ;	// 0x00e4 : ''
	H13B0_OVI_TCON_PGEN_AGPR1_L               	tcon_pgen_agpr1_l               ;	// 0x00e8 : ''
	H13B0_OVI_TCON_PGEN_AGPG1_U               	tcon_pgen_agpg1_u               ;	// 0x00ec : ''
	H13B0_OVI_TCON_PGEN_AGPG1_L               	tcon_pgen_agpg1_l               ;	// 0x00f0 : ''
	H13B0_OVI_TCON_PGEN_AGPB1_U               	tcon_pgen_agpb1_u               ;	// 0x00f4 : ''
	H13B0_OVI_TCON_PGEN_AGPB1_L               	tcon_pgen_agpb1_l               ;	// 0x00f8 : ''
	H13B0_OVI_TCON_PGEN_AGPR2_U               	tcon_pgen_agpr2_u               ;	// 0x00fc : ''
	H13B0_OVI_TCON_PGEN_AGPR2_L               	tcon_pgen_agpr2_l               ;	// 0x0100 : ''
	H13B0_OVI_TCON_PGEN_AGPG2_U               	tcon_pgen_agpg2_u               ;	// 0x0104 : ''
	H13B0_OVI_TCON_PGEN_AGPG2_L               	tcon_pgen_agpg2_l               ;	// 0x0108 : ''
	H13B0_OVI_TCON_PGEN_AGPB2_U               	tcon_pgen_agpb2_u               ;	// 0x010c : ''
	H13B0_OVI_TCON_PGEN_AGPB2_L               	tcon_pgen_agpb2_l               ;	// 0x0110 : ''
	H13B0_OVI_TCON_PGEN_VLINE1_U              	tcon_pgen_vline1_u              ;	// 0x0114 : ''
	H13B0_OVI_TCON_PGEN_VLINE1_L              	tcon_pgen_vline1_l              ;	// 0x0118 : ''
	H13B0_OVI_TCON_PGEN_VLINE2_U              	tcon_pgen_vline2_u              ;	// 0x011c : ''
	H13B0_OVI_TCON_PGEN_VLINE2_L              	tcon_pgen_vline2_l              ;	// 0x0120 : ''
	H13B0_OVI_TCON_PGEN_HLINE1_U              	tcon_pgen_hline1_u              ;	// 0x0124 : ''
	H13B0_OVI_TCON_PGEN_HLINE1_L              	tcon_pgen_hline1_l              ;	// 0x0128 : ''
	H13B0_OVI_TCON_PGEN_HLINE2_U              	tcon_pgen_hline2_u              ;	// 0x012c : ''
	H13B0_OVI_TCON_PGEN_HLINE2_L              	tcon_pgen_hline2_l              ;	// 0x0130 : ''
	H13B0_OVI_TCON_PGEN_X1_U                  	tcon_pgen_x1_u                  ;	// 0x0134 : ''
	H13B0_OVI_TCON_PGEN_X1_L                  	tcon_pgen_x1_l                  ;	// 0x0138 : ''
	H13B0_OVI_TCON_PGEN_X2_U                  	tcon_pgen_x2_u                  ;	// 0x013c : ''
	H13B0_OVI_TCON_PGEN_X2_L                  	tcon_pgen_x2_l                  ;	// 0x0140 : ''
	H13B0_OVI_TCON_PGEN_Y1_U                  	tcon_pgen_y1_u                  ;	// 0x0144 : ''
	H13B0_OVI_TCON_PGEN_Y1_L                  	tcon_pgen_y1_l                  ;	// 0x0148 : ''
	H13B0_OVI_TCON_PGEN_Y2_U                  	tcon_pgen_y2_u                  ;	// 0x014c : ''
	H13B0_OVI_TCON_PGEN_Y2_L                  	tcon_pgen_y2_l                  ;	// 0x0150 : ''
	H13B0_OVI_TCON_DITHER_CARRY               	tcon_dither_carry               ;	// 0x0154 : ''
	UINT32                          	                 _rsvd_01[   2];	// 0x0158 ~ 0x015c
	H13B0_OVI_TCON_BASE_ADDRESS0              	tcon_base_address0              ;	// 0x0160 : ''
	H13B0_OVI_TCON_BASE_ADDRESS1              	tcon_base_address1              ;	// 0x0164 : ''
	H13B0_OVI_TCON_BASE_ADDRESS2              	tcon_base_address2              ;	// 0x0168 : ''
	H13B0_OVI_TCON_BASE_ADDRESS3              	tcon_base_address3              ;	// 0x016c : ''
	H13B0_OVI_TCON_OFFSET0                    	tcon_offset0                    ;	// 0x0170 : ''
	H13B0_OVI_TCON_OFFSET1                    	tcon_offset1                    ;	// 0x0174 : ''
	H13B0_OVI_TCON_OFFSET2                    	tcon_offset2                    ;	// 0x0178 : ''
	H13B0_OVI_TCON_OFFSET3                    	tcon_offset3                    ;	// 0x017c : ''
	H13B0_OVI_TCON_PRI_USER                   	tcon_pri_user                   ;	// 0x0180 : ''
	H13B0_OVI_TCON_AXI_STATUS0                	tcon_axi_status0                ;	// 0x0184 : ''
	H13B0_OVI_TCON_AXI_STATUS1                	tcon_axi_status1                ;	// 0x0188 : ''
	H13B0_OVI_TCON_AXI_STATUS2                	tcon_axi_status2                ;	// 0x018c : ''
	H13B0_OVI_TCON_AXI_STATUS3                	tcon_axi_status3                ;	// 0x0190 : ''
	H13B0_OVI_TCON_AXI_STATUS4                	tcon_axi_status4                ;	// 0x0194 : ''
	H13B0_OVI_TCON_AXI_STATUS5                	tcon_axi_status5                ;	// 0x0198 : ''
	H13B0_OVI_TCON_AXI_CTL                    	tcon_axi_ctl                    ;	// 0x019c : ''
	H13B0_OVI_TCON_AXI_WRITE_WAIT             	tcon_axi_write_wait             ;	// 0x01a0 : ''
	H13B0_OVI_TCON_AXI_READ_WAIT              	tcon_axi_read_wait              ;	// 0x01a4 : ''
	H13B0_OVI_TCON_AXI_BURST_WAIT             	tcon_axi_burst_wait             ;	// 0x01a8 : ''
	UINT32                          	tcon_tmp0                       ;	// 0x01ac : ''
	UINT32                          	tcon_tmp1                       ;	// 0x01b0 : ''
	UINT32                          	tcon_tmp2                       ;	// 0x01b4 : ''
	UINT32                          	tcon_tmp3                       ;	// 0x01b8 : ''
	UINT32                          	tcon_tmp4                       ;	// 0x01bc : ''
	UINT32                          	tcon_tmp5                       ;	// 0x01c0 : ''
	UINT32                          	tcon_tmp6                       ;	// 0x01c4 : ''
	UINT32                          	tcon_tmp7                       ;	// 0x01c8 : ''
	UINT32                          	tcon_tmp8                       ;	// 0x01cc : ''
	UINT32                          	tcon_tmp9                       ;	// 0x01d0 : ''
	H13B0_OVI_TCON_MEM_LS                     	tcon_mem_ls                     ;	// 0x01d4 : ''
	H13B0_OVI_TCON_MON_SEL                    	tcon_mon_sel                    ;	// 0x01d8 : ''
	H13B0_OVI_TCON_INIT_TEST                  	tcon_init_test                  ;	// 0x01dc : ''
	H13B0_OVI_TCON_AXI_STATUS6                	tcon_axi_status6                ;	// 0x01e0 : ''
	H13B0_OVI_TCON_AXI_STATUS7                	tcon_axi_status7                ;	// 0x01e4 : ''
	H13B0_OVI_TCON_AXI_STATUS8                	tcon_axi_status8                ;	// 0x01e8 : ''
	H13B0_OVI_TCON_AXI_STATUS9                	tcon_axi_status9                ;	// 0x01ec : ''
	H13B0_OVI_TCON_BIT_SEL                    	tcon_bit_sel                    ;	// 0x01f0 : ''
	H13B0_OVI_TCON_X_START_U                  	tcon_x_start_u                  ;	// 0x01f4 : ''
	H13B0_OVI_TCON_X_START_L                  	tcon_x_start_l                  ;	// 0x01f8 : ''
	H13B0_OVI_TCON_X_END_U                    	tcon_x_end_u                    ;	// 0x01fc : ''
	H13B0_OVI_TCON_X_END_L                    	tcon_x_end_l                    ;	// 0x0200 : ''
	H13B0_OVI_TCON_Y_START_U                  	tcon_y_start_u                  ;	// 0x0204 : ''
	H13B0_OVI_TCON_Y_START_L                  	tcon_y_start_l                  ;	// 0x0208 : ''
	H13B0_OVI_TCON_Y_END_U                    	tcon_y_end_u                    ;	// 0x020c : ''
	H13B0_OVI_TCON_Y_END_L                    	tcon_y_end_l                    ;	// 0x0210 : ''
	H13B0_OVI_TCON_TH_GRAY_DIFF_U             	tcon_th_gray_diff_u             ;	// 0x0214 : ''
	H13B0_OVI_TCON_TH_GRAY_DIFF_L             	tcon_th_gray_diff_l             ;	// 0x0218 : ''
	H13B0_OVI_TCON_TH_PAT_VALUE_U             	tcon_th_pat_value_u             ;	// 0x021c : ''
	H13B0_OVI_TCON_TH_PAT_VALUE_M             	tcon_th_pat_value_m             ;	// 0x0220 : ''
	H13B0_OVI_TCON_TH_PAT_VALUE_L             	tcon_th_pat_value_l             ;	// 0x0224 : ''
	H13B0_OVI_TCON_PAT_ID_HOLD                	tcon_pat_id_hold                ;	// 0x0228 : ''
	H13B0_OVI_TCON_PAT_ID_DEC                 	tcon_pat_id_dec                 ;	// 0x022c : ''
	H13B0_OVI_TCON_PAT_ID_1                   	tcon_pat_id_1                   ;	// 0x0230 : ''
	H13B0_OVI_TCON_PAT_VALUE_1_U              	tcon_pat_value_1_u              ;	// 0x0234 : ''
	H13B0_OVI_TCON_PAT_VALUE_1_M              	tcon_pat_value_1_m              ;	// 0x0238 : ''
	H13B0_OVI_TCON_PAT_VALUE_1_L              	tcon_pat_value_1_l              ;	// 0x023c : ''
	H13B0_OVI_TCON_PAT_ID_2                   	tcon_pat_id_2                   ;	// 0x0240 : ''
	H13B0_OVI_TCON_PAT_VALUE_2_U              	tcon_pat_value_2_u              ;	// 0x0244 : ''
	H13B0_OVI_TCON_PAT_VALUE_2_M              	tcon_pat_value_2_m              ;	// 0x0248 : ''
	H13B0_OVI_TCON_PAT_VALUE_2_L              	tcon_pat_value_2_l              ;	// 0x024c : ''
	H13B0_OVI_TCON_PAT_MASK_1                 	tcon_pat_mask_1                 ;	// 0x0250 : ''
	H13B0_OVI_TCON_PAT_MASK_2                 	tcon_pat_mask_2                 ;	// 0x0254 : ''
	H13B0_OVI_TCON_FRONTDUMMY                 	tcon_frontdummy                 ;	// 0x0258 : ''
	H13B0_OVI_TCON_BACKDUMMY                  	tcon_backdummy                  ;	// 0x025c : ''
	H13B0_OVI_TCON_VERTLINE_U                 	tcon_vertline_u                 ;	// 0x0260 : ''
	H13B0_OVI_TCON_VERTLINE_L                 	tcon_vertline_l                 ;	// 0x0264 : ''
	H13B0_OVI_TCON_LTD_MODE                   	tcon_ltd_mode                   ;	// 0x0268 : ''
	H13B0_OVI_TCON_SWAP_MODE                  	tcon_swap_mode                  ;	// 0x026c : ''
	H13B0_OVI_TCON_HOR_MODE                   	tcon_hor_mode                   ;	// 0x0270 : ''
	H13B0_OVI_TCON_DFHD                       	tcon_dfhd                       ;	// 0x0274 : ''
	H13B0_OVI_TCON_MTEST_EN                   	tcon_mtest_en                   ;	// 0x0278 : ''
	H13B0_OVI_TCON_MTEST_P0R                  	tcon_mtest_p0r                  ;	// 0x027c : ''
	H13B0_OVI_TCON_MTEST_P0G                  	tcon_mtest_p0g                  ;	// 0x0280 : ''
	H13B0_OVI_TCON_MTEST_P0B                  	tcon_mtest_p0b                  ;	// 0x0284 : ''
	H13B0_OVI_TCON_MTEST_P1R                  	tcon_mtest_p1r                  ;	// 0x0288 : ''
	H13B0_OVI_TCON_MTEST_P1G                  	tcon_mtest_p1g                  ;	// 0x028c : ''
	H13B0_OVI_TCON_MTEST_P1B                  	tcon_mtest_p1b                  ;	// 0x0290 : ''
	H13B0_OVI_TCON_MTEST_P2R                  	tcon_mtest_p2r                  ;	// 0x0294 : ''
	H13B0_OVI_TCON_MTEST_P2G                  	tcon_mtest_p2g                  ;	// 0x0298 : ''
	H13B0_OVI_TCON_MTEST_P2B                  	tcon_mtest_p2b                  ;	// 0x029c : ''
	H13B0_OVI_TCON_MTEST_P3R                  	tcon_mtest_p3r                  ;	// 0x02a0 : ''
	H13B0_OVI_TCON_MTEST_P3G                  	tcon_mtest_p3g                  ;	// 0x02a4 : ''
	H13B0_OVI_TCON_MTEST_P3B                  	tcon_mtest_p3b                  ;	// 0x02a8 : ''
	H13B0_OVI_TCON_EPI_MODE                   	tcon_epi_mode                   ;	// 0x02ac : ''
	H13B0_OVI_TCON_EPI_SEL0                   	tcon_epi_sel0                   ;	// 0x02b0 : ''
	H13B0_OVI_TCON_EPI_SEL1                   	tcon_epi_sel1                   ;	// 0x02b4 : ''
	H13B0_OVI_TCON_EPI_SEL2                   	tcon_epi_sel2                   ;	// 0x02b8 : ''
	H13B0_OVI_TCON_EPI_SEL3                   	tcon_epi_sel3                   ;	// 0x02bc : ''
	H13B0_OVI_TCON_EPI_SEL4                   	tcon_epi_sel4                   ;	// 0x02c0 : ''
	H13B0_OVI_TCON_EPI_SEL5                   	tcon_epi_sel5                   ;	// 0x02c4 : ''
	H13B0_OVI_TCON_EPI_SEL6                   	tcon_epi_sel6                   ;	// 0x02c8 : ''
	H13B0_OVI_TCON_EPI_SEL7                   	tcon_epi_sel7                   ;	// 0x02cc : ''
	H13B0_OVI_TCON_SOE_START0                 	tcon_soe_start0                 ;	// 0x02d0 : ''
	H13B0_OVI_TCON_SOE_WIDTH0_U               	tcon_soe_width0_u               ;	// 0x02d4 : ''
	H13B0_OVI_TCON_SOE_WIDTH0_L               	tcon_soe_width0_l               ;	// 0x02d8 : ''
	H13B0_OVI_TCON_SOE_START1                 	tcon_soe_start1                 ;	// 0x02dc : ''
	H13B0_OVI_TCON_SOE_WIDTH1_U               	tcon_soe_width1_u               ;	// 0x02e0 : ''
	H13B0_OVI_TCON_SOE_WIDTH1_L               	tcon_soe_width1_l               ;	// 0x02e4 : ''
	H13B0_OVI_TCON_SOE_START2                 	tcon_soe_start2                 ;	// 0x02e8 : ''
	H13B0_OVI_TCON_SOE_WIDTH2_U               	tcon_soe_width2_u               ;	// 0x02ec : ''
	H13B0_OVI_TCON_SOE_WIDTH2_L               	tcon_soe_width2_l               ;	// 0x02f0 : ''
	H13B0_OVI_TCON_SOE_START3                 	tcon_soe_start3                 ;	// 0x02f4 : ''
	H13B0_OVI_TCON_SOE_WIDTH3_U               	tcon_soe_width3_u               ;	// 0x02f8 : ''
	H13B0_OVI_TCON_SOE_WIDTH3_L               	tcon_soe_width3_l               ;	// 0x02fc : ''
	H13B0_OVI_TCON_SOE_START4                 	tcon_soe_start4                 ;	// 0x0300 : ''
	H13B0_OVI_TCON_SOE_WIDTH4_U               	tcon_soe_width4_u               ;	// 0x0304 : ''
	H13B0_OVI_TCON_SOE_WIDTH4_L               	tcon_soe_width4_l               ;	// 0x0308 : ''
	H13B0_OVI_TCON_SOE_START5                 	tcon_soe_start5                 ;	// 0x030c : ''
	H13B0_OVI_TCON_SOE_WIDTH5_U               	tcon_soe_width5_u               ;	// 0x0310 : ''
	H13B0_OVI_TCON_SOE_WIDTH5_L               	tcon_soe_width5_l               ;	// 0x0314 : ''
	H13B0_OVI_TCON_SOE_START6                 	tcon_soe_start6                 ;	// 0x0318 : ''
	H13B0_OVI_TCON_SOE_WIDTH6_U               	tcon_soe_width6_u               ;	// 0x031c : ''
	H13B0_OVI_TCON_SOE_WIDTH6_L               	tcon_soe_width6_l               ;	// 0x0320 : ''
	H13B0_OVI_TCON_SOE_START7                 	tcon_soe_start7                 ;	// 0x0324 : ''
	H13B0_OVI_TCON_SOE_WIDTH7_U               	tcon_soe_width7_u               ;	// 0x0328 : ''
	H13B0_OVI_TCON_SOE_WIDTH7_L               	tcon_soe_width7_l               ;	// 0x032c : ''
	H13B0_OVI_TCON_SOE_START8                 	tcon_soe_start8                 ;	// 0x0330 : ''
	H13B0_OVI_TCON_SOE_WIDTH8_U               	tcon_soe_width8_u               ;	// 0x0334 : ''
	H13B0_OVI_TCON_SOE_WIDTH8_L               	tcon_soe_width8_l               ;	// 0x0338 : ''
	H13B0_OVI_TCON_SOE_START9                 	tcon_soe_start9                 ;	// 0x033c : ''
	H13B0_OVI_TCON_SOE_WIDTH9_U               	tcon_soe_width9_u               ;	// 0x0340 : ''
	H13B0_OVI_TCON_SOE_WIDTH9_L               	tcon_soe_width9_l               ;	// 0x0344 : ''
	H13B0_OVI_TCON_SOE_START10                	tcon_soe_start10                ;	// 0x0348 : ''
	H13B0_OVI_TCON_SOE_WIDTH10_U              	tcon_soe_width10_u              ;	// 0x034c : ''
	H13B0_OVI_TCON_SOE_WIDTH10_L              	tcon_soe_width10_l              ;	// 0x0350 : ''
	H13B0_OVI_TCON_SOE_START11                	tcon_soe_start11                ;	// 0x0354 : ''
	H13B0_OVI_TCON_SOE_WIDTH11_U              	tcon_soe_width11_u              ;	// 0x0358 : ''
	H13B0_OVI_TCON_SOE_WIDTH11_L              	tcon_soe_width11_l              ;	// 0x035c : ''
	H13B0_OVI_TCON_SOE_START12                	tcon_soe_start12                ;	// 0x0360 : ''
	H13B0_OVI_TCON_SOE_WIDTH12_U              	tcon_soe_width12_u              ;	// 0x0364 : ''
	H13B0_OVI_TCON_SOE_WIDTH12_L              	tcon_soe_width12_l              ;	// 0x0368 : ''
	H13B0_OVI_TCON_SOE_START13                	tcon_soe_start13                ;	// 0x036c : ''
	H13B0_OVI_TCON_SOE_WIDTH13_U              	tcon_soe_width13_u              ;	// 0x0370 : ''
	H13B0_OVI_TCON_SOE_WIDTH13_L              	tcon_soe_width13_l              ;	// 0x0374 : ''
	H13B0_OVI_TCON_SOE_START14                	tcon_soe_start14                ;	// 0x0378 : ''
	H13B0_OVI_TCON_SOE_WIDTH14_U              	tcon_soe_width14_u              ;	// 0x037c : ''
	H13B0_OVI_TCON_SOE_WIDTH14_L              	tcon_soe_width14_l              ;	// 0x0380 : ''
	H13B0_OVI_TCON_SOE_START15                	tcon_soe_start15                ;	// 0x0384 : ''
	H13B0_OVI_TCON_SOE_WIDTH15_U              	tcon_soe_width15_u              ;	// 0x0388 : ''
	H13B0_OVI_TCON_SOE_WIDTH15_L              	tcon_soe_width15_l              ;	// 0x038c : ''
	H13B0_OVI_TCON_GMAEN_0123                 	tcon_gmaen_0123                 ;	// 0x0390 : ''
	H13B0_OVI_TCON_GMAEN_4567                 	tcon_gmaen_4567                 ;	// 0x0394 : ''
	H13B0_OVI_TCON_GMAEN_89AB                 	tcon_gmaen_89ab                 ;	// 0x0398 : ''
	H13B0_OVI_TCON_GMAEN_CDEF                 	tcon_gmaen_cdef                 ;	// 0x039c : ''
	H13B0_OVI_TCON_EPI_CTR2                   	tcon_epi_ctr2                   ;	// 0x03a0 : ''
	H13B0_OVI_TCON_GSPLINE_U                  	tcon_gspline_u                  ;	// 0x03a4 : ''
	H13B0_OVI_TCON_GSPLINE_L                  	tcon_gspline_l                  ;	// 0x03a8 : ''
	H13B0_OVI_TCON_DPM_CNT                    	tcon_dpm_cnt                    ;	// 0x03ac : ''
	H13B0_OVI_TCON_VST_CONTROL                	tcon_vst_control                ;	// 0x03b0 : ''
	H13B0_OVI_TCON_VST_DPM                    	tcon_vst_dpm                    ;	// 0x03b4 : ''
	H13B0_OVI_TCON_VST_M1_LINE_U              	tcon_vst_m1_line_u              ;	// 0x03b8 : ''
	H13B0_OVI_TCON_VST_M1_LINE1_L             	tcon_vst_m1_line1_l             ;	// 0x03bc : ''
	H13B0_OVI_TCON_VST_M1_LINE2_L             	tcon_vst_m1_line2_l             ;	// 0x03c0 : ''
	H13B0_OVI_TCON_VST_M1_PIX_U               	tcon_vst_m1_pix_u               ;	// 0x03c4 : ''
	H13B0_OVI_TCON_VST_M1_PIX1_L              	tcon_vst_m1_pix1_l              ;	// 0x03c8 : ''
	H13B0_OVI_TCON_VST_M1_PIX2_L              	tcon_vst_m1_pix2_l              ;	// 0x03cc : ''
	H13B0_OVI_TCON_VST_M12_D                  	tcon_vst_m12_d                  ;	// 0x03d0 : ''
	H13B0_OVI_TCON_VST_M2_LINE_U              	tcon_vst_m2_line_u              ;	// 0x03d4 : ''
	H13B0_OVI_TCON_VST_M2_LINE1_L             	tcon_vst_m2_line1_l             ;	// 0x03d8 : ''
	H13B0_OVI_TCON_VST_M2_LINE2_L             	tcon_vst_m2_line2_l             ;	// 0x03dc : ''
	H13B0_OVI_TCON_VST_M2_PIX_U               	tcon_vst_m2_pix_u               ;	// 0x03e0 : ''
	H13B0_OVI_TCON_VST_M2_PIX1_L              	tcon_vst_m2_pix1_l              ;	// 0x03e4 : ''
	H13B0_OVI_TCON_VST_M2_PIX2_L              	tcon_vst_m2_pix2_l              ;	// 0x03e8 : ''
	H13B0_OVI_TCON_VST_M3_LINE_U              	tcon_vst_m3_line_u              ;	// 0x03ec : ''
	H13B0_OVI_TCON_VST_M3_LINE1_L             	tcon_vst_m3_line1_l             ;	// 0x03f0 : ''
	H13B0_OVI_TCON_VST_M3_LINE2_L             	tcon_vst_m3_line2_l             ;	// 0x03f4 : ''
	H13B0_OVI_TCON_VST_M3_PIX_U               	tcon_vst_m3_pix_u               ;	// 0x03f8 : ''
	H13B0_OVI_TCON_VST_M3_PIX1_L              	tcon_vst_m3_pix1_l              ;	// 0x03fc : ''
	H13B0_OVI_TCON_VST_M3_PIX2_L              	tcon_vst_m3_pix2_l              ;	// 0x0400 : ''
	H13B0_OVI_TCON_VST_M3_D                   	tcon_vst_m3_d                   ;	// 0x0404 : ''
	H13B0_OVI_TCON_VST_P_LINE                 	tcon_vst_p_line                 ;	// 0x0408 : ''
	H13B0_OVI_TCON_VST_P1_PIX_U               	tcon_vst_p1_pix_u               ;	// 0x040c : ''
	H13B0_OVI_TCON_VST_P1_PIX1_L              	tcon_vst_p1_pix1_l              ;	// 0x0410 : ''
	H13B0_OVI_TCON_VST_P1_PIX2_L              	tcon_vst_p1_pix2_l              ;	// 0x0414 : ''
	H13B0_OVI_TCON_VST_P12_D                  	tcon_vst_p12_d                  ;	// 0x0418 : ''
	H13B0_OVI_TCON_VST_P2_PIX_U               	tcon_vst_p2_pix_u               ;	// 0x041c : ''
	H13B0_OVI_TCON_VST_P2_PIX1_L              	tcon_vst_p2_pix1_l              ;	// 0x0420 : ''
	H13B0_OVI_TCON_VST_P2_PIX2_L              	tcon_vst_p2_pix2_l              ;	// 0x0424 : ''
	H13B0_OVI_TCON_EO_FCON_CONTROL            	tcon_eo_fcon_control            ;	// 0x0428 : ''
	H13B0_OVI_TCON_EO_FCON_DPM                	tcon_eo_fcon_dpm                ;	// 0x042c : ''
	H13B0_OVI_TCON_EO_FCON_F1_FRA_U           	tcon_eo_fcon_f1_fra_u           ;	// 0x0430 : ''
	H13B0_OVI_TCON_EO_FCON_F1_FRA_L           	tcon_eo_fcon_f1_fra_l           ;	// 0x0434 : ''
	H13B0_OVI_TCON_EO_FCON_F1_PIX1_U          	tcon_eo_fcon_f1_pix1_u          ;	// 0x0438 : ''
	H13B0_OVI_TCON_EO_FCON_F1_PIX1_M          	tcon_eo_fcon_f1_pix1_m          ;	// 0x043c : ''
	H13B0_OVI_TCON_EO_FCON_F1_PIX1_L          	tcon_eo_fcon_f1_pix1_l          ;	// 0x0440 : ''
	H13B0_OVI_TCON_EO_FCON_F1_PIX2_U          	tcon_eo_fcon_f1_pix2_u          ;	// 0x0444 : ''
	H13B0_OVI_TCON_EO_FCON_F1_PIX2_M          	tcon_eo_fcon_f1_pix2_m          ;	// 0x0448 : ''
	H13B0_OVI_TCON_EO_FCON_F1_PIX2_L          	tcon_eo_fcon_f1_pix2_l          ;	// 0x044c : ''
	H13B0_OVI_TCON_EO_FCON_F1_D               	tcon_eo_fcon_f1_d               ;	// 0x0450 : ''
	H13B0_OVI_TCON_EO_FCON_F2_FRA_U           	tcon_eo_fcon_f2_fra_u           ;	// 0x0454 : ''
	H13B0_OVI_TCON_EO_FCON_F2_FRA_L           	tcon_eo_fcon_f2_fra_l           ;	// 0x0458 : ''
	H13B0_OVI_TCON_EO_FCON_F2_PIX1_U          	tcon_eo_fcon_f2_pix1_u          ;	// 0x045c : ''
	H13B0_OVI_TCON_EO_FCON_F2_PIX1_M          	tcon_eo_fcon_f2_pix1_m          ;	// 0x0460 : ''
	H13B0_OVI_TCON_EO_FCON_F2_PIX1_L          	tcon_eo_fcon_f2_pix1_l          ;	// 0x0464 : ''
	H13B0_OVI_TCON_EO_FCON_F2_PIX2_U          	tcon_eo_fcon_f2_pix2_u          ;	// 0x0468 : ''
	H13B0_OVI_TCON_EO_FCON_F2_PIX2_M          	tcon_eo_fcon_f2_pix2_m          ;	// 0x046c : ''
	H13B0_OVI_TCON_EO_FCON_F2_PIX2_L          	tcon_eo_fcon_f2_pix2_l          ;	// 0x0470 : ''
	H13B0_OVI_TCON_EO_FCON_F2_D               	tcon_eo_fcon_f2_d               ;	// 0x0474 : ''
	H13B0_OVI_TCON_GCLK_CONTROL               	tcon_gclk_control               ;	// 0x0478 : ''
	H13B0_OVI_TCON_GCLK_DPM                   	tcon_gclk_dpm                   ;	// 0x047c : ''
	H13B0_OVI_TCON_GCLK_M1_LINE_U             	tcon_gclk_m1_line_u             ;	// 0x0480 : ''
	H13B0_OVI_TCON_GCLK_M1_LINE1_L            	tcon_gclk_m1_line1_l            ;	// 0x0484 : ''
	H13B0_OVI_TCON_GCLK_M1_LINE2_L            	tcon_gclk_m1_line2_l            ;	// 0x0488 : ''
	H13B0_OVI_TCON_GCLK_M1_PIX_U              	tcon_gclk_m1_pix_u              ;	// 0x048c : ''
	H13B0_OVI_TCON_GCLK_M1_PIX1_L             	tcon_gclk_m1_pix1_l             ;	// 0x0490 : ''
	H13B0_OVI_TCON_GCLK_M1_PIX2_L             	tcon_gclk_m1_pix2_l             ;	// 0x0494 : ''
	H13B0_OVI_TCON_GCLK_M12_D                 	tcon_gclk_m12_d                 ;	// 0x0498 : ''
	H13B0_OVI_TCON_GCLK_M2_LINE_U             	tcon_gclk_m2_line_u             ;	// 0x049c : ''
	H13B0_OVI_TCON_GCLK_M2_LINE1_L            	tcon_gclk_m2_line1_l            ;	// 0x04a0 : ''
	H13B0_OVI_TCON_GCLK_M2_LINE2_L            	tcon_gclk_m2_line2_l            ;	// 0x04a4 : ''
	H13B0_OVI_TCON_GCLK_M2_PIX_U              	tcon_gclk_m2_pix_u              ;	// 0x04a8 : ''
	H13B0_OVI_TCON_GCLK_M2_PIX1_L             	tcon_gclk_m2_pix1_l             ;	// 0x04ac : ''
	H13B0_OVI_TCON_GCLK_M2_PIX2_L             	tcon_gclk_m2_pix2_l             ;	// 0x04b0 : ''
	H13B0_OVI_TCON_GCLK_M3_LINE_U             	tcon_gclk_m3_line_u             ;	// 0x04b4 : ''
	H13B0_OVI_TCON_GCLK_M3_LINE1_L            	tcon_gclk_m3_line1_l            ;	// 0x04b8 : ''
	H13B0_OVI_TCON_GCLK_M3_LINE2_L            	tcon_gclk_m3_line2_l            ;	// 0x04bc : ''
	H13B0_OVI_TCON_GCLK_M3_PIX_U              	tcon_gclk_m3_pix_u              ;	// 0x04c0 : ''
	H13B0_OVI_TCON_GCLK_M3_PIX1_L             	tcon_gclk_m3_pix1_l             ;	// 0x04c4 : ''
	H13B0_OVI_TCON_GCLK_M3_PIX2_L             	tcon_gclk_m3_pix2_l             ;	// 0x04c8 : ''
	H13B0_OVI_TCON_GCLK_M3_D                  	tcon_gclk_m3_d                  ;	// 0x04cc : ''
	H13B0_OVI_TCON_GCLK_P_LINE                	tcon_gclk_p_line                ;	// 0x04d0 : ''
	H13B0_OVI_TCON_GCLK_P1_PIX_U              	tcon_gclk_p1_pix_u              ;	// 0x04d4 : ''
	H13B0_OVI_TCON_GCLK_P1_PIX1_L             	tcon_gclk_p1_pix1_l             ;	// 0x04d8 : ''
	H13B0_OVI_TCON_GCLK_P1_PIX2_L             	tcon_gclk_p1_pix2_l             ;	// 0x04dc : ''
	H13B0_OVI_TCON_GCLK_P12_D                 	tcon_gclk_p12_d                 ;	// 0x04e0 : ''
	H13B0_OVI_TCON_GCLK_P2_PIX_U              	tcon_gclk_p2_pix_u              ;	// 0x04e4 : ''
	H13B0_OVI_TCON_GCLK_P2_PIX1_L             	tcon_gclk_p2_pix1_l             ;	// 0x04e8 : ''
	H13B0_OVI_TCON_GCLK_P2_PIX2_L             	tcon_gclk_p2_pix2_l             ;	// 0x04ec : ''
	H13B0_OVI_TCON_MCLK_CONTROL               	tcon_mclk_control               ;	// 0x04f0 : ''
	H13B0_OVI_TCON_MCLK_DPM                   	tcon_mclk_dpm                   ;	// 0x04f4 : ''
	H13B0_OVI_TCON_MCLK_M1_LINE_U             	tcon_mclk_m1_line_u             ;	// 0x04f8 : ''
	H13B0_OVI_TCON_MCLK_M1_LINE1_L            	tcon_mclk_m1_line1_l            ;	// 0x04fc : ''
	H13B0_OVI_TCON_MCLK_M1_LINE2_L            	tcon_mclk_m1_line2_l            ;	// 0x0500 : ''
	H13B0_OVI_TCON_MCLK_M1_PIX_U              	tcon_mclk_m1_pix_u              ;	// 0x0504 : ''
	H13B0_OVI_TCON_MCLK_M1_PIX1_L             	tcon_mclk_m1_pix1_l             ;	// 0x0508 : ''
	H13B0_OVI_TCON_MCLK_M1_PIX2_L             	tcon_mclk_m1_pix2_l             ;	// 0x050c : ''
	H13B0_OVI_TCON_MCLK_M12_D                 	tcon_mclk_m12_d                 ;	// 0x0510 : ''
	H13B0_OVI_TCON_MCLK_M2_LINE_U             	tcon_mclk_m2_line_u             ;	// 0x0514 : ''
	H13B0_OVI_TCON_MCLK_M2_LINE1_L            	tcon_mclk_m2_line1_l            ;	// 0x0518 : ''
	H13B0_OVI_TCON_MCLK_M2_LINE2_L            	tcon_mclk_m2_line2_l            ;	// 0x051c : ''
	H13B0_OVI_TCON_MCLK_M2_PIX_U              	tcon_mclk_m2_pix_u              ;	// 0x0520 : ''
	H13B0_OVI_TCON_MCLK_M2_PIX1_L             	tcon_mclk_m2_pix1_l             ;	// 0x0524 : ''
	H13B0_OVI_TCON_MCLK_M2_PIX2_L             	tcon_mclk_m2_pix2_l             ;	// 0x0528 : ''
	H13B0_OVI_TCON_MCLK_M3_LINE_U             	tcon_mclk_m3_line_u             ;	// 0x052c : ''
	H13B0_OVI_TCON_MCLK_M3_LINE1_L            	tcon_mclk_m3_line1_l            ;	// 0x0530 : ''
	H13B0_OVI_TCON_MCLK_M3_LINE2_L            	tcon_mclk_m3_line2_l            ;	// 0x0534 : ''
	H13B0_OVI_TCON_MCLK_M3_PIX_U              	tcon_mclk_m3_pix_u              ;	// 0x0538 : ''
	H13B0_OVI_TCON_MCLK_M3_PIX1_L             	tcon_mclk_m3_pix1_l             ;	// 0x053c : ''
	H13B0_OVI_TCON_MCLK_M3_PIX2_L             	tcon_mclk_m3_pix2_l             ;	// 0x0540 : ''
	H13B0_OVI_TCON_MCLK_M3_D                  	tcon_mclk_m3_d                  ;	// 0x0544 : ''
	H13B0_OVI_TCON_MCLK_P_LINE                	tcon_mclk_p_line                ;	// 0x0548 : ''
	H13B0_OVI_TCON_MCLK_P1_PIX_U              	tcon_mclk_p1_pix_u              ;	// 0x054c : ''
	H13B0_OVI_TCON_MCLK_P1_PIX1_L             	tcon_mclk_p1_pix1_l             ;	// 0x0550 : ''
	H13B0_OVI_TCON_MCLK_P1_PIX2_L             	tcon_mclk_p1_pix2_l             ;	// 0x0554 : ''
	H13B0_OVI_TCON_MCLK_P12_D                 	tcon_mclk_p12_d                 ;	// 0x0558 : ''
	H13B0_OVI_TCON_MCLK_P2_PIX_U              	tcon_mclk_p2_pix_u              ;	// 0x055c : ''
	H13B0_OVI_TCON_MCLK_P2_PIX1_L             	tcon_mclk_p2_pix1_l             ;	// 0x0560 : ''
	H13B0_OVI_TCON_MCLK_P2_PIX2_L             	tcon_mclk_p2_pix2_l             ;	// 0x0564 : ''
	H13B0_OVI_TCON_EO_ABN_PIX1_U              	tcon_eo_abn_pix1_u              ;	// 0x0568 : ''
	H13B0_OVI_TCON_EO_ABN_PIX1_M              	tcon_eo_abn_pix1_m              ;	// 0x056c : ''
	H13B0_OVI_TCON_EO_ABN_PIX1_L              	tcon_eo_abn_pix1_l              ;	// 0x0570 : ''
	H13B0_OVI_TCON_EO_ABN_PIX2_U              	tcon_eo_abn_pix2_u              ;	// 0x0574 : ''
	H13B0_OVI_TCON_EO_ABN_PIX2_M              	tcon_eo_abn_pix2_m              ;	// 0x0578 : ''
	H13B0_OVI_TCON_EO_ABN_PIX2_L              	tcon_eo_abn_pix2_l              ;	// 0x057c : ''
	H13B0_OVI_TCON_EO_ABN_D                   	tcon_eo_abn_d                   ;	// 0x0580 : ''
	H13B0_OVI_TCON_VST_ABN_PIX1_U             	tcon_vst_abn_pix1_u             ;	// 0x0584 : ''
	H13B0_OVI_TCON_VST_ABN_PIX1_M             	tcon_vst_abn_pix1_m             ;	// 0x0588 : ''
	H13B0_OVI_TCON_VST_ABN_PIX1_L             	tcon_vst_abn_pix1_l             ;	// 0x058c : ''
	H13B0_OVI_TCON_VST_ABN_PIX2_U             	tcon_vst_abn_pix2_u             ;	// 0x0590 : ''
	H13B0_OVI_TCON_VST_ABN_PIX2_M             	tcon_vst_abn_pix2_m             ;	// 0x0594 : ''
	H13B0_OVI_TCON_VST_ABN_PIX2_L             	tcon_vst_abn_pix2_l             ;	// 0x0598 : ''
	H13B0_OVI_TCON_VST_ABN_D                  	tcon_vst_abn_d                  ;	// 0x059c : ''
	H13B0_OVI_TCON_POL_NORMAL                 	tcon_pol_normal                 ;	// 0x05a0 : ''
	H13B0_OVI_TCON_POL_XTR1                   	tcon_pol_xtr1                   ;	// 0x05a4 : ''
	H13B0_OVI_TCON_POL_XTR2                   	tcon_pol_xtr2                   ;	// 0x05a8 : ''
	H13B0_OVI_TCON_POL_DPC1                   	tcon_pol_dpc1                   ;	// 0x05ac : ''
	H13B0_OVI_TCON_POL_DPC2                   	tcon_pol_dpc2                   ;	// 0x05b0 : ''
	H13B0_OVI_TCON_POL_DPC3                   	tcon_pol_dpc3                   ;	// 0x05b4 : ''
	H13B0_OVI_TCON_POL_DPC4                   	tcon_pol_dpc4                   ;	// 0x05b8 : ''
	H13B0_OVI_TCON_POL_DPC5                   	tcon_pol_dpc5                   ;	// 0x05bc : ''
	H13B0_OVI_TCON_POL_DPC6                   	tcon_pol_dpc6                   ;	// 0x05c0 : ''
	H13B0_OVI_TCON_POL_DPC7                   	tcon_pol_dpc7                   ;	// 0x05c4 : ''
	H13B0_OVI_TCON_POL_DPC8                   	tcon_pol_dpc8                   ;	// 0x05c8 : ''
	H13B0_OVI_TCON_POL_DPC9                   	tcon_pol_dpc9                   ;	// 0x05cc : ''
	H13B0_OVI_TCON_POL_DPC10                  	tcon_pol_dpc10                  ;	// 0x05d0 : ''
	H13B0_OVI_TCON_HCONV                      	tcon_hconv                      ;	// 0x05d4 : ''
	UINT32                          	                 _rsvd_02[  89];	// 0x05d8 ~ 0x0738
	UINT32                          	tcon_status                     ;	// 0x073c : ''
	UINT32                          	                 _rsvd_03[  48];	// 0x0740 ~ 0x07fc
	UINT32                          	tcon_dga_low_rs                 ;	// 0x0800 : ''
	UINT32                          	                 _rsvd_04[ 766];	// 0x0804 ~ 0x13f8
	UINT32                          	tcon_dga_low_re                 ;	// 0x13fc : ''
	UINT32                          	tcon_dga_low_gs                 ;	// 0x1400 : ''
	UINT32                          	                 _rsvd_05[ 766];	// 0x1404 ~ 0x1ff8
	UINT32                          	tcon_dga_low_ge                 ;	// 0x1ffc : ''
	UINT32                          	tcon_dga_low_bs                 ;	// 0x2000 : ''
	UINT32                          	                 _rsvd_06[ 766];	// 0x2004 ~ 0x2bf8
	UINT32                          	tcon_dga_low_be                 ;	// 0x2bfc : ''
	UINT32                          	tcon_dga_med_rs                 ;	// 0x2c00 : ''
	UINT32                          	                 _rsvd_07[ 766];	// 0x2c04 ~ 0x37f8
	UINT32                          	tcon_dga_med_re                 ;	// 0x37fc : ''
	UINT32                          	tcon_dga_med_gs                 ;	// 0x3800 : ''
	UINT32                          	                 _rsvd_08[ 766];	// 0x3804 ~ 0x43f8
	UINT32                          	tcon_dga_med_ge                 ;	// 0x43fc : ''
	UINT32                          	tcon_dga_med_bs                 ;	// 0x4400 : ''
	UINT32                          	                 _rsvd_09[ 766];	// 0x4404 ~ 0x4ff8
	UINT32                          	tcon_dga_med_be                 ;	// 0x4ffc : ''
	UINT32                          	tcon_dga_high_rs                ;	// 0x5000 : ''
	UINT32                          	                 _rsvd_10[ 766];	// 0x5004 ~ 0x5bf8
	UINT32                          	tcon_dga_high_re                ;	// 0x5bfc : ''
	UINT32                          	tcon_dga_high_gs                ;	// 0x5c00 : ''
	UINT32                          	                 _rsvd_11[ 766];	// 0x5c04 ~ 0x67f8
	UINT32                          	tcon_dga_high_ge                ;	// 0x67fc : ''
	UINT32                          	tcon_dga_high_bs                ;	// 0x6800 : ''
	UINT32                          	                 _rsvd_12[ 766];	// 0x6804 ~ 0x73f8
	UINT32                          	tcon_dga_high_be                ;	// 0x73fc : ''
	UINT32                          	tcon_dither_start               ;	// 0x7400 : ''
	UINT32                          	                 _rsvd_13[ 254];	// 0x7404 ~ 0x77f8
	UINT32                          	tcon_dither_end                 ;	// 0x77fc : ''
	UINT32                          	tcon_odc_start_2d               ;	// 0x7800 : ''
	UINT32                          	                 _rsvd_14[ 287];	// 0x7804 ~ 0x7c7c
	UINT32                          	tcon_odc_end_2d                 ;	// 0x7c80 : ''
	UINT32                          	                 _rsvd_15[  15];	// 0x7c84 ~ 0x7cbc
	UINT32                          	tcon_odc_start_3d               ;	// 0x7cc0 : ''
	UINT32                          	                 _rsvd_16[ 287];	// 0x7cc4 ~ 0x813c
	UINT32                          	tcon_odc_end_3d                 ;	// 0x8140 : ''
	UINT32                          	                 _rsvd_17[  15];	// 0x8144 ~ 0x817c
	UINT32                          	tcon_lodc_start_3d              ;	// 0x8180 : ''
	UINT32                          	                 _rsvd_18[ 287];	// 0x8184 ~ 0x85fc
	UINT32                          	tcon_lodc_end_3d                ;	// 0x8600 : ''
	UINT32                          	                 _rsvd_19[  15];	// 0x8604 ~ 0x863c
	UINT32                          	tcon_end                        ;	// 0x8640 : ''
} OVI_TCON_REG_H13B0_T;

/*
	OVI_OIF
*/

/*-----------------------------------------------------------------------------
	0x0000 oif_vch_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vch_hb_width                    :12,	//  0:11
	vch_out_h_width                 :11,	// 12:22
	rsvd_00                         : 1,	//    23
	vch_out_port                    : 2,	// 24:25
	vch_in_port                     : 2,	// 26:27
	vch_h_reverse                   : 1,	//    28
	vch_line_delay                  : 1,	//    29
	rsvd_01                         : 2;	// 30:31
} H13B0_OVI_OIF_VCH_CONFIG;

/*-----------------------------------------------------------------------------
	0x0004 oif_och_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	och_hb_width                    :12,	//  0:11
	och_out_h_width                 :11,	// 12:22
	rsvd_00                         : 1,	//    23
	och_out_port                    : 2,	// 24:25
	och_h_reverse                   : 1,	//    26
	och_line_delay                  : 1,	//    27
	rsvd_01                         : 4;	// 28:31
} H13B0_OVI_OIF_OCH_CONFIG;

/*-----------------------------------------------------------------------------
	0x0008 oif_vx1_config0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_sel                         :25,	//  0:24
	vx1_out_mode                    : 1,	//    25
	vx1_en                          : 1,	//    26
	rsvd                            : 5;	// 27:31
} H13B0_OVI_OIF_VX1_CONFIG0;

/*-----------------------------------------------------------------------------
	0x000c oif_vx1_config1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_force_even_data             :31,	//  0:30
	rsvd                            : 1;	//    31
} H13B0_OVI_OIF_VX1_CONFIG1;

/*-----------------------------------------------------------------------------
	0x0010 oif_vx1_config2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_force_odd_data              :31,	//  0:30
	rsvd                            : 1;	//    31
} H13B0_OVI_OIF_VX1_CONFIG2;

/*-----------------------------------------------------------------------------
	0x0014 oif_vx1_config3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_resv3                       : 2,	//  0: 1
	vx1_resv2                       : 2,	//  2: 3
	vx1_resv1                       : 2,	//  4: 5
	vx1_resv0                       : 2,	//  6: 7
	vx1_resv_sel                    : 3,	//  8:10
	rsvd                            :21;	// 11:31
} H13B0_OVI_OIF_VX1_CONFIG3;

/*-----------------------------------------------------------------------------
	0x0018 oif_lvds_config0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_sel                        :13,	//  0:12
	lvds_swap                       : 1,	//    13
	lvds_8bit_mode                  : 1,	//    14
	lvds_lsb_first                  : 1,	//    15
	rsvd                            :16;	// 16:31
} H13B0_OVI_OIF_LVDS_CONFIG0;

/*-----------------------------------------------------------------------------
	0x001c oif_lvds_config1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_even_data            :31,	//  0:30
	rsvd                            : 1;	//    31
} H13B0_OVI_OIF_LVDS_CONFIG1;

/*-----------------------------------------------------------------------------
	0x0020 oif_lvds_config2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_odd_data             :31,	//  0:30
	rsvd                            : 1;	//    31
} H13B0_OVI_OIF_LVDS_CONFIG2;

/*-----------------------------------------------------------------------------
	0x0024 oif_lvds_config3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_data                 :16,	//  0:15
	lvds_force_en                   :16;	// 16:31
} H13B0_OVI_OIF_LVDS_CONFIG3;

typedef struct {
	H13B0_OVI_OIF_VCH_CONFIG                 	oif_vch_config                  ;	// 0x0000 : ''
	H13B0_OVI_OIF_OCH_CONFIG                  	oif_och_config                  ;	// 0x0004 : ''
	H13B0_OVI_OIF_VX1_CONFIG0                 	oif_vx1_config0                 ;	// 0x0008 : ''
	H13B0_OVI_OIF_VX1_CONFIG1                 	oif_vx1_config1                 ;	// 0x000c : ''
	H13B0_OVI_OIF_VX1_CONFIG2                 	oif_vx1_config2                 ;	// 0x0010 : ''
	H13B0_OVI_OIF_VX1_CONFIG3                 	oif_vx1_config3                 ;	// 0x0014 : ''
	H13B0_OVI_OIF_LVDS_CONFIG0             	oif_lvds_config0                ;	// 0x0018 : ''
	H13B0_OVI_OIF_LVDS_CONFIG1              	oif_lvds_config1                ;	// 0x001c : ''
	H13B0_OVI_OIF_LVDS_CONFIG2              	oif_lvds_config2                ;	// 0x0020 : ''
	H13B0_OVI_OIF_LVDS_CONFIG3              	oif_lvds_config3                ;	// 0x0024 : ''
} OVI_OIF_REG_H13B0_T;

#endif //#ifndef _REG_OVI_H13B0_h
