/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

#ifndef _REG_VDO_M14B0_H_
#define _REG_VDO_M14B0_H_
/*-----------------------------------------------------------------------------
		0xc0021000L ch0_vbp_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vbp_num                        : 16;  // 15: 0     
} M14B0_CH0_VBP_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021004L ch0_vfp_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vfp_num                        : 16;  // 15: 0     
} M14B0_CH0_VFP_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021008L ch0_vsync_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vsync_num                      : 16;  // 15: 0     
} M14B0_CH0_VSYNC_NUM_T;

/*-----------------------------------------------------------------------------
		0xc002100cL ch0_vsync_cmd ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsync                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 vactv                              : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 vsync_mode                         : 1 ;  //     8     
	UINT32 vactv_mode                         : 1 ;  //     9     
	UINT32 vactv_auto                         : 1 ;  //    10     
	UINT32                                    : 5 ;  // 15:11     reserved
	UINT32 vsync_sel                          : 2 ;  // 17:16     
} M14B0_CH0_VSYNC_CMD_T;

/*-----------------------------------------------------------------------------
		0xc0021010L ch0_wait_reqb ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reqb_wait_cycle                    : 8 ;  //  7: 0     
	UINT32                                    : 20;  // 27: 8     reserved
	UINT32 reqb_wait_en                       : 1 ;  //    28     
} M14B0_CH0_WAIT_REQB_T;

/*-----------------------------------------------------------------------------
		0xc0021014L ch0_flush_conf ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 flush_idle_cycle                   : 8 ;  //  7: 0     
	UINT32                                    : 20;  // 27: 8     reserved
	UINT32 flush_on                           : 1 ;  //    28     
	UINT32 flush_idle_en                      : 1 ;  //    29     
} M14B0_CH0_FLUSH_CONF_T;

/*-----------------------------------------------------------------------------
		0xc0021018L ch0_vdo_conf ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 8 ;  //  7: 0     reserved
	UINT32 channel_ready_mode                 : 1 ;  //     8     
	UINT32                                    : 3 ;  // 11: 9     reserved
	UINT32 gdi_dma_endian                     : 2 ;  // 13:12     
	UINT32                                    : 1 ;  //    14     reserved
	UINT32 reqb_dimension                     : 1 ;  //    15     
	UINT32 line_wait_cycle                    : 16;  // 31:16     
} M14B0_CH0_VDO_CONF_T;

/*-----------------------------------------------------------------------------
		0xc002101cL ch0_vdo_cmd ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pic_run                            : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 pic_init                           : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 flush_run                          : 1 ;  //     8     
	UINT32                                    : 19;  // 27: 9     reserved
	UINT32 vdo_en                             : 1 ;  //    28     
} M14B0_CH0_VDO_CMD_T;

/*-----------------------------------------------------------------------------
		0xc0021020L ch0_pic_size ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pic_height                         : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 pic_width                          : 12;  // 27:16     
} M14B0_CH0_PIC_SIZE_T;

/*-----------------------------------------------------------------------------
		0xc0021024L ch0_buf_idx ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 buf_idx                            : 6 ;  //  5: 0     
} M14B0_CH0_BUF_IDX_T;

/*-----------------------------------------------------------------------------
		0xc0021028L ch0_chroma_format ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cformat                            : 3 ;  //  2: 0     
} M14B0_CH0_CHROMA_FORMAT_T;

/*-----------------------------------------------------------------------------
		0xc002102cL ch0_scan_mode ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 field                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 prog_scan                          : 1 ;  //     4     
} M14B0_CH0_SCAN_MODE_T;

/*-----------------------------------------------------------------------------
		0xc0021030L ch0_vsync_vact_term ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsync_vactv_term                   : 31;  // 30: 0     
	UINT32 mont_en                            : 1 ;  //    31     
} M14B0_CH0_VSYNC_VACT_TERM_T;

/*-----------------------------------------------------------------------------
		0xc0021034L ch0_luma_stall_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 luma_stall_cnt                     : 24;  // 23: 0     
} M14B0_CH0_LUMA_STALL_CNT_T;

/*-----------------------------------------------------------------------------
		0xc0021038L ch0_chma_stall_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 chma_stall_cnt                     : 24;  // 23: 0     
} M14B0_CH0_CHMA_STALL_CNT_T;

/*-----------------------------------------------------------------------------
		0xc0021040L ch0_mif_line_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reqb_ypos                          : 12;  // 11: 0     
} M14B0_CH0_MIF_LINE_CNT_T;

/*-----------------------------------------------------------------------------
		0xc0021044L ch0_mif_status ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 s0_curr_stat                       : 5 ;  //  4: 0     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 s1_curr_stat                       : 3 ;  // 10: 8     
} M14B0_CH0_MIF_STATUS_T;

/*-----------------------------------------------------------------------------
		0xc0021048L ch0_rdc_line_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 line_cnt                           : 12;  // 11: 0     
} M14B0_CH0_RDC_LINE_CNT_T;

/*-----------------------------------------------------------------------------
		0xc002104cL ch0_rdc_status ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 s0_curr_stat                       : 4 ;  //  3: 0     
	UINT32 s1_curr_stat                       : 4 ;  //  7: 4     
	UINT32 s2_curr_stat                       : 4 ;  // 11: 8     
	UINT32 time_out_err                       : 1 ;  //    12     
	UINT32                                    : 3 ;  // 15:13     reserved
	UINT32 pic_done                           : 1 ;  //    16     
	UINT32 pic_read_done                      : 1 ;  //    17     
} M14B0_CH0_RDC_STATUS_T;

/*-----------------------------------------------------------------------------
		0xc0021050L ch1_vbp_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vbp_num                        : 16;  // 15: 0     
} M14B0_CH1_VBP_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021054L ch1_vfp_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vfp_num                        : 16;  // 15: 0     
} M14B0_CH1_VFP_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021058L ch1_vsync_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vsync_num                      : 16;  // 15: 0     
} M14B0_CH1_VSYNC_NUM_T;

/*-----------------------------------------------------------------------------
		0xc002105cL ch1_vsync_cmd ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsync                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 vactv                              : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 vsync_mode                         : 1 ;  //     8     
	UINT32 vactv_mode                         : 1 ;  //     9     
	UINT32 vactv_auto                         : 1 ;  //    10     
	UINT32                                    : 5 ;  // 15:11     reserved
	UINT32 vsync_sel                          : 2 ;  // 17:16     
} M14B0_CH1_VSYNC_CMD_T;

/*-----------------------------------------------------------------------------
		0xc0021060L ch1_wait_reqb ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reqb_wait_cycle                    : 8 ;  //  7: 0     
	UINT32                                    : 20;  // 27: 8     reserved
	UINT32 reqb_wait_en                       : 1 ;  //    28     
} M14B0_CH1_WAIT_REQB_T;

/*-----------------------------------------------------------------------------
		0xc0021064L ch1_flush_conf ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 flush_idle_cycle                   : 8 ;  //  7: 0     
	UINT32                                    : 20;  // 27: 8     reserved
	UINT32 flush_on                           : 1 ;  //    28     
	UINT32 flush_idle_en                      : 1 ;  //    29     
} M14B0_CH1_FLUSH_CONF_T;

/*-----------------------------------------------------------------------------
		0xc0021068L ch1_vdo_conf ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 8 ;  //  7: 0     reserved
	UINT32 channel_ready_mode                 : 1 ;  //     8     
	UINT32                                    : 3 ;  // 11: 9     reserved
	UINT32 gdi_dma_endian                     : 2 ;  // 13:12     
	UINT32                                    : 1 ;  //    14     reserved
	UINT32 reqb_dimension                     : 1 ;  //    15     
	UINT32 line_wait_cycle                    : 16;  // 31:16     
} M14B0_CH1_VDO_CONF_T;

/*-----------------------------------------------------------------------------
		0xc002106cL ch1_vdo_cmd ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pic_run                            : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 pic_init                           : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 flush_run                          : 1 ;  //     8     
	UINT32                                    : 19;  // 27: 9     reserved
	UINT32 vdo_en                             : 1 ;  //    28     
} M14B0_CH1_VDO_CMD_T;

/*-----------------------------------------------------------------------------
		0xc0021070L ch1_pic_size ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pic_height                         : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 pic_width                          : 12;  // 27:16     
} M14B0_CH1_PIC_SIZE_T;

/*-----------------------------------------------------------------------------
		0xc0021074L ch1_buf_idx ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 buf_idx                            : 6 ;  //  5: 0     
} M14B0_CH1_BUF_IDX_T;

/*-----------------------------------------------------------------------------
		0xc0021078L ch1_chroma_format ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cformat                            : 3 ;  //  2: 0     
} M14B0_CH1_CHROMA_FORMAT_T;

/*-----------------------------------------------------------------------------
		0xc002107cL ch1_scan_mode ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 field                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 prog_scan                          : 1 ;  //     4     
} M14B0_CH1_SCAN_MODE_T;

/*-----------------------------------------------------------------------------
		0xc0021080L ch1_vsync_vact_term ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsync_vactv_term                   : 31;  // 30: 0     
	UINT32 mont_en                            : 1 ;  //    31     
} M14B0_CH1_VSYNC_VACT_TERM_T;

/*-----------------------------------------------------------------------------
		0xc0021084L ch1_luma_stall_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 luma_stall_cnt                     : 24;  // 23: 0     
} M14B0_CH1_LUMA_STALL_CNT_T;

/*-----------------------------------------------------------------------------
		0xc0021088L ch1_chma_stall_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 chma_stall_cnt                     : 24;  // 23: 0     
} M14B0_CH1_CHMA_STALL_CNT_T;

/*-----------------------------------------------------------------------------
		0xc0021090L ch1_mif_line_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reqb_ypos                          : 12;  // 11: 0     
} M14B0_CH1_MIF_LINE_CNT_T;

/*-----------------------------------------------------------------------------
		0xc0021094L ch1_mif_status ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 s0_curr_stat                       : 5 ;  //  4: 0     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 s1_curr_stat                       : 3 ;  // 10: 8     
} M14B0_CH1_MIF_STATUS_T;

/*-----------------------------------------------------------------------------
		0xc0021098L ch1_rdc_line_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 line_cnt                           : 12;  // 11: 0     
} M14B0_CH1_RDC_LINE_CNT_T;

/*-----------------------------------------------------------------------------
		0xc002109cL ch1_rdc_status ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 s0_curr_stat                       : 4 ;  //  3: 0     
	UINT32 s1_curr_stat                       : 4 ;  //  7: 4     
	UINT32 s2_curr_stat                       : 4 ;  // 11: 8     
	UINT32 time_out_err                       : 1 ;  //    12     
	UINT32                                    : 3 ;  // 15:13     reserved
	UINT32 pic_done                           : 1 ;  //    16     
	UINT32 pic_read_done                      : 1 ;  //    17     
} M14B0_CH1_RDC_STATUS_T;

/*-----------------------------------------------------------------------------
		0xc00210a0L ch2_vbp_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vbp_num                        : 16;  // 15: 0     
} M14B0_CH2_VBP_NUM_T;

/*-----------------------------------------------------------------------------
		0xc00210a4L ch2_vfp_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vfp_num                        : 16;  // 15: 0     
} M14B0_CH2_VFP_NUM_T;

/*-----------------------------------------------------------------------------
		0xc00210a8L ch2_vsync_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vsync_num                      : 16;  // 15: 0     
} M14B0_CH2_VSYNC_NUM_T;

/*-----------------------------------------------------------------------------
		0xc00210acL ch2_vsync_cmd ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsync                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 vactv                              : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 vsync_mode                         : 1 ;  //     8     
	UINT32 vactv_mode                         : 1 ;  //     9     
	UINT32 vactv_auto                         : 1 ;  //    10     
	UINT32                                    : 5 ;  // 15:11     reserved
	UINT32 vsync_sel                          : 2 ;  // 17:16     
} M14B0_CH2_VSYNC_CMD_T;

/*-----------------------------------------------------------------------------
		0xc00210b0L ch2_vsync_vact_term ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsync_vactv_term                   : 31;  // 30: 0     
	UINT32 mont_en                            : 1 ;  //    31     
} M14B0_CH2_VSYNC_VACT_TERM_T;

/*-----------------------------------------------------------------------------
		0xc00210bcL ch2_scan_mode ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 4 ;  //  3: 0     reserved
	UINT32 prog_scan                          : 1 ;  //     4     
} M14B0_CH2_SCAN_MODE_T;

/*-----------------------------------------------------------------------------
		0xc00210c0L ch3_vbp_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vbp_num                        : 16;  // 15: 0     
} M14B0_CH3_VBP_NUM_T;

/*-----------------------------------------------------------------------------
		0xc00210c4L ch3_vfp_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vfp_num                        : 16;  // 15: 0     
} M14B0_CH3_VFP_NUM_T;

/*-----------------------------------------------------------------------------
		0xc00210c8L ch3_vsync_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ch0_vsync_num                      : 16;  // 15: 0     
} M14B0_CH3_VSYNC_NUM_T;

/*-----------------------------------------------------------------------------
		0xc00210ccL ch3_vsync_cmd ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsync                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 vactv                              : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 vsync_mode                         : 1 ;  //     8     
	UINT32 vactv_mode                         : 1 ;  //     9     
	UINT32 vactv_auto                         : 1 ;  //    10     
	UINT32                                    : 5 ;  // 15:11     reserved
	UINT32 vsync_sel                          : 2 ;  // 17:16     
} M14B0_CH3_VSYNC_CMD_T;

/*-----------------------------------------------------------------------------
		0xc00210d0L ch3_vsync_vact_term ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsync_vactv_term                   : 31;  // 30: 0     
	UINT32 mont_en                            : 1 ;  //    31     
} M14B0_CH3_VSYNC_VACT_TERM_T;

/*-----------------------------------------------------------------------------
		0xc00210dcL ch3_scan_mode ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 4 ;  //  3: 0     reserved
	UINT32 prog_scan                          : 1 ;  //     4     
} M14B0_CH3_SCAN_MODE_T;

/*-----------------------------------------------------------------------------
		0xc00210fcL version ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 yyyymmdd                           : 32;  // 31: 0     
} M14B0_VDO_VERSION_T;

/*-----------------------------------------------------------------------------
		0xc0025200L frame_idx ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 frame_idx                          : 8 ;  //  7: 0     
	UINT32 scaler_freeze                      : 1 ;  //     8     
	UINT32 tiled_map                          : 1 ;  //     9     
	UINT32 dpb_map_type                       : 2 ;  // 11:10     
} M14B0_FRAME_IDX_T;

/*-----------------------------------------------------------------------------
		0xc0025204L display_info ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 display_mode                       : 2 ;  //  1: 0     
	UINT32 field_repeat                       : 1 ;  //     2     
	UINT32 vdec_paused                        : 1 ;  //     3     
	UINT32 color_format                       : 2 ;  //  5: 4     
	UINT32                                    : 10;  // 15: 6     reserved
	UINT32 deinter_mode                       : 3 ;  // 18:16     
	UINT32                                    : 12;  // 30:19     reserved
	UINT32 prog_seq                           : 1 ;  //    31     
} M14B0_DISPLAY_INFO_T;

/*-----------------------------------------------------------------------------
		0xc0025208L frame_rate ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 frame_rate_residual                : 16;  // 15: 0     
	UINT32 frame_rate_div                     : 16;  // 31:16     
} M14B0_FRAME_RATE_T;

/*-----------------------------------------------------------------------------
		0xc002520cL aspect_ratio ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 aspect_ratio                       : 4 ;  //  3: 0     
} M14B0_ASPECT_RATIO_T;

/*-----------------------------------------------------------------------------
		0xc0025210L picture_size ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 height                             : 16;  // 15: 0     
	UINT32 width                              : 16;  // 31:16     
} M14B0_PICTURE_SIZE_T;

/*-----------------------------------------------------------------------------
		0xc0025214L h_offset ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 right_offset                       : 16;  // 15: 0     
	UINT32 left_offset                        : 16;  // 31:16     
} M14B0_H_OFFSET_T;

/*-----------------------------------------------------------------------------
		0xc0025218L v_offset ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bottom_offset                      : 16;  // 15: 0     
	UINT32 top_offset                         : 16;  // 31:16     
} M14B0_V_OFFSET_T;

/*-----------------------------------------------------------------------------
		0xc002521cL update ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 frame_update                       : 1 ;  //     0     
	UINT32 field_update                       : 1 ;  //     1     
	UINT32 sequence_update                    : 1 ;  //     2     
} M14B0_UPDATE_T;

/*-----------------------------------------------------------------------------
		0xc0025220L y_frame_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 start_addr                         : 12;  // 11: 0     
	UINT32 base_addr                          : 20;  // 31:12     
} M14B0_Y_FRAME_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025224L c_frame_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 start_addr                         : 12;  // 11: 0     
	UINT32 base_addr                          : 20;  // 31:12     
} M14B0_C_FRAME_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025228L y_frame_offset ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 frame_offset                       : 32;  // 31: 0     
} M14B0_Y_FRAME_OFFSET_T;

/*-----------------------------------------------------------------------------
		0xc002522cL c_frame_offset ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 frame_offset                       : 32;  // 31: 0     
} M14B0_C_FRAME_OFFSET_T;

/*-----------------------------------------------------------------------------
		0xc0025230L stride ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 stride                             : 16;  // 15: 0     
} M14B0_STRIDE_T;

/*-----------------------------------------------------------------------------
		0xc0025234L pixel_aspect_ratio ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 par_height                         : 8 ;  //  7: 0     
	UINT32                                    : 8 ;  // 15: 8     reserved
	UINT32 par_width                          : 5 ;  // 20:16     
} M14B0_PIXEL_ASPECT_RATIO_T;

/*-----------------------------------------------------------------------------
		0xc0025238L frame_pack_arrange ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 sei_fpa                            : 5 ;  //  4: 0     
	UINT32                                    : 11;  // 15: 5     reserved
	UINT32 lr_order                           : 5 ;  // 20:16     
} M14B0_FRAME_PACK_ARRANGE_T;

/*-----------------------------------------------------------------------------
		0xc002523cL pts_info ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pts_info                           : 32;  // 31: 0     
} M14B0_PTS_INFO_T;

/*-----------------------------------------------------------------------------
		0xc0025400L vdo_gdi_pri_rd_prio_l ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pri_rd_prio_l                      : 32;  // 31: 0     
} M14B0_GDI_PRI_RD_PRIO_L_T;

/*-----------------------------------------------------------------------------
		0xc0025404L vdo_gdi_pri_rd_prio_h ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pri_rd_prio_h                      : 32;  // 31: 0     
} M14B0_GDI_PRI_RD_PRIO_H_T;

/*-----------------------------------------------------------------------------
		0xc0025410L vdo_gdi_pri_rd_lock_cnt ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pri_rd_lock_cnt                    : 32;  // 31: 0     
} M14B0_GDI_PRI_RD_LOCK_CNT_T;

/*-----------------------------------------------------------------------------
		0xc0025438L vdo_gdi_pic_init_host ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pic_init                           : 1 ;  //     0     
} M14B0_GDI_PIC_INIT_HOST_T;

/*-----------------------------------------------------------------------------
		0xc0025440L vdo_gdi_config_report_0 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 product_name                       : 32;  // 31: 0     
} M14B0_GDI_CONFIG_REPORT_0_T;

/*-----------------------------------------------------------------------------
		0xc0025444L vdo_gdi_config_report_1 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 product_version                    : 32;  // 31: 0     
} M14B0_GDI_CONFIG_REPORT_1_T;

/*-----------------------------------------------------------------------------
		0xc0025448L vdo_gdi_config_report_2 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 7 ;  //  6: 0     reserved
	UINT32 axi1k                              : 1 ;  //     7     
	UINT32 axi2axi_async                      : 1 ;  //     8     
	UINT32 axi64bit                           : 1 ;  //     9     
	UINT32 dcu_if                             : 1 ;  //    10     
	UINT32 axi_2nd                            : 1 ;  //    11     
	UINT32 ref_clk                            : 1 ;  //    12     
	UINT32                                    : 1 ;  //    13     reserved
	UINT32 map_linear                         : 1 ;  //    14     
	UINT32 map_tiled                          : 1 ;  //    15     
} M14B0_GDI_CONFIG_REPORT_2_T;

/*-----------------------------------------------------------------------------
		0xc002544cL vdo_gdi_config_report_3 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 mp2_mp                             : 1 ;  //     0     
	UINT32 mp4_sp                             : 1 ;  //     1     
	UINT32 mp4_asp                            : 1 ;  //     2     
	UINT32 mp4_263                            : 1 ;  //     3     
	UINT32 mp4_dvx                            : 1 ;  //     4     
	UINT32 mp4_xvid                           : 1 ;  //     5     
	UINT32 mp4_spk                            : 1 ;  //     6     
	UINT32 rv8                                : 1 ;  //     7     
	UINT32 rv9                                : 1 ;  //     8     
	UINT32 rv10                               : 1 ;  //     9     
	UINT32 jpg_bp                             : 1 ;  //    10     
	UINT32 std_h264                           : 1 ;  //    11     
	UINT32 std_vc1                            : 1 ;  //    12     
	UINT32 std_mp2                            : 1 ;  //    13     
	UINT32 std_mp4                            : 1 ;  //    14     
	UINT32 std_rvx                            : 1 ;  //    15     
	UINT32 std_avs                            : 1 ;  //    16     
	UINT32 std_jpg                            : 1 ;  //    17     
	UINT32 _264_bp                            : 1 ;  //    18     
	UINT32 _264_mp                            : 1 ;  //    19     
	UINT32 _264_hp                            : 1 ;  //    20     
	UINT32 vc1_sp                             : 1 ;  //    21     
	UINT32 vc1_mp                             : 1 ;  //    22     
	UINT32 vc1_ap                             : 1 ;  //    23     
	UINT32 vc1_wmv                            : 1 ;  //    24     
} M14B0_GDI_CONFIG_REPORT_3_T;

/*-----------------------------------------------------------------------------
		0xc0025450L vdo_gdi_config_report_4 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 release_ver                        : 32;  // 31: 0     
} M14B0_GDI_CONFIG_REPORT_4_T;

/*-----------------------------------------------------------------------------
		0xc0025454L vdo_gdi_config_report_5 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 config_data                        : 32;  // 31: 0     
} M14B0_GDI_CONFIG_REPORT_5_T;

/*-----------------------------------------------------------------------------
		0xc0025458L vdo_gdi_config_report_6 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 config_rev                         : 32;  // 31: 0     
} M14B0_GDI_CONFIG_REPORT_6_T;

/*-----------------------------------------------------------------------------
		0xc002545cL vdo_gdi_config_report_7 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 config_type                        : 32;  // 31: 0     
} M14B0_GDI_CONFIG_REPORT_7_T;

/*-----------------------------------------------------------------------------
		0xc0025460L vdo_gdi_pinfo_req ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pinfo_req                          : 1 ;  //     0     
} M14B0_GDI_PINFO_REQ_T;

/*-----------------------------------------------------------------------------
		0xc0025464L vdo_gdi_pinfo_ack ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pinfo_ack                          : 1 ;  //     0     
} M14B0_GDI_PINFO_ACK_T;

/*-----------------------------------------------------------------------------
		0xc0025468L vdo_gdi_pinfo_addr ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 2 ;  //  1: 0     reserved
	UINT32 pinfo_addr                         : 8 ;  //  9: 2     
} M14B0_GDI_PINFO_ADDR_T;

/*-----------------------------------------------------------------------------
		0xc002546cL vdo_gdi_pinfo_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pinfo_rdata                        : 32;  // 31: 0     
} M14B0_GDI_PINFO_DATA_T;

/*-----------------------------------------------------------------------------
		0xc0025800L vdo_gdi_info_control ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 stride                             : 16;  // 15: 0     
	UINT32 cbcrinterleaved                    : 1 ;  //    16     
	UINT32 colormode                          : 3 ;  // 19:17     
	UINT32 framemap                           : 4 ;  // 23:20     
} M14B0_GDI_INFO_CONTROL_T;

/*-----------------------------------------------------------------------------
		0xc0025804L vdo_gdi_info_pic_size ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 picversizeluma                     : 16;  // 15: 0     
	UINT32 pichorsizeluma                     : 16;  // 31:16     
} M14B0_GDI_INFO_PIC_SIZE_T;

/*-----------------------------------------------------------------------------
		0xc0025808L vdo_gdi_info_y_t_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lumatopbaseaddr                    : 32;  // 31: 0     
} M14B0_GDI_INFO_Y_T_BASE_T;

/*-----------------------------------------------------------------------------
		0xc002580cL vdo_gdi_info_cb_t_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cbtopbaseaddr                      : 32;  // 31: 0     
} M14B0_GDI_INFO_CB_T_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025810L vdo_gdi_info_cr_t_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 crtopbaseaddr                      : 32;  // 31: 0     
} M14B0_GDI_INFO_CR_T_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025814L vdo_gdi_info_y_b_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lumabottombaseaddr                 : 32;  // 31: 0     
} M14B0_GDI_INFO_Y_B_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025818L vdo_gdi_info_cb_b_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cbbottombaseaddr                   : 32;  // 31: 0     
} M14B0_GDI_INFO_CB_B_BASE_T;

/*-----------------------------------------------------------------------------
		0xc002581cL vdo_gdi_info_cr_b_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 crbottombaseaddr                   : 32;  // 31: 0     
} M14B0_GDI_INFO_CR_B_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025c00L vdo_gdi_ch0_xy2_axi_lum_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bitsel                             : 4 ;  //  3: 0     
	UINT32 xysel                              : 1 ;  //     4     
	UINT32 topbot                             : 1 ;  //     5     
	UINT32 zero                               : 1 ;  //     6     
	UINT32 invert                             : 1 ;  //     7     
} M14B0_GDI_CH0_XY2_AXI_LUM_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025c80L vdo_gdi_ch0_xy2_axi_chr_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bitsel                             : 4 ;  //  3: 0     
	UINT32 xysel                              : 1 ;  //     4     
	UINT32 topbot                             : 1 ;  //     5     
	UINT32 zero                               : 1 ;  //     6     
	UINT32 invert                             : 1 ;  //     7     
} M14B0_GDI_CH0_XY2_AXI_CHR_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025d00L vdo_gdi_ch0_xy2_axi_config ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 burstlenfieldcr                    : 4 ;  //  3: 0     
	UINT32 burstlenframecr                    : 4 ;  //  7: 4     
	UINT32 burstlenfieldlu                    : 4 ;  // 11: 8     
	UINT32 burstlenframelu                    : 4 ;  // 15:12     
	UINT32 addrincdir                         : 1 ;  //    16     
	UINT32 tiledmap                           : 1 ;  //    17     
	UINT32 topbotsplit                        : 1 ;  //    18     
	UINT32 fieldmemmap                        : 1 ;  //    19     
	UINT32 maxburstlinear                     : 4 ;  // 23:20     
} M14B0_GDI_CH0_XY2_AXI_CONFIG_T;

/*-----------------------------------------------------------------------------
		0xc0025e00L vdo_gdi_ch1_xy2_axi_lum_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bitsel                             : 4 ;  //  3: 0     
	UINT32 xysel                              : 1 ;  //     4     
	UINT32 topbot                             : 1 ;  //     5     
	UINT32 zero                               : 1 ;  //     6     
	UINT32 invert                             : 1 ;  //     7     
} M14B0_GDI_CH1_XY2_AXI_LUM_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025e80L vdo_gdi_ch1_xy2_axi_chr_base ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bitsel                             : 4 ;  //  3: 0     
	UINT32 xysel                              : 1 ;  //     4     
	UINT32 topbot                             : 1 ;  //     5     
	UINT32 zero                               : 1 ;  //     6     
	UINT32 invert                             : 1 ;  //     7     
} M14B0_GDI_CH1_XY2_AXI_CHR_BASE_T;

/*-----------------------------------------------------------------------------
		0xc0025f00L vdo_gdi_ch1_xy2_axi_config ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 burstlenfieldcr                    : 4 ;  //  3: 0     
	UINT32 burstlenframecr                    : 4 ;  //  7: 4     
	UINT32 burstlenfieldlu                    : 4 ;  // 11: 8     
	UINT32 burstlenframelu                    : 4 ;  // 15:12     
	UINT32 addrincdir                         : 1 ;  //    16     
	UINT32 tiledmap                           : 1 ;  //    17     
	UINT32 topbotsplit                        : 1 ;  //    18     
	UINT32 fieldmemmap                        : 1 ;  //    19     
	UINT32 maxburstlinear                     : 4 ;  // 23:20     
} M14B0_GDI_CH1_XY2_AXI_CONFIG_T;

/*-----------------------------------------------------------------------------
		0xc0021b00L version ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 yyyymmdd                           : 32;  // 31: 0     
} M14B0_SYNC_VERSION_T;

/*-----------------------------------------------------------------------------
		0xc0021b04L sync_conf ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_int_vsync0_field_sel           : 1 ;  //     0     
	UINT32 reg_int_vsync1_field_sel           : 1 ;  //     1     
	UINT32 reg_int_vsync2_field_sel           : 1 ;  //     2     
	UINT32 reg_int_vsync3_field_sel           : 1 ;  //     3     
	UINT32 reg_vsync0_update_mode             : 1 ;  //     4     
	UINT32 reg_vsync1_update_mode             : 1 ;  //     5     
	UINT32 reg_vsync2_update_mode             : 1 ;  //     6     
	UINT32 reg_vsync3_update_mode             : 1 ;  //     7     
	UINT32 reg_vsync0_first_pul_en            : 1 ;  //     8     
	UINT32 reg_vsync1_first_pul_en            : 1 ;  //     9     
	UINT32 reg_vsync2_first_pul_en            : 1 ;  //    10     
	UINT32 reg_vsync3_first_pul_en            : 1 ;  //    11     
	UINT32 reg_ext_vsync0_field_sel           : 1 ;  //    12     
	UINT32 reg_ext_vsync1_field_sel           : 1 ;  //    13     
	UINT32 reg_ext_vsync2_field_sel           : 1 ;  //    14     
	UINT32 reg_ext_vsync3_field_sel           : 1 ;  //    15     
	UINT32                                    : 8 ;  // 23:16     reserved
	UINT32 reg_vsync0_srst                    : 1 ;  //    24     
	UINT32 reg_vsync1_srst                    : 1 ;  //    25     
	UINT32 reg_vsync2_srst                    : 1 ;  //    26     
	UINT32 reg_vsync3_srst                    : 1 ;  //    27     
	UINT32 reg_vsync0_en                      : 1 ;  //    28     
	UINT32 reg_vsync1_en                      : 1 ;  //    29     
	UINT32 reg_vsync2_en                      : 1 ;  //    30     
	UINT32 reg_vsync3_en                      : 1 ;  //    31     
} M14B0_SYNC_CONF_T;

/*-----------------------------------------------------------------------------
		0xc0021b08L sync_update ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync0_update                  : 1 ;  //     0     
	UINT32 reg_vsync1_update                  : 1 ;  //     1     
	UINT32 reg_vsync2_update                  : 1 ;  //     2     
	UINT32 reg_vsync3_update                  : 1 ;  //     3     
} M14B0_SYNC_UPDATE_T;

/*-----------------------------------------------------------------------------
		0xc0021b10L vsync0_field0_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync0_field0_num              : 32;  // 31: 0     
} M14B0_VSYNC0_FIELD0_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b14L vsync0_field1_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync0_field1_num              : 32;  // 31: 0     
} M14B0_VSYNC0_FIELD1_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b18L vsync1_field0_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync1_field0_num              : 32;  // 31: 0     
} M14B0_VSYNC1_FIELD0_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b1cL vsync1_field1_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync1_field1_num              : 32;  // 31: 0     
} M14B0_VSYNC1_FIELD1_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b20L vsync2_field0_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync2_field0_num              : 32;  // 31: 0     
} M14B0_VSYNC2_FIELD0_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b24L vsync2_field1_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync2_field1_num              : 32;  // 31: 0     
} M14B0_VSYNC2_FIELD1_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b28L vsync3_field0_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync3_field0_num              : 32;  // 31: 0     
} M14B0_VSYNC3_FIELD0_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b2cL vsync3_field1_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vsync3_field1_num              : 32;  // 31: 0     
} M14B0_VSYNC3_FIELD1_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b30L vsync0_int_field ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_int_vsync0_field               : 1 ;  //     0     
} M14B0_VSYNC0_INT_FIELD_T;

/*-----------------------------------------------------------------------------
		0xc0021b34L vsync1_int_field ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_int_vsync1_filed               : 1 ;  //     0     
} M14B0_VSYNC1_INT_FIELD_T;

/*-----------------------------------------------------------------------------
		0xc0021b38L vsync2_int_field ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_int_vsync2_filed               : 1 ;  //     0     
} M14B0_VSYNC2_INT_FIELD_T;

/*-----------------------------------------------------------------------------
		0xc0021b3cL vsync3_int_field ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_int_vsync3_filed               : 1 ;  //     0     
} M14B0_VSYNC3_INT_FIELD_T;

/*-----------------------------------------------------------------------------
		0xc0021b40L vsync0_ext_field ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_ext_vsync0_field               : 1 ;  //     0     
} M14B0_VSYNC0_EXT_FIELD_T;

/*-----------------------------------------------------------------------------
		0xc0021b44L vsync1_ext_field ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_ext_vsync1_field               : 1 ;  //     0     
} M14B0_VSYNC1_EXT_FIELD_T;

/*-----------------------------------------------------------------------------
		0xc0021b48L vsync2_ext_field ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_ext_vsync2_field               : 1 ;  //     0     
} M14B0_VSYNC2_EXT_FIELD_T;

/*-----------------------------------------------------------------------------
		0xc0021b4cL vsync3_ext_field ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_ext_vsync3_field               : 1 ;  //     0     
} M14B0_VSYNC3_EXT_FIELD_T;

/*-----------------------------------------------------------------------------
		0xc0021b50L timer_conf ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 4 ;  //  3: 0     reserved
	UINT32 reg_timer0_update_mode             : 1 ;  //     4     
	UINT32 reg_timer1_update_mode             : 1 ;  //     5     
	UINT32 reg_timer2_update_mode             : 1 ;  //     6     
	UINT32 reg_timer3_update_mode             : 1 ;  //     7     
	UINT32                                    : 16;  // 23: 8     reserved
	UINT32 reg_timer0_srst                    : 1 ;  //    24     
	UINT32 reg_timer1_srst                    : 1 ;  //    25     
	UINT32 reg_timer2_srst                    : 1 ;  //    26     
	UINT32 reg_timer3_srst                    : 1 ;  //    27     
	UINT32 reg_timer0_en                      : 1 ;  //    28     
	UINT32 reg_timer1_en                      : 1 ;  //    29     
	UINT32 reg_timer2_en                      : 1 ;  //    30     
	UINT32 reg_timer3_en                      : 1 ;  //    31     
} M14B0_TIMER_CONF_T;

/*-----------------------------------------------------------------------------
		0xc0021b58L timer_update ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_timer0_update                  : 1 ;  //     0     
	UINT32 reg_timer1_update                  : 1 ;  //     1     
	UINT32 reg_timer2_update                  : 1 ;  //     2     
	UINT32 reg_timer3_update                  : 1 ;  //     3     
} M14B0_TIMER_UPDATE_T;

/*-----------------------------------------------------------------------------
		0xc0021b60L timer0_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_timer0_num                     : 32;  // 31: 0     
} M14B0_TIMER0_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b64L timer1_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_timer1_num                     : 32;  // 31: 0     
} M14B0_TIMER1_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b68L timer2_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_timer2_num                     : 32;  // 31: 0     
} M14B0_TIMER2_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b6cL timer3_num ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_timer3_num                     : 32;  // 31: 0     
} M14B0_TIMER3_NUM_T;

/*-----------------------------------------------------------------------------
		0xc0021b70L ext_mode ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_ext_mode0                      : 2 ;  //  1: 0     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 reg_ext_mode1                      : 2 ;  //  5: 4     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 reg_ext_mode2                      : 2 ;  //  9: 8     
	UINT32                                    : 2 ;  // 11:10     reserved
	UINT32 reg_ext_mode3                      : 2 ;  // 13:12     
} M14B0_EXT_MODE_T;

/*-----------------------------------------------------------------------------
		0xc0021c00L version ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 yyyymmdd                           : 32;  // 31: 0     
} M14B0_RC_VERSION_T;

/*-----------------------------------------------------------------------------
		0xc0021c04L sw_reset ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 12;  // 11: 0     reserved
	UINT32 reg_st_vdo_rst_ctrl                : 4 ;  // 15:12     
	UINT32                                    : 3 ;  // 18:16     reserved
	UINT32 reg_vdo_intr_ack_en                : 1 ;  //    19     
	UINT32                                    : 3 ;  // 22:20     reserved
	UINT32 reg_vdo_srst_without_fdone         : 1 ;  //    23     
	UINT32 sw_reset_vdo                       : 1 ;  //    24     
} M14B0_SW_RESET_T;

/*-----------------------------------------------------------------------------
		0xc0021c08L apb_conf ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_apb_s0_prt                     : 4 ;  //  3: 0     
	UINT32 reg_apb_s1_prt                     : 4 ;  //  7: 4     
	UINT32 reg_apb_s2_prt                     : 4 ;  // 11: 8     
} M14B0_APB_CONF_T;

/*-----------------------------------------------------------------------------
		0xc0021c14L vsync_src_sel ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 8 ;  //  7: 0     reserved
	UINT32 reg_vsync0_src_sel                 : 2 ;  //  9: 8     
	UINT32 reg_vsync1_src_sel                 : 2 ;  // 11:10     
	UINT32 reg_vsync2_src_sel                 : 2 ;  // 13:12     
	UINT32 reg_vsync3_src_sel                 : 2 ;  // 15:14     
} M14B0_VSYNC_SRC_SEL_T;

/*-----------------------------------------------------------------------------
		0xc0021c1cL timer_src_sel ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_timer0_src_sel                 : 2 ;  //  1: 0     
	UINT32 reg_timer1_src_sel                 : 2 ;  //  3: 2     
	UINT32 reg_timer2_src_sel                 : 2 ;  //  5: 4     
	UINT32 reg_timer3_src_sel                 : 2 ;  //  7: 6     
} M14B0_TIMER_SRC_SEL_T;

/*-----------------------------------------------------------------------------
		0xc0021c40L intr_i_en ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pic0_done                          : 1 ;  //     0     
	UINT32 pic1_done                          : 1 ;  //     1     
	UINT32 gdi_err                            : 1 ;  //     2     
	UINT32 vdo_srst_done                      : 1 ;  //     3     
	UINT32 vsync0                             : 1 ;  //     4     
	UINT32 vsync1                             : 1 ;  //     5     
	UINT32 vsync2                             : 1 ;  //     6     
	UINT32 vsync3                             : 1 ;  //     7     
	UINT32 timer0                             : 1 ;  //     8     
	UINT32 timer1                             : 1 ;  //     9     
	UINT32 timer2                             : 1 ;  //    10     
	UINT32 timer3                             : 1 ;  //    11     
	UINT32 vsync0_rdy                         : 1 ;  //    12     
	UINT32 vsync1_rdy                         : 1 ;  //    13     
} M14B0_INTR_I_EN_T;

/*-----------------------------------------------------------------------------
		0xc0021c44L intr_i_st ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pic0_done                          : 1 ;  //     0     
	UINT32 pic1_done                          : 1 ;  //     1     
	UINT32 gdi_err                            : 1 ;  //     2     
	UINT32 vdo_srst_done                      : 1 ;  //     3     
	UINT32 vsync0                             : 1 ;  //     4     
	UINT32 vsync1                             : 1 ;  //     5     
	UINT32 vsync2                             : 1 ;  //     6     
	UINT32 vsync3                             : 1 ;  //     7     
	UINT32 timer0                             : 1 ;  //     8     
	UINT32 timer1                             : 1 ;  //     9     
	UINT32 timer2                             : 1 ;  //    10     
	UINT32 timer3                             : 1 ;  //    11     
	UINT32 vsync0_rdy                         : 1 ;  //    12     
	UINT32 vsync1_rdy                         : 1 ;  //    13     
} M14B0_INTR_I_ST_T;

/*-----------------------------------------------------------------------------
		0xc0021c48L intr_i_cl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pic0_done                          : 1 ;  //     0     
	UINT32 pic1_done                          : 1 ;  //     1     
	UINT32 gdi_err                            : 1 ;  //     2     
	UINT32 vdo_srst_done                      : 1 ;  //     3     
	UINT32 vsync0                             : 1 ;  //     4     
	UINT32 vsync1                             : 1 ;  //     5     
	UINT32 vsync2                             : 1 ;  //     6     
	UINT32 vsync3                             : 1 ;  //     7     
	UINT32 timer0                             : 1 ;  //     8     
	UINT32 timer1                             : 1 ;  //     9     
	UINT32 timer2                             : 1 ;  //    10     
	UINT32 timer3                             : 1 ;  //    11     
	UINT32 vsync0_rdy                         : 1 ;  //    12     
	UINT32 vsync1_rdy                         : 1 ;  //    13     
} M14B0_INTR_I_CL_T;

/*-----------------------------------------------------------------------------
		0xc0021c7cL vdo_srst_count ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 mach3_srst_count                   : 32;  // 31: 0     
} M14B0_VDO_SRST_COUNT_T;

/*-----------------------------------------------------------------------------
		0xc0021c80L srst_mask ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 12;  // 11: 0     reserved
	UINT32 vdo_srst_mask                      : 3 ;  // 14:12     
} M14B0_SRST_MASK_T;

typedef struct {
	M14B0_CH0_VBP_NUM_T                	ch0_vbp_num;                  //0xc0021000L
	M14B0_CH0_VFP_NUM_T                	ch0_vfp_num;                  //0xc0021004L
