/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

#ifndef _REG_FRC_H14A0_h
#define _REG_FRC_H14A0_h



/*
	FRC_LRX
*/

/*-----------------------------------------------------------------------------
	0x0000 lrx_ch0starta ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0004 lrx_ch0startb ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0008 lrx_ch0patfrgred ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x000c lrx_ch0patfrggreen ''
------------------------------------------------------------------------------*/
/*	no field */


	0x0038 lrx_ch0endx1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x003c lrx_ch0endy1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0040 lrx_ch0startx2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0044 lrx_ch0starty2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0048 lrx_ch0endx2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x004c lrx_ch0endy2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0050 lrx_ch0startx3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0054 lrx_ch0starty3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0058 lrx_ch0endx3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x005c lrx_ch0endy3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0060 lrx_ch0startx4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0064 lrx_ch0starty4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0068 lrx_ch0endx4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x006c lrx_ch0endy4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0070 lrx_ch0patgen ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0patgen_0                       : 1,	//     0
	ch0patgen_1                       : 1,	//     1
	ch0patgen_2                       : 1,	//     2
	ch0patgen_3                       : 4,	//  3: 6
	ch0patgen_4                       : 1,	//     7
	ch0patgen_5                       : 4,	//  8:11
	ch0patgen_6                       : 1,	//    12
	ch0patgen_7                       : 1,	//    13
	ch0patgen_8                       : 2,	// 14:15
	ch0patgen_9                       : 1;	//    16
} H14A0_FRC_CH0PATGEN;

/*-----------------------------------------------------------------------------
	0x0074 lrx_ch1starta ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0078 lrx_ch1startb ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x007c lrx_ch1patfrgred ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0080 lrx_ch1patfrggreen ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0084 lrx_ch1patfrgblue ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0088 lrx_ch1patbkgred ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x008c lrx_ch1patbkggreen ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0090 lrx_ch1patbkgblue ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0094 lrx_ch1startx ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0098 lrx_ch1starty ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x009c lrx_ch1endx ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00a0 lrx_ch1endy ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00a4 lrx_ch1startx1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00a8 lrx_ch1starty1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00ac lrx_ch1endx1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00b0 lrx_ch1endy1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00b4 lrx_ch1startx2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00b8 lrx_ch1starty2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00bc lrx_ch1endx2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00c0 lrx_ch1endy2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00c4 lrx_ch1startx3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00c8 lrx_ch1starty3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00cc lrx_ch1endx3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00d0 lrx_ch1endy3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00d4 lrx_ch1startx4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00d8 lrx_ch1starty4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00dc lrx_ch1endx4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00e0 lrx_ch1endy4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00e4 lrx_ch1patgen ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1patgen_0                       : 1,	//     0
	ch1patgen_1                       : 1,	//     1
	ch1patgen_2                       : 1,	//     2
	ch1patgen_3                       : 4,	//  3: 6
	ch1patgen_4                       : 1,	//     7
	ch1patgen_5                       : 4,	//  8:11
	ch1patgen_6                       : 1,	//    12
	ch1patgen_7                       : 1,	//    13
	ch1patgen_8                       : 2,	// 14:15
	ch1patgen_9                       : 1;	//    16
} H14A0_FRC_CH1PATGEN;

/*-----------------------------------------------------------------------------
	0x00e8 lrx_n_blk_pel_vs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00ec lrx_load_reg ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00f0 lrx_num_hdata ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00f4 lrx_num_vdata ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x00f8 lrx_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config_0                          : 1,	//     0
	config_1                          : 1,	//     1
	config_2                          : 1,	//     2
	config_3                          : 1,	//     3
	config_4                          : 1,	//     4
	config_5                          : 1,	//     5
	config_6                          : 1;	//     6
} H14A0_FRC_CONFIG;

/*-----------------------------------------------------------------------------
	0x00fc lrx_iint0cfg ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0100 lrx_iint1cfg ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0104 lrx_maxblpix ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0108 lrx_timedet1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	timedet1_0                        : 1,	//     0
	timedet1_1                        : 1,	//     1
	timedet1_2                        : 1,	//     2
	timedet1_3                        : 1;	//     3
} H14A0_FRC_TIMEDET1;

/*-----------------------------------------------------------------------------
	0x010c lrx_timedet ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	timedet_0                         : 6,	//  0: 5
	timedet_1                         : 6,	//  6:11
	timedet_2                         : 8;	// 12:19
} H14A0_FRC_TIMEDET;

/*-----------------------------------------------------------------------------
	0x0110 lrx_det_sts_clr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0114 lrx_muxconfig ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	muxconfig_00                       : 1,	//     0
	muxconfig_01                       : 1,	//     1
	muxconfig_02                       : 1,	//     2
	muxconfig_03                       : 1,	//     3
	muxconfig_04                       : 1,	//     4
	muxconfig_05                       : 1,	//     5
	muxconfig_06                       : 1,	//     6
	muxconfig_07                       : 2,	//  7: 8
	muxconfig_08                       : 1,	//     9
	muxconfig_09                       : 1,	//    10
	muxconfig_10                       : 1,	//    11
	muxconfig_11                       : 1;	//    12
} H14A0_FRC_MUXCONFIG;

/*-----------------------------------------------------------------------------
	0x0118 lrx_iintenable ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iintenable_00                      : 1,	//     0
	iintenable_01                      : 1,	//     1
	iintenable_02                      : 1,	//     2
	iintenable_03                      : 1,	//     3
	iintenable_04                      : 1,	//     4
	iintenable_05                      : 1,	//     5
	iintenable_06                      : 1,	//     6
	iintenable_07                      : 1,	//     7
	iintenable_08                      : 1,	//     8
	iintenable_09                      : 1,	//     9
	iintenable_10                      : 1,	//    10
	iintenable_11                      : 1,	//    11
	iintenable_12                      : 1,	//    12
	iintenable_13                      : 1,	//    13
	iintenable_14                      : 1,	//    14
	iintenable_15                      : 1,	//    15
	iintenable_16                      : 1,	//    16
	iintenable_17                      : 1,	//    17
	iintenable_18                      : 1,	//    18
	iintenable_19                      : 1,	//    19
	iintenable_20                      : 1,	//    20
	iintenable_21                      : 1;	//    21
} H14A0_FRC_LRX_IINTENABLE;

/*-----------------------------------------------------------------------------
	0x011c lrx_iintclear ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iintclear_00                       : 1,	//     0
	iintclear_01                       : 1,	//     1
	iintclear_02                       : 1,	//     2
	iintclear_03                       : 1,	//     3
	iintclear_04                       : 1,	//     4
	iintclear_05                       : 1,	//     5
	iintclear_06                       : 1,	//     6
	iintclear_07                       : 1,	//     7
	iintclear_08                       : 1,	//     8
	iintclear_09                       : 1,	//     9
	iintclear_10                       : 1,	//    10
	iintclear_11                       : 1,	//    11
	iintclear_12                       : 1,	//    12
	iintclear_13                       : 1,	//    13
	iintclear_14                       : 1,	//    14
	iintclear_15                       : 1,	//    15
	iintclear_16                       : 1,	//    16
	iintclear_17                       : 1,	//    17
	iintclear_18                       : 1,	//    18
	iintclear_19                       : 1,	//    19
	iintclear_20                       : 1,	//    20
	iintclear_21                       : 1;	//    21
} H14A0_FRC_LRX_IINTCLEAR;

/*-----------------------------------------------------------------------------
	0x0120 lrx_syncpolarity ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	syncpolarity_0                    : 1,	//     0
	syncpolarity_1                    : 1,	//     1
	syncpolarity_2                    : 1;	//     2
} H14A0_FRC_SYNCPOLARITY;

/*-----------------------------------------------------------------------------
	0x0124 lrx_devs_watchdog_cnd ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0128 lrx_norm_fr_num_th ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x012c lrx_line_error_tol ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0130 lrx_count_sys_min ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0134 lrx_count_sys_max ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0138 lrx_no_rxclk_cond ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x013c lrx_curr_line_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0140 lrx_norm_fr_num ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0144 lrx_period_trigger ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0148 lrx_frame_lock_sts ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x014c lrx_n_cycle_blank ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0150 lrx_n_cycle_act ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0154 lrx_pixel_num ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0158 lrx_monsig ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	monsig_0                          : 1,	//     0
	monsig_1                          : 1,	//     1
	monsig_2                          :11;	//  2:12
} H14A0_FRC_MONSIG;

/*-----------------------------------------------------------------------------
	0x015c lrx_vact ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0160 lrx_vblank ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0164 lrx_hact ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0168 lrx_hblank ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x016c lrx_totalvs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0170 lrx_inp_det_sts ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0174 lrx_iintstat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iintstat_00                        : 1,	//     0
	iintstat_01                        : 1,	//     1
	iintstat_02                        : 1,	//     2
	iintstat_03                        : 1,	//     3
	iintstat_04                        : 1,	//     4
	iintstat_05                        : 1,	//     5
	iintstat_06                        : 1,	//     6
	iintstat_07                        : 1,	//     7
	iintstat_08                        : 1,	//     8
	iintstat_09                        : 1,	//     9
	iintstat_10                        : 1,	//    10
	iintstat_11                        : 1,	//    11
	iintstat_12                        : 1,	//    12
	iintstat_13                        : 1,	//    13
	iintstat_14                        : 1,	//    14
	iintstat_15                        : 1,	//    15
	iintstat_16                        : 1,	//    16
	iintstat_17                        : 1,	//    17
	iintstat_18                        : 1,	//    18
	iintstat_19                        : 1,	//    19
	iintstat_20                        : 1,	//    20
	iintstat_21                        : 1,	//    21
	iintstat_22                        : 1;	//    22
} H14A0_FRC_IINTSTAT;

/*-----------------------------------------------------------------------------
	0x0178 lrx_n_cycle_blank_ch1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x017c lrx_n_cycle_act_ch1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0180 lrx_pixel_num_ch1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0184 lrx_monsig_ch1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	monsig_ch1_0                      : 1,	//     0
	monsig_ch1_1                      : 1,	//     1
	monsig_ch1_2                      :11;	//  2:12
} H14A0_FRC_MONSIG_CH1;

/*-----------------------------------------------------------------------------
	0x0188 lrx_vact_ch1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x018c lrx_vblank_ch1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0190 lrx_hact_ch1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0194 lrx_hblank_ch1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0198 lrx_totalvs_ch1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x019c lrx_forced_update ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01a0 lrx_iint2cfg ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01a4 lrx_iint3cfg ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01a8 lrx_emul_int_cfg_iint4cfg_ ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	emul_int_cfg_iint4cfg_0           : 4,	//  0: 3
	emul_int_cfg_iint4cfg_1           : 4;	//  4: 7
} H14A0_FRC_EMUL_INT_CFG_IINT4CFG_;

typedef struct {
	UINT32                          	lrx_ch0starta                       ;	// 0x0000 : ''
	UINT32                          	lrx_ch0startb                       ;	// 0x0004 : ''
	UINT32                          	lrx_ch0patfrgred                    ;	// 0x0008 : ''
	UINT32                          	lrx_ch0patfrggreen                  ;	// 0x000c : ''
	UINT32                          	lrx_ch0patfrgblue                   ;	// 0x0010 : ''
	UINT32                          	lrx_ch0patbkgred                    ;	// 0x0014 : ''
	UINT32                          	lrx_ch0patbkggreen                  ;	// 0x0018 : ''
	UINT32                          	lrx_ch0patbkgblue                   ;	// 0x001c : ''
	UINT32                          	lrx_ch0startx                       ;	// 0x0020 : ''
	UINT32                          	lrx_ch0starty                       ;	// 0x0024 : ''
	UINT32                          	lrx_ch0endx                         ;	// 0x0028 : ''
	UINT32                          	lrx_ch0endy                         ;	// 0x002c : ''
	UINT32                          	lrx_ch0startx1                      ;	// 0x0030 : ''
	UINT32                          	lrx_ch0starty1                      ;	// 0x0034 : ''
	UINT32                          	lrx_ch0endx1                        ;	// 0x0038 : ''
	UINT32                          	lrx_ch0endy1                        ;	// 0x003c : ''
	UINT32                          	lrx_ch0startx2                      ;	// 0x0040 : ''
	UINT32                          	lrx_ch0starty2                      ;	// 0x0044 : ''
	UINT32                          	lrx_ch0endx2                        ;	// 0x0048 : ''
	UINT32                          	lrx_ch0endy2                        ;	// 0x004c : ''
	UINT32                          	lrx_ch0startx3                      ;	// 0x0050 : ''
	UINT32                          	lrx_ch0starty3                      ;	// 0x0054 : ''
	UINT32                          	lrx_ch0endx3                        ;	// 0x0058 : ''
	UINT32                          	lrx_ch0endy3                        ;	// 0x005c : ''
	UINT32                          	lrx_ch0startx4                      ;	// 0x0060 : ''
	UINT32                          	lrx_ch0starty4                      ;	// 0x0064 : ''
	UINT32                          	lrx_ch0endx4                        ;	// 0x0068 : ''
	UINT32                          	lrx_ch0endy4                        ;	// 0x006c : ''
	H14A0_FRC_CH0PATGEN            		lrx_ch0patgen                       ;	// 0x0070 : ''
	UINT32                          	lrx_ch1starta                       ;	// 0x0074 : ''
	UINT32                          	lrx_ch1startb                       ;	// 0x0078 : ''
	UINT32                          	lrx_ch1patfrgred                    ;	// 0x007c : ''
	UINT32                          	lrx_ch1patfrggreen                  ;	// 0x0080 : ''
	UINT32                          	lrx_ch1patfrgblue                   ;	// 0x0084 : ''
	UINT32                          	lrx_ch1patbkgred                    ;	// 0x0088 : ''
	UINT32                          	lrx_ch1patbkggreen                  ;	// 0x008c : ''
	UINT32                          	lrx_ch1patbkgblue                   ;	// 0x0090 : ''
	UINT32                          	lrx_ch1startx                       ;	// 0x0094 : ''
	UINT32                          	lrx_ch1starty                       ;	// 0x0098 : ''
	UINT32                          	lrx_ch1endx                         ;	// 0x009c : ''
	UINT32                          	lrx_ch1endy                         ;	// 0x00a0 : ''
	UINT32                          	lrx_ch1startx1                      ;	// 0x00a4 : ''
	UINT32                          	lrx_ch1starty1                      ;	// 0x00a8 : ''
	UINT32                          	lrx_ch1endx1                        ;	// 0x00ac : ''
	UINT32                          	lrx_ch1endy1                        ;	// 0x00b0 : ''
	UINT32                          	lrx_ch1startx2                      ;	// 0x00b4 : ''
	UINT32                          	lrx_ch1starty2                      ;	// 0x00b8 : ''
	UINT32                          	lrx_ch1endx2                        ;	// 0x00bc : ''
	UINT32                          	lrx_ch1endy2                        ;	// 0x00c0 : ''
	UINT32                          	lrx_ch1startx3                      ;	// 0x00c4 : ''
	UINT32                          	lrx_ch1starty3                      ;	// 0x00c8 : ''
	UINT32                          	lrx_ch1endx3                        ;	// 0x00cc : ''
	UINT32                          	lrx_ch1endy3                        ;	// 0x00d0 : ''
	UINT32                          	lrx_ch1startx4                      ;	// 0x00d4 : ''
	UINT32                          	lrx_ch1starty4                      ;	// 0x00d8 : ''
	UINT32                          	lrx_ch1endx4                        ;	// 0x00dc : ''
	UINT32                          	lrx_ch1endy4                        ;	// 0x00e0 : ''
	H14A0_FRC_CH1PATGEN            		lrx_ch1patgen                       ;	// 0x00e4 : ''
	UINT32                          	lrx_n_blk_pel_vs                    ;	// 0x00e8 : ''
	UINT32                          	lrx_load_reg                        ;	// 0x00ec : ''
	UINT32                          	lrx_num_hdata                       ;	// 0x00f0 : ''
	UINT32                          	lrx_num_vdata                       ;	// 0x00f4 : ''
	H14A0_FRC_CONFIG                	lrx_config                          ;	// 0x00f8 : ''
	UINT32                          	lrx_iint0cfg                        ;	// 0x00fc : ''
	UINT32                          	lrx_iint1cfg                        ;	// 0x0100 : ''
	UINT32                          	lrx_maxblpix                        ;	// 0x0104 : ''
	H14A0_FRC_TIMEDET1              	lrx_timedet1                        ;	// 0x0108 : ''
	H14A0_FRC_TIMEDET               	lrx_timedet                         ;	// 0x010c : ''
	UINT32                          	lrx_det_sts_clr                     ;	// 0x0110 : ''
	H14A0_FRC_MUXCONFIG             	lrx_muxconfig                       ;	// 0x0114 : ''
	H14A0_FRC_LRX_IINTENABLE           	lrx_iintenable                      ;	// 0x0118 : ''
	H14A0_FRC_LRX_IINTCLEAR            	lrx_iintclear                       ;	// 0x011c : ''
	H14A0_FRC_SYNCPOLARITY             	lrx_syncpolarity                    ;	// 0x0120 : ''
	UINT32                          	lrx_devs_watchdog_cnd               ;	// 0x0124 : ''
	UINT32                          	lrx_norm_fr_num_th                  ;	// 0x0128 : ''
	UINT32                          	lrx_line_error_tol                  ;	// 0x012c : ''
	UINT32                          	lrx_count_sys_min                   ;	// 0x0130 : ''
	UINT32                          	lrx_count_sys_max                   ;	// 0x0134 : ''
	UINT32                          	lrx_no_rxclk_cond                   ;	// 0x0138 : ''
	UINT32                          	lrx_curr_line_cnt                   ;	// 0x013c : ''
	UINT32                          	lrx_norm_fr_num                     ;	// 0x0140 : ''
	UINT32                          	lrx_period_trigger                  ;	// 0x0144 : ''
	UINT32                          	lrx_frame_lock_sts                  ;	// 0x0148 : ''
	UINT32                          	lrx_n_cycle_blank                   ;	// 0x014c : ''
	UINT32                          	lrx_n_cycle_act                     ;	// 0x0150 : ''
	UINT32                          	lrx_pixel_num                       ;	// 0x0154 : ''
	H14A0_FRC_MONSIG                	lrx_monsig                          ;	// 0x0158 : ''
	UINT32                          	lrx_vact                            ;	// 0x015c : ''
	UINT32                          	lrx_vblank                          ;	// 0x0160 : ''
	UINT32                          	lrx_hact                            ;	// 0x0164 : ''
	UINT32                          	lrx_hblank                          ;	// 0x0168 : ''
	UINT32                          	lrx_totalvs                         ;	// 0x016c : ''
	UINT32                          	lrx_inp_det_sts                     ;	// 0x0170 : ''
	H14A0_FRC_IINTSTAT                 	lrx_iintstat                        ;	// 0x0174 : ''
	UINT32                          	lrx_n_cycle_blank_ch1               ;	// 0x0178 : ''
	UINT32                          	lrx_n_cycle_act_ch1                 ;	// 0x017c : ''
	UINT32                          	lrx_pixel_num_ch1                   ;	// 0x0180 : ''
	H14A0_FRC_MONSIG_CH1               	lrx_monsig_ch1                      ;	// 0x0184 : ''
	UINT32                          	lrx_vact_ch1                        ;	// 0x0188 : ''
	UINT32                          	lrx_vblank_ch1                      ;	// 0x018c : ''
	UINT32                          	lrx_hact_ch1                        ;	// 0x0190 : ''
	UINT32                          	lrx_hblank_ch1                      ;	// 0x0194 : ''
	UINT32                          	lrx_totalvs_ch1                     ;	// 0x0198 : ''
	UINT32                          	lrx_forced_update                   ;	// 0x019c : ''
	UINT32                          	lrx_iint2cfg                        ;	// 0x01a0 : ''
	UINT32                          	lrx_iint3cfg                        ;	// 0x01a4 : ''
	H14A0_FRC_EMUL_INT_CFG_IINT4CFG_	lrx_emul_int_cfg_iint4cfg_          ;	// 0x01a8 : ''
} FRC_LRX_REG_H14A0_T;



/*
	FRC_P3D
*/

/*-----------------------------------------------------------------------------
	0x0000 p3d_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p3d_config_0                      : 4,	//  0: 3
	p3d_config_1                      : 1,	//     4
	p3d_config_2                      : 1,	//     5
	p3d_config_3                      : 1,	//     6
	p3d_config_4                      : 1,	//     7
	p3d_config_5                      : 1,	//     8
	p3d_config_6                      : 2,	//  9:10
	p3d_config_7                      : 4,	// 11:14
	p3d_config_8                      : 1;	//    15
} H14A0_FRC_P3D_CONFIG;

/*-----------------------------------------------------------------------------
	0x0004 p3d_n_h_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	n_h_data                        :11;	//  0:10
} H14A0_FRC_N_H_DATA;

/*-----------------------------------------------------------------------------
	0x0008 p3d_n_v_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	n_v_data                        :11;	//  0:10
} H14A0_FRC_N_V_DATA;

/*-----------------------------------------------------------------------------
	0x000c p3d_n_active_left_frame ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	n_active_left_frame             :11;	//  0:10
} H14A0_FRC_N_ACTIVE_LEFT_FRAME;

/*-----------------------------------------------------------------------------
	0x0010 p3d_n_blank_line_separate ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	n_blank_line_separate           : 8;	//  0: 7
} H14A0_FRC_N_BLANK_LINE_SEPARATE;

/*-----------------------------------------------------------------------------
	0x0014 p3d_scl_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p3d_scl_config                  :16;	//  0:15
} H14A0_FRC_P3D_SCL_CONFIG;

/*-----------------------------------------------------------------------------
	0x0018 p3d_xpos_flag_sample ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xpos_flag_sample                :12;	//  0:11
} H14A0_FRC_XPOS_FLAG_SAMPLE;

/*-----------------------------------------------------------------------------
	0x001c p3d_ypos_flag_sample ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ypos_flag_sample                :12;	//  0:11
} H14A0_FRC_YPOS_FLAG_SAMPLE;

/*-----------------------------------------------------------------------------
	0x0020 p3d_load_regs ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	load_regs                       : 1;	//     0
} H14A0_FRC_LOAD_REGS;

/*-----------------------------------------------------------------------------
	0x0024 p3d_r2y_coef11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef11                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF11;

/*-----------------------------------------------------------------------------
	0x0028 p3d_r2y_coef12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef12                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF12;

/*-----------------------------------------------------------------------------
	0x002c p3d_r2y_coef13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef13                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF13;

/*-----------------------------------------------------------------------------
	0x0030 p3d_r2y_coef21 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef21                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF21;

/*-----------------------------------------------------------------------------
	0x0034 p3d_r2y_coef22 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef22                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF22;

/*-----------------------------------------------------------------------------
	0x0038 p3d_r2y_coef23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef23                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF23;

/*-----------------------------------------------------------------------------
	0x003c p3d_r2y_coef31 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef31                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF31;

/*-----------------------------------------------------------------------------
	0x0040 p3d_r2y_coef32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef32                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF32;

/*-----------------------------------------------------------------------------
	0x0044 p3d_r2y_coef33 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r2y_coef33                      :11;	//  0:10
} H14A0_FRC_R2Y_COEF33;

/*-----------------------------------------------------------------------------
	0x0048 p3d_y422_coef0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y422_coef0                      :12;	//  0:11
} H14A0_FRC_Y422_COEF0;

/*-----------------------------------------------------------------------------
	0x004c p3d_y422_coef1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y422_coef1                      :12;	//  0:11
} H14A0_FRC_Y422_COEF1;

/*-----------------------------------------------------------------------------
	0x0050 p3d_y422_coef2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y422_coef2                      :12;	//  0:11
} H14A0_FRC_Y422_COEF2;

/*-----------------------------------------------------------------------------
	0x0054 p3d_y422_coef3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y422_coef3                      :12;	//  0:11
} H14A0_FRC_Y422_COEF3;

/*-----------------------------------------------------------------------------
	0x0058 p3d_y422_coef4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y422_coef4                      :12;	//  0:11
} H14A0_FRC_Y422_COEF4;

/*-----------------------------------------------------------------------------
	0x005c p3d_y422_coef5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y422_coef5                      :12;	//  0:11
} H14A0_FRC_Y422_COEF5;

/*-----------------------------------------------------------------------------
	0x0060 p3d_flag_data_3d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	flag_data_3d                    : 2;	//  0: 1
} H14A0_FRC_FLAG_DATA_3D;

/*-----------------------------------------------------------------------------
	0x0064 p3d_flag_data_3d_lat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	flag_data_3d_lat                : 2;	//  0: 1
} H14A0_FRC_FLAG_DATA_3D_LAT;

typedef struct {
	H14A0_FRC_P3D_CONFIG                      	p3d_p3d_config                      ;	// 0x0000 : ''
	H14A0_FRC_N_H_DATA                        	p3d_n_h_data                        ;	// 0x0004 : ''
	H14A0_FRC_N_V_DATA                        	p3d_n_v_data                        ;	// 0x0008 : ''
	H14A0_FRC_N_ACTIVE_LEFT_FRAME             	p3d_n_active_left_frame             ;	// 0x000c : ''
	H14A0_FRC_N_BLANK_LINE_SEPARATE           	p3d_n_blank_line_separate           ;	// 0x0010 : ''
	H14A0_FRC_P3D_SCL_CONFIG                  	p3d_scl_config                      ;	// 0x0014 : ''
	H14A0_FRC_XPOS_FLAG_SAMPLE                	p3d_xpos_flag_sample                ;	// 0x0018 : ''
	H14A0_FRC_YPOS_FLAG_SAMPLE                	p3d_ypos_flag_sample                ;	// 0x001c : ''
	H14A0_FRC_LOAD_REGS                       	p3d_load_regs                       ;	// 0x0020 : ''
	H14A0_FRC_R2Y_COEF11                      	p3d_r2y_coef11                      ;	// 0x0024 : ''
	H14A0_FRC_R2Y_COEF12                      	p3d_r2y_coef12                      ;	// 0x0028 : ''
	H14A0_FRC_R2Y_COEF13                      	p3d_r2y_coef13                      ;	// 0x002c : ''
	H14A0_FRC_R2Y_COEF21                      	p3d_r2y_coef21                      ;	// 0x0030 : ''
	H14A0_FRC_R2Y_COEF22                      	p3d_r2y_coef22                      ;	// 0x0034 : ''
	H14A0_FRC_R2Y_COEF23                      	p3d_r2y_coef23                      ;	// 0x0038 : ''
	H14A0_FRC_R2Y_COEF31                      	p3d_r2y_coef31                      ;	// 0x003c : ''
	H14A0_FRC_R2Y_COEF32                      	p3d_r2y_coef32                      ;	// 0x0040 : ''
	H14A0_FRC_R2Y_COEF33                      	p3d_r2y_coef33                      ;	// 0x0044 : ''
	H14A0_FRC_Y422_COEF0                      	p3d_y422_coef0                      ;	// 0x0048 : ''
	H14A0_FRC_Y422_COEF1                      	p3d_y422_coef1                      ;	// 0x004c : ''
	H14A0_FRC_Y422_COEF2                      	p3d_y422_coef2                      ;	// 0x0050 : ''
	H14A0_FRC_Y422_COEF3                      	p3d_y422_coef3                      ;	// 0x0054 : ''
	H14A0_FRC_Y422_COEF4                      	p3d_y422_coef4                      ;	// 0x0058 : ''
	H14A0_FRC_Y422_COEF5                      	p3d_y422_coef5                      ;	// 0x005c : ''
	H14A0_FRC_FLAG_DATA_3D                    	p3d_flag_data_3d                    ;	// 0x0060 : ''
	H14A0_FRC_FLAG_DATA_3D_LAT                	p3d_flag_data_3d_lat                ;	// 0x0064 : ''
} FRC_P3D_REG_H14A0_T;



/*
	FRC_DVI
*/

/*-----------------------------------------------------------------------------
	0x0000 dvi_config_ch0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config_ch0_00                      : 1,	//     0
	config_ch0_01                      : 1,	//     1
	config_ch0_02                      : 1,	//     2
	config_ch0_03                      : 1,	//     3
	config_ch0_04                      : 1,	//     4
	config_ch0_05                      : 1,	//     5
	config_ch0_06                      : 6,	//  6:11
	config_ch0_07                      : 1,	//    12
	config_ch0_08                      : 1,	//    13
	config_ch0_09                      : 1,	//    14
	config_ch0_10                      : 1,	//    15
	config_ch0_11                      : 1,	//    16
	config_ch0_12                      : 1;	//    17
} H14A0_FRC_CONFIG_CH0;

/*-----------------------------------------------------------------------------
	0x0004 dvi_config_ch1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config_ch1_0                      : 1,	//     0
	config_ch1_1                      :13,	//  1:13
	config_ch1_2                      : 1,	//    14
	config_ch1_3                      : 1,	//    15
	config_ch1_4                      : 1,	//    16
	config_ch1_5                      : 1;	//    17
} H14A0_FRC_CONFIG_CH1;

/*-----------------------------------------------------------------------------
	0x0008 dvi_config1_ch0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config1_ch0_0                     : 1,	//     0
	config1_ch0_1                     :15,	//  1:15
	config1_ch0_2                     : 1,	//     2
	config1_ch0_3                     : 1,	//     3
	config1_ch0_4                     : 1,	//     4
	config1_ch0_5                     : 2,	//  5: 6
	config1_ch0_6                     : 1,	//     7
	config1_ch0_7                     : 1,	//     8
	config1_ch0_8                     : 1;	//     9
} H14A0_FRC_CONFIG1_CH0;

/*-----------------------------------------------------------------------------
	0x000c dvi_config1_ch1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config1_ch1_0                     : 1,	//     0
	config1_ch1_1                     : 1,	//     1
	config1_ch1_2                     : 1,	//     2
	config1_ch1_3                     : 1,	//     3
	config1_ch1_4                     : 1,	//     4
	config1_ch1_5                     : 2,	//  5: 6
	config1_ch1_6                     : 1,	//     7
	config1_ch1_7                     : 8;	//  8:15
} H14A0_FRC_CONFIG1_CH1;

/*-----------------------------------------------------------------------------
	0x0010 dvi_bypassba0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bypassba0                       :19;	//  0:18
} H14A0_FRC_BYPASSBA0;

/*-----------------------------------------------------------------------------
	0x0014 dvi_mcadrh0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrh0                         :19;	//  0:18
} H14A0_FRC_MCADRH0;

/*-----------------------------------------------------------------------------
	0x0018 dvi_mcadrl0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrl0                         :19;	//  0:18
} H14A0_FRC_MCADRL0;

/*-----------------------------------------------------------------------------
	0x001c dvi_meyadr0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	meyadr0                         :19;	//  0:18
} H14A0_FRC_MEYADR0;

/*-----------------------------------------------------------------------------
	0x0020 dvi_osdmapadr0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	osdmapadr0                      :19;	//  0:18
} H14A0_FRC_OSDMAPADR0;

/*-----------------------------------------------------------------------------
	0x0024 dvi_mcadrh_s0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrh_s0                       :19;	//  0:18
} H14A0_FRC_MCADRH_S0;

/*-----------------------------------------------------------------------------
	0x0028 dvi_mcadrl_s0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrl_s0                       :19;	//  0:18
} H14A0_FRC_MCADRL_S0;

/*-----------------------------------------------------------------------------
	0x002c dvi_bypassba1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bypassba1                       :19;	//  0:18
} H14A0_FRC_BYPASSBA1;

/*-----------------------------------------------------------------------------
	0x0030 dvi_mcadrh1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrh1                         :19;	//  0:18
} H14A0_FRC_MCADRH1;

/*-----------------------------------------------------------------------------
	0x0034 dvi_mcadrl1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrl1                         :19;	//  0:18
} H14A0_FRC_MCADRL1;

/*-----------------------------------------------------------------------------
	0x0038 dvi_meyadr1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	meyadr1                         :19;	//  0:18
} H14A0_FRC_MEYADR1;

/*-----------------------------------------------------------------------------
	0x003c dvi_osdmapadr1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	osdmapadr1                      :19;	//  0:18
} H14A0_FRC_OSDMAPADR1;

/*-----------------------------------------------------------------------------
	0x0040 dvi_mcadrh_s1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrh_s1                       :19;	//  0:18
} H14A0_FRC_MCADRH_S1;

/*-----------------------------------------------------------------------------
	0x0044 dvi_mcadrl_s1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrl_s1                       :19;	//  0:18
} H14A0_FRC_MCADRL_S1;

/*-----------------------------------------------------------------------------
	0x0048 dvi_gmau_ls ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	gmau_ls_0                         :30,	//  1:30
	gmau_ls_1                         : 1;	//    15
} H14A0_FRC_GMAU_LS;

/*-----------------------------------------------------------------------------
	0x004c dvi_gmau_ls_s ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	gmau_ls_s_0                       :20,	//  1:20
	gmau_ls_s_1                       : 3;	//  9:11
} H14A0_FRC_GMAU_LS_S;

/*-----------------------------------------------------------------------------
	0x0050 dvi_ghist00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist00                         :31;	//  1:31
} H14A0_FRC_GHIST00;

/*-----------------------------------------------------------------------------
	0x0054 dvi_ghist02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist02                         :31;	//  1:31
} H14A0_FRC_GHIST02;

/*-----------------------------------------------------------------------------
	0x0058 dvi_ghist04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist04                         :31;	//  1:31
} H14A0_FRC_GHIST04;

/*-----------------------------------------------------------------------------
	0x005c dvi_ghist06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist06                         :31;	//  1:31
} H14A0_FRC_GHIST06;

/*-----------------------------------------------------------------------------
	0x0060 dvi_ghist08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist08                         :31;	//  1:31
} H14A0_FRC_GHIST08;

/*-----------------------------------------------------------------------------
	0x0064 dvi_ghist10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist10                         :31;	//  1:31
} H14A0_FRC_GHIST10;

/*-----------------------------------------------------------------------------
	0x0068 dvi_ghist12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist12                         :31;	//  1:31
} H14A0_FRC_GHIST12;

/*-----------------------------------------------------------------------------
	0x006c dvi_ghist14 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist14                         :31;	//  1:31
} H14A0_FRC_GHIST14;

/*-----------------------------------------------------------------------------
	0x0070 dvi_ghist16 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist16                         :31;	//  1:31
} H14A0_FRC_GHIST16;

/*-----------------------------------------------------------------------------
	0x0074 dvi_ghist18 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist18                         :31;	//  1:31
} H14A0_FRC_GHIST18;

/*-----------------------------------------------------------------------------
	0x0078 dvi_ghist20 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist20                         :31;	//  1:31
} H14A0_FRC_GHIST20;

/*-----------------------------------------------------------------------------
	0x007c dvi_ghist22 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist22                         :31;	//  1:31
} H14A0_FRC_GHIST22;

/*-----------------------------------------------------------------------------
	0x0080 dvi_ghist24 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist24                         :31;	//  1:31
} H14A0_FRC_GHIST24;

/*-----------------------------------------------------------------------------
	0x0084 dvi_ghist26 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist26                         :31;	//  1:31
} H14A0_FRC_GHIST26;

/*-----------------------------------------------------------------------------
	0x0088 dvi_ghist28 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist28                         :31;	//  1:31
} H14A0_FRC_GHIST28;

/*-----------------------------------------------------------------------------
	0x008c dvi_ghist30 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	ghist30                         :31;	//  1:31
} H14A0_FRC_GHIST30;

/*-----------------------------------------------------------------------------
	0x0090 dvi_pxlav ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pxlav                           :16;	//  0:15
} H14A0_FRC_PXLAV;

/*-----------------------------------------------------------------------------
	0x0094 dvi_xlapav ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapav                          :16;	//  0:15
} H14A0_FRC_XLAPAV;

/*-----------------------------------------------------------------------------
	0x0098 dvi_bnd0valthr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd0valthr                      :16;	//  0:15
} H14A0_FRC_BND0VALTHR;

/*-----------------------------------------------------------------------------
	0x009c dvi_bnd0cntthr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd0cntthr                      :16;	//  0:15
} H14A0_FRC_BND0CNTTHR;

/*-----------------------------------------------------------------------------
	0x00a0 dvi_bnd0postop ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0postop                      :26;	//  1:26
} H14A0_FRC_BND0POSTOP;

/*-----------------------------------------------------------------------------
	0x00a4 dvi_bnd0posbottom ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0posbottom                   :26;	//  1:26
} H14A0_FRC_BND0POSBOTTOM;

/*-----------------------------------------------------------------------------
	0x00a8 dvi_bnd0posleft ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0posleft                     :26;	//  1:26
} H14A0_FRC_BND0POSLEFT;

/*-----------------------------------------------------------------------------
	0x00ac dvi_bnd0posright ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0posright                    :26;	//  1:26
} H14A0_FRC_BND0POSRIGHT;

/*-----------------------------------------------------------------------------
	0x00b0 dvi_bnd0masktop ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd0masktop_0                     : 8,	//  0: 7
	bnd0masktop_1                     : 8;	//  8:15
} H14A0_FRC_BND0MASKTOP;

/*-----------------------------------------------------------------------------
	0x00b4 dvi_bnd0maskbottom ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd0maskbottom_0                  : 8,	//  0: 7
	bnd0maskbottom_1                  : 8;	//  8:15
} H14A0_FRC_BND0MASKBOTTOM;

/*-----------------------------------------------------------------------------
	0x00b8 dvi_bnd0maskleft ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd0maskleft_0                    : 8,	//  0: 7
	bnd0maskleft_1                    : 8;	//  8:15
} H14A0_FRC_BND0MASKLEFT;

/*-----------------------------------------------------------------------------
	0x00bc dvi_bnd0maskright ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd0maskright_0                   : 8,	//  0: 7
	bnd0maskright_1                   : 8;	//  8:15
} H14A0_FRC_BND0MASKRIGHT;

/*-----------------------------------------------------------------------------
	0x00c0 dvi_bnd1valthr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd1valthr                      :16;	//  0:15
} H14A0_FRC_BND1VALTHR;

/*-----------------------------------------------------------------------------
	0x00c4 dvi_bnd1cntthr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd1cntthr                      :16;	//  0:15
} H14A0_FRC_BND1CNTTHR;

/*-----------------------------------------------------------------------------
	0x00c8 dvi_bnd1postop ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1postop                      :26;	//  1:26
} H14A0_FRC_BND1POSTOP;

/*-----------------------------------------------------------------------------
	0x00cc dvi_bnd1posbottom ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1posbottom                   :26;	//  1:26
} H14A0_FRC_BND1POSBOTTOM;

/*-----------------------------------------------------------------------------
	0x00d0 dvi_bnd1posleft ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1posleft                     :26;	//  1:26
} H14A0_FRC_BND1POSLEFT;

/*-----------------------------------------------------------------------------
	0x00d4 dvi_bnd1posright ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1posright                    :26;	//  1:26
} H14A0_FRC_BND1POSRIGHT;

/*-----------------------------------------------------------------------------
	0x00d8 dvi_bnd1masktop ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd1masktop_0                     : 8,	//  0: 7
	bnd1masktop_1                     : 8;	//  8:15
} H14A0_FRC_BND1MASKTOP;

/*-----------------------------------------------------------------------------
	0x00dc dvi_bnd1maskbottom ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd1maskbottom_0                  : 8,	//  0: 7
	bnd1maskbottom_1                  : 8;	//  8:15
} H14A0_FRC_BND1MASKBOTTOM;

/*-----------------------------------------------------------------------------
	0x00e0 dvi_bnd1maskleft ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd1maskleft_0                    : 8,	//  0: 7
	bnd1maskleft_1                    : 8;	//  8:15
} H14A0_FRC_BND1MASKLEFT;

/*-----------------------------------------------------------------------------
	0x00e4 dvi_bnd1maskright ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd1maskright_0                   : 8,	//  0: 7
	bnd1maskright_1                   : 8;	//  8:15
} H14A0_FRC_BND1MASKRIGHT;

/*-----------------------------------------------------------------------------
	0x00e8 dvi_bnd0sumtop0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumtop0                     :31;	//  1:31
} H14A0_FRC_BND0SUMTOP0;

/*-----------------------------------------------------------------------------
	0x00ec dvi_bnd0sumtop1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumtop1                     :31;	//  1:31
} H14A0_FRC_BND0SUMTOP1;

/*-----------------------------------------------------------------------------
	0x00f0 dvi_bnd0sumtop2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumtop2                     :31;	//  1:31
} H14A0_FRC_BND0SUMTOP2;

/*-----------------------------------------------------------------------------
	0x00f4 dvi_bnd0sumtop3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumtop3                     :31;	//  1:31
} H14A0_FRC_BND0SUMTOP3;

/*-----------------------------------------------------------------------------
	0x00f8 dvi_bnd0sumbottom0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumbottom0                  :31;	//  1:31
} H14A0_FRC_BND0SUMBOTTOM0;

/*-----------------------------------------------------------------------------
	0x00fc dvi_bnd0sumbottom1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumbottom1                  :31;	//  1:31
} H14A0_FRC_BND0SUMBOTTOM1;

/*-----------------------------------------------------------------------------
	0x0100 dvi_bnd0sumbottom2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumbottom2                  :31;	//  1:31
} H14A0_FRC_BND0SUMBOTTOM2;

/*-----------------------------------------------------------------------------
	0x0104 dvi_bnd0sumbottom3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumbottom3                  :31;	//  1:31
} H14A0_FRC_BND0SUMBOTTOM3;

/*-----------------------------------------------------------------------------
	0x0108 dvi_bnd0sumleft0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumleft0                    :31;	//  1:31
} H14A0_FRC_BND0SUMLEFT0;

/*-----------------------------------------------------------------------------
	0x010c dvi_bnd0sumleft1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumleft1                    :31;	//  1:31
} H14A0_FRC_BND0SUMLEFT1;

/*-----------------------------------------------------------------------------
	0x0110 dvi_bnd0sumleft2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumleft2                    :31;	//  1:31
} H14A0_FRC_BND0SUMLEFT2;

/*-----------------------------------------------------------------------------
	0x0114 dvi_bnd0sumleft3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumleft3                    :31;	//  1:31
} H14A0_FRC_BND0SUMLEFT3;

/*-----------------------------------------------------------------------------
	0x0118 dvi_bnd0sumright0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumright0                   :31;	//  1:31
} H14A0_FRC_BND0SUMRIGHT0;

/*-----------------------------------------------------------------------------
	0x011c dvi_bnd0sumright1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumright1                   :31;	//  1:31
} H14A0_FRC_BND0SUMRIGHT1;

/*-----------------------------------------------------------------------------
	0x0120 dvi_bnd0sumright2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumright2                   :31;	//  1:31
} H14A0_FRC_BND0SUMRIGHT2;

/*-----------------------------------------------------------------------------
	0x0124 dvi_bnd0sumright3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd0sumright3                   :31;	//  1:31
} H14A0_FRC_BND0SUMRIGHT3;

/*-----------------------------------------------------------------------------
	0x0128 dvi_bnd0flagtop0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x012c dvi_bnd0flagtop1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0130 dvi_bnd0flagbottom0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0134 dvi_bnd0flagbottom1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0138 dvi_bnd0flagleft0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x013c dvi_bnd0flagleft1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0140 dvi_bnd0flagright0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0144 dvi_bnd0flagright1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0148 dvi_bnd1sumtop0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumtop0                     :31;	//  1:31
} H14A0_FRC_BND1SUMTOP0;

/*-----------------------------------------------------------------------------
	0x014c dvi_bnd1sumtop1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumtop1                     :31;	//  1:31
} H14A0_FRC_BND1SUMTOP1;

/*-----------------------------------------------------------------------------
	0x0150 dvi_bnd1sumtop2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumtop2                     :31;	//  1:31
} H14A0_FRC_BND1SUMTOP2;

/*-----------------------------------------------------------------------------
	0x0154 dvi_bnd1sumtop3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumtop3                     :31;	//  1:31
} H14A0_FRC_BND1SUMTOP3;

/*-----------------------------------------------------------------------------
	0x0158 dvi_bnd1sumbottom0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumbottom0                  :31;	//  1:31
} H14A0_FRC_BND1SUMBOTTOM0;

/*-----------------------------------------------------------------------------
	0x015c dvi_bnd1sumbottom1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumbottom1                  :31;	//  1:31
} H14A0_FRC_BND1SUMBOTTOM1;

/*-----------------------------------------------------------------------------
	0x0160 dvi_bnd1sumbottom2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumbottom2                  :31;	//  1:31
} H14A0_FRC_BND1SUMBOTTOM2;

/*-----------------------------------------------------------------------------
	0x0164 dvi_bnd1sumbottom3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumbottom3                  :31;	//  1:31
} H14A0_FRC_BND1SUMBOTTOM3;

/*-----------------------------------------------------------------------------
	0x0168 dvi_bnd1sumleft0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumleft0                    :31;	//  1:31
} H14A0_FRC_BND1SUMLEFT0;

/*-----------------------------------------------------------------------------
	0x016c dvi_bnd1sumleft1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumleft1                    :31;	//  1:31
} H14A0_FRC_BND1SUMLEFT1;

/*-----------------------------------------------------------------------------
	0x0170 dvi_bnd1sumleft2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumleft2                    :31;	//  1:31
} H14A0_FRC_BND1SUMLEFT2;

/*-----------------------------------------------------------------------------
	0x0174 dvi_bnd1sumleft3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumleft3                    :31;	//  1:31
} H14A0_FRC_BND1SUMLEFT3;

/*-----------------------------------------------------------------------------
	0x0178 dvi_bnd1sumright0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumright0                   :31;	//  1:31
} H14A0_FRC_BND1SUMRIGHT0;

/*-----------------------------------------------------------------------------
	0x017c dvi_bnd1sumright1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumright1                   :31;	//  1:31
} H14A0_FRC_BND1SUMRIGHT1;

/*-----------------------------------------------------------------------------
	0x0180 dvi_bnd1sumright2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumright2                   :31;	//  1:31
} H14A0_FRC_BND1SUMRIGHT2;

/*-----------------------------------------------------------------------------
	0x0184 dvi_bnd1sumright3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bnd1sumright3                   :31;	//  1:31
} H14A0_FRC_BND1SUMRIGHT3;

/*-----------------------------------------------------------------------------
	0x0188 dvi_bnd1flagtop0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x018c dvi_bnd1flagtop1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0190 dvi_bnd1flagbottom0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0194 dvi_bnd1flagbottom1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0198 dvi_bnd1flagleft0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x019c dvi_bnd1flagleft1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01a0 dvi_bnd1flagright0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01a4 dvi_bnd1flagright1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01a8 dvi_yuvcoef11_me ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	yuvcoef11_me                    :11;	//  0:10
} H14A0_FRC_YUVCOEF11_ME;

/*-----------------------------------------------------------------------------
	0x01ac dvi_yuvcoef12_me ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	yuvcoef12_me                    :11;	//  0:10
} H14A0_FRC_YUVCOEF12_ME;

/*-----------------------------------------------------------------------------
	0x01b0 dvi_yuvcoef13_me ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	yuvcoef13_me                    :11;	//  0:10
} H14A0_FRC_YUVCOEF13_ME;

/*-----------------------------------------------------------------------------
	0x01b4 dvi_numpixtot1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	numpixtot1                      :16;	//  0:15
} H14A0_FRC_NUMPIXTOT1;

/*-----------------------------------------------------------------------------
	0x01b8 dvi_numpixtot2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	numpixtot2                      : 8;	//  0: 7
} H14A0_FRC_NUMPIXTOT2;

/*-----------------------------------------------------------------------------
	0x01bc dvi_numpixdark1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	numpixdark1                     :16;	//  0:15
} H14A0_FRC_NUMPIXDARK1;

/*-----------------------------------------------------------------------------
	0x01c0 dvi_numpixdark2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	numpixdark2                     : 8;	//  0: 7
} H14A0_FRC_NUMPIXDARK2;

/*-----------------------------------------------------------------------------
	0x01c4 dvi_numpixbw1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	numpixbw1                       :16;	//  0:15
} H14A0_FRC_NUMPIXBW1;

/*-----------------------------------------------------------------------------
	0x01c8 dvi_numpixbw2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	numpixbw2                       : 8;	//  0: 7
} H14A0_FRC_NUMPIXBW2;

/*-----------------------------------------------------------------------------
	0x01cc dvi_numpixsc1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	numpixsc1                       :16;	//  0:15
} H14A0_FRC_NUMPIXSC1;

/*-----------------------------------------------------------------------------
	0x01d0 dvi_numpixsc2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	numpixsc2                       : 8;	//  0: 7
} H14A0_FRC_NUMPIXSC2;

/*-----------------------------------------------------------------------------
	0x01d4 dvi_tpixbw1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpixbw1                         :16;	//  0:15
} H14A0_FRC_TPIXBW1;

/*-----------------------------------------------------------------------------
	0x01d8 dvi_tpixbw2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpixbw2                         : 8;	//  0: 7
} H14A0_FRC_TPIXBW2;

/*-----------------------------------------------------------------------------
	0x01dc dvi_tpixsc1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpixsc1                         :16;	//  0:15
} H14A0_FRC_TPIXSC1;

/*-----------------------------------------------------------------------------
	0x01e0 dvi_tpixsc2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpixsc2                         : 8;	//  0: 7
} H14A0_FRC_TPIXSC2;

/*-----------------------------------------------------------------------------
	0x01e4 dvi_cpixbw1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cpixbw1                         :16;	//  0:15
} H14A0_FRC_CPIXBW1;

/*-----------------------------------------------------------------------------
	0x01e8 dvi_cpixbw2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cpixbw2                         : 8;	//  0: 7
} H14A0_FRC_CPIXBW2;

/*-----------------------------------------------------------------------------
	0x01ec dvi_cpixsc1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cpixsc1                         :16;	//  0:15
} H14A0_FRC_CPIXSC1;

/*-----------------------------------------------------------------------------
	0x01f0 dvi_cpixsc2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cpixsc2                         : 8;	//  0: 7
} H14A0_FRC_CPIXSC2;

/*-----------------------------------------------------------------------------
	0x01f4 dvi_steepgra0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	steepgra0_0                       :23,	//  1:23
	steepgra0_1                       :30,	//  2:31
	steepgra0_2                       : 8;	//  8:15
} H14A0_FRC_STEEPGRA0;

/*-----------------------------------------------------------------------------
	0x01f8 dvi_steepgra1_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	steepgra1_0                     :19;	//  1:19
} H14A0_FRC_STEEPGRA1_0;

/*-----------------------------------------------------------------------------
	0x01fc dvi_steepgra1_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	steepgra1_1                     :19;	//  1:19
} H14A0_FRC_STEEPGRA1_1;

/*-----------------------------------------------------------------------------
	0x0200 dvi_stgregion_lruc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	stgregion_lruc                  :21;	//  1:21
} H14A0_FRC_STGREGION_LRUC;

/*-----------------------------------------------------------------------------
	0x0204 dvi_stgregion_lrbc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	stgregion_lrbc                  :21;	//  1:21
} H14A0_FRC_STGREGION_LRBC;

/*-----------------------------------------------------------------------------
	0x0208 dvi_stgregion_tbc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	stgregion_tbc                   :21;	//  1:21
} H14A0_FRC_STGREGION_TBC;

/*-----------------------------------------------------------------------------
	0x020c dvi_stgregion_lru ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	stgregion_lru                   :21;	//  1:21
} H14A0_FRC_STGREGION_LRU;

/*-----------------------------------------------------------------------------
	0x0210 dvi_stgregion_lrb ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	stgregion_lrb                   :21;	//  1:21
} H14A0_FRC_STGREGION_LRB;

/*-----------------------------------------------------------------------------
	0x0214 dvi_stgregion_tb ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	stgregion_tb                    :21;	//  1:21
} H14A0_FRC_STGREGION_TB;

/*-----------------------------------------------------------------------------
	0x0218 dvi_xlapav12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	xlapav12                        :31;	//  1:31
} H14A0_FRC_XLAPAV12;

/*-----------------------------------------------------------------------------
	0x021c dvi_xlapav34 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	xlapav34                        :31;	//  1:31
} H14A0_FRC_XLAPAV34;

/*-----------------------------------------------------------------------------
	0x0220 dvi_xlapav56 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	xlapav56                        :31;	//  1:31
} H14A0_FRC_XLAPAV56;

/*-----------------------------------------------------------------------------
	0x0224 dvi_xlapav78 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	xlapav78                        :31;	//  1:31
} H14A0_FRC_XLAPAV78;

/*-----------------------------------------------------------------------------
	0x0228 dvi_xlapav9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapav9                         :16;	//  0:15
} H14A0_FRC_XLAPAV9;

/*-----------------------------------------------------------------------------
	0x022c dvi_xlapah1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah1                         :24;	//  0:23
} H14A0_FRC_XLAPAH1;

/*-----------------------------------------------------------------------------
	0x0230 dvi_xlapah2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah2                         :24;	//  0:23
} H14A0_FRC_XLAPAH2;

/*-----------------------------------------------------------------------------
	0x0234 dvi_xlapah3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah3                         :24;	//  0:23
} H14A0_FRC_XLAPAH3;

/*-----------------------------------------------------------------------------
	0x0238 dvi_xlapah4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah4                         :24;	//  0:23
} H14A0_FRC_XLAPAH4;

/*-----------------------------------------------------------------------------
	0x023c dvi_xlapah5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah5                         :24;	//  0:23
} H14A0_FRC_XLAPAH5;

/*-----------------------------------------------------------------------------
	0x0240 dvi_xlapah6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah6                         :24;	//  0:23
} H14A0_FRC_XLAPAH6;

/*-----------------------------------------------------------------------------
	0x0244 dvi_xlapah7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah7                         :24;	//  0:23
} H14A0_FRC_XLAPAH7;

/*-----------------------------------------------------------------------------
	0x0248 dvi_xlapah8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah8                         :24;	//  0:23
} H14A0_FRC_XLAPAH8;

/*-----------------------------------------------------------------------------
	0x024c dvi_xlapah9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah9                         :24;	//  0:23
} H14A0_FRC_XLAPAH9;

/*-----------------------------------------------------------------------------
	0x0250 dvi_xlapah10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah10                        :24;	//  0:23
} H14A0_FRC_XLAPAH10;

/*-----------------------------------------------------------------------------
	0x0254 dvi_xlapah11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	xlapah11                        :24;	//  0:23
} H14A0_FRC_XLAPAH11;

/*-----------------------------------------------------------------------------
	0x0258 dvi_bolow0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bolow0                          :21;	//  1:21
} H14A0_FRC_BOLOW0;

/*-----------------------------------------------------------------------------
	0x025c dvi_bohigh0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bohigh0                         :21;	//  1:21
} H14A0_FRC_BOHIGH0;

/*-----------------------------------------------------------------------------
	0x0260 dvi_bolow1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bolow1                          :21;	//  1:21
} H14A0_FRC_BOLOW1;

/*-----------------------------------------------------------------------------
	0x0264 dvi_bohigh1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	bohigh1                         :21;	//  1:21
} H14A0_FRC_BOHIGH1;

/*-----------------------------------------------------------------------------
	0x0268 dvi_mcth0h00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h00                        :24;	//  0:23
} H14A0_FRC_MCTH0H00;

/*-----------------------------------------------------------------------------
	0x026c dvi_mcth0h01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h01                        :24;	//  0:23
} H14A0_FRC_MCTH0H01;

/*-----------------------------------------------------------------------------
	0x0270 dvi_mcth0h02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h02                        :24;	//  0:23
} H14A0_FRC_MCTH0H02;

/*-----------------------------------------------------------------------------
	0x0274 dvi_mcth0h03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h03                        :24;	//  0:23
} H14A0_FRC_MCTH0H03;

/*-----------------------------------------------------------------------------
	0x0278 dvi_mcth0h10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h10                        :24;	//  0:23
} H14A0_FRC_MCTH0H10;

/*-----------------------------------------------------------------------------
	0x027c dvi_mcth0h11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h11                        :24;	//  0:23
} H14A0_FRC_MCTH0H11;

/*-----------------------------------------------------------------------------
	0x0280 dvi_mcth0h12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h12                        :24;	//  0:23
} H14A0_FRC_MCTH0H12;

/*-----------------------------------------------------------------------------
	0x0284 dvi_mcth0h13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h13                        :24;	//  0:23
} H14A0_FRC_MCTH0H13;

/*-----------------------------------------------------------------------------
	0x0288 dvi_mcth0h20 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h20                        :24;	//  0:23
} H14A0_FRC_MCTH0H20;

/*-----------------------------------------------------------------------------
	0x028c dvi_mcth0h21 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h21                        :24;	//  0:23
} H14A0_FRC_MCTH0H21;

/*-----------------------------------------------------------------------------
	0x0290 dvi_mcth0h22 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h22                        :24;	//  0:23
} H14A0_FRC_MCTH0H22;

/*-----------------------------------------------------------------------------
	0x0294 dvi_mcth0h23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h23                        :24;	//  0:23
} H14A0_FRC_MCTH0H23;

/*-----------------------------------------------------------------------------
	0x0298 dvi_mcth0h30 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h30                        :24;	//  0:23
} H14A0_FRC_MCTH0H30;

/*-----------------------------------------------------------------------------
	0x029c dvi_mcth0h31 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h31                        :24;	//  0:23
} H14A0_FRC_MCTH0H31;

/*-----------------------------------------------------------------------------
	0x02a0 dvi_mcth0h32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h32                        :24;	//  0:23
} H14A0_FRC_MCTH0H32;

/*-----------------------------------------------------------------------------
	0x02a4 dvi_mcth0h33 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0h33                        :24;	//  0:23
} H14A0_FRC_MCTH0H33;

/*-----------------------------------------------------------------------------
	0x02a8 dvi_mcth0v00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v00                        :24;	//  0:23
} H14A0_FRC_MCTH0V00;

/*-----------------------------------------------------------------------------
	0x02ac dvi_mcth0v01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v01                        :24;	//  0:23
} H14A0_FRC_MCTH0V01;

/*-----------------------------------------------------------------------------
	0x02b0 dvi_mcth0v02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v02                        :24;	//  0:23
} H14A0_FRC_MCTH0V02;

/*-----------------------------------------------------------------------------
	0x02b4 dvi_mcth0v03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v03                        :24;	//  0:23
} H14A0_FRC_MCTH0V03;

/*-----------------------------------------------------------------------------
	0x02b8 dvi_mcth0v10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v10                        :24;	//  0:23
} H14A0_FRC_MCTH0V10;

/*-----------------------------------------------------------------------------
	0x02bc dvi_mcth0v11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v11                        :24;	//  0:23
} H14A0_FRC_MCTH0V11;

/*-----------------------------------------------------------------------------
	0x02c0 dvi_mcth0v12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v12                        :24;	//  0:23
} H14A0_FRC_MCTH0V12;

/*-----------------------------------------------------------------------------
	0x02c4 dvi_mcth0v13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v13                        :24;	//  0:23
} H14A0_FRC_MCTH0V13;

/*-----------------------------------------------------------------------------
	0x02c8 dvi_mcth0v20 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v20                        :24;	//  0:23
} H14A0_FRC_MCTH0V20;

/*-----------------------------------------------------------------------------
	0x02cc dvi_mcth0v21 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v21                        :24;	//  0:23
} H14A0_FRC_MCTH0V21;

/*-----------------------------------------------------------------------------
	0x02d0 dvi_mcth0v22 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v22                        :24;	//  0:23
} H14A0_FRC_MCTH0V22;

/*-----------------------------------------------------------------------------
	0x02d4 dvi_mcth0v23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v23                        :24;	//  0:23
} H14A0_FRC_MCTH0V23;

/*-----------------------------------------------------------------------------
	0x02d8 dvi_mcth0v30 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v30                        :24;	//  0:23
} H14A0_FRC_MCTH0V30;

/*-----------------------------------------------------------------------------
	0x02dc dvi_mcth0v31 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v31                        :24;	//  0:23
} H14A0_FRC_MCTH0V31;

/*-----------------------------------------------------------------------------
	0x02e0 dvi_mcth0v32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v32                        :24;	//  0:23
} H14A0_FRC_MCTH0V32;

/*-----------------------------------------------------------------------------
	0x02e4 dvi_mcth0v33 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth0v33                        :24;	//  0:23
} H14A0_FRC_MCTH0V33;

/*-----------------------------------------------------------------------------
	0x02e8 dvi_mcth1h00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h00                        :24;	//  0:23
} H14A0_FRC_MCTH1H00;

/*-----------------------------------------------------------------------------
	0x02ec dvi_mcth1h01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h01                        :24;	//  0:23
} H14A0_FRC_MCTH1H01;

/*-----------------------------------------------------------------------------
	0x02f0 dvi_mcth1h02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h02                        :24;	//  0:23
} H14A0_FRC_MCTH1H02;

/*-----------------------------------------------------------------------------
	0x02f4 dvi_mcth1h03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h03                        :24;	//  0:23
} H14A0_FRC_MCTH1H03;

/*-----------------------------------------------------------------------------
	0x02f8 dvi_mcth1h10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h10                        :24;	//  0:23
} H14A0_FRC_MCTH1H10;

/*-----------------------------------------------------------------------------
	0x02fc dvi_mcth1h11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h11                        :24;	//  0:23
} H14A0_FRC_MCTH1H11;

/*-----------------------------------------------------------------------------
	0x0300 dvi_mcth1h12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h12                        :24;	//  0:23
} H14A0_FRC_MCTH1H12;

/*-----------------------------------------------------------------------------
	0x0304 dvi_mcth1h13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h13                        :24;	//  0:23
} H14A0_FRC_MCTH1H13;

/*-----------------------------------------------------------------------------
	0x0308 dvi_mcth1h20 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h20                        :24;	//  0:23
} H14A0_FRC_MCTH1H20;

/*-----------------------------------------------------------------------------
	0x030c dvi_mcth1h21 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h21                        :24;	//  0:23
} H14A0_FRC_MCTH1H21;

/*-----------------------------------------------------------------------------
	0x0310 dvi_mcth1h22 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h22                        :24;	//  0:23
} H14A0_FRC_MCTH1H22;

/*-----------------------------------------------------------------------------
	0x0314 dvi_mcth1h23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h23                        :24;	//  0:23
} H14A0_FRC_MCTH1H23;

/*-----------------------------------------------------------------------------
	0x0318 dvi_mcth1h30 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h30                        :24;	//  0:23
} H14A0_FRC_MCTH1H30;

/*-----------------------------------------------------------------------------
	0x031c dvi_mcth1h31 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h31                        :24;	//  0:23
} H14A0_FRC_MCTH1H31;

/*-----------------------------------------------------------------------------
	0x0320 dvi_mcth1h32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h32                        :24;	//  0:23
} H14A0_FRC_MCTH1H32;

/*-----------------------------------------------------------------------------
	0x0324 dvi_mcth1h33 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1h33                        :24;	//  0:23
} H14A0_FRC_MCTH1H33;

/*-----------------------------------------------------------------------------
	0x0328 dvi_mcth1v00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v00                        :24;	//  0:23
} H14A0_FRC_MCTH1V00;

/*-----------------------------------------------------------------------------
	0x032c dvi_mcth1v01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v01                        :24;	//  0:23
} H14A0_FRC_MCTH1V01;

/*-----------------------------------------------------------------------------
	0x0330 dvi_mcth1v02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v02                        :24;	//  0:23
} H14A0_FRC_MCTH1V02;

/*-----------------------------------------------------------------------------
	0x0334 dvi_mcth1v03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v03                        :24;	//  0:23
} H14A0_FRC_MCTH1V03;

/*-----------------------------------------------------------------------------
	0x0338 dvi_mcth1v10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v10                        :24;	//  0:23
} H14A0_FRC_MCTH1V10;

/*-----------------------------------------------------------------------------
	0x033c dvi_mcth1v11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v11                        :24;	//  0:23
} H14A0_FRC_MCTH1V11;

/*-----------------------------------------------------------------------------
	0x0340 dvi_mcth1v12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v12                        :24;	//  0:23
} H14A0_FRC_MCTH1V12;

/*-----------------------------------------------------------------------------
	0x0344 dvi_mcth1v13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v13                        :24;	//  0:23
} H14A0_FRC_MCTH1V13;

/*-----------------------------------------------------------------------------
	0x0348 dvi_mcth1v20 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v20                        :24;	//  0:23
} H14A0_FRC_MCTH1V20;

/*-----------------------------------------------------------------------------
	0x034c dvi_mcth1v21 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v21                        :24;	//  0:23
} H14A0_FRC_MCTH1V21;

/*-----------------------------------------------------------------------------
	0x0350 dvi_mcth1v22 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v22                        :24;	//  0:23
} H14A0_FRC_MCTH1V22;

/*-----------------------------------------------------------------------------
	0x0354 dvi_mcth1v23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v23                        :24;	//  0:23
} H14A0_FRC_MCTH1V23;

/*-----------------------------------------------------------------------------
	0x0358 dvi_mcth1v30 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v30                        :24;	//  0:23
} H14A0_FRC_MCTH1V30;

/*-----------------------------------------------------------------------------
	0x035c dvi_mcth1v31 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v31                        :24;	//  0:23
} H14A0_FRC_MCTH1V31;

/*-----------------------------------------------------------------------------
	0x0360 dvi_mcth1v32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v32                        :24;	//  0:23
} H14A0_FRC_MCTH1V32;

/*-----------------------------------------------------------------------------
	0x0364 dvi_mcth1v33 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcth1v33                        :24;	//  0:23
} H14A0_FRC_MCTH1V33;

/*-----------------------------------------------------------------------------
	0x0368 dvi_apgcmdpri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	apgcmdpri_0                       : 4,	//  0: 3
	apgcmdpri_1                       : 4;	//  4: 7
} H14A0_FRC_APGCMDPRI;

/*-----------------------------------------------------------------------------
	0x036c dvi_totalde ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	totalde                         :11;	//  0:10
} H14A0_FRC_TOTALDE;

/*-----------------------------------------------------------------------------
	0x0370 dvi_totalpix ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	totalpix                        :11;	//  0:10
} H14A0_FRC_TOTALPIX;

/*-----------------------------------------------------------------------------
	0x0374 dvi_vernum ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0378 dvi_ch0osdon ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osdon_0                        : 1,	//     0
	ch0osdon_1                        : 1,	//     1
	ch0osdon_2                        : 1,	//     2
	ch0osdon_3                        : 1,	//     3
	ch0osdon_4                        : 1,	//     4
	ch0osdon_5                        : 1,	//     5
	ch0osdon_6                        : 1,	//     6
	ch0osdon_7                        : 1;	//     7
} H14A0_FRC_CH0OSDON;

/*-----------------------------------------------------------------------------
	0x037c dvi_ch0osd0top ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd0top                      :11;	//  0:10
} H14A0_FRC_CH0OSD0TOP;

/*-----------------------------------------------------------------------------
	0x0380 dvi_ch0osd0bot ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd0bot                      :11;	//  0:10
} H14A0_FRC_CH0OSD0BOT;

/*-----------------------------------------------------------------------------
	0x0384 dvi_ch0osd0left ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd0left                     :11;	//  0:10
} H14A0_FRC_CH0OSD0LEFT;

/*-----------------------------------------------------------------------------
	0x0388 dvi_ch0osd0right ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd0right                    :11;	//  0:10
} H14A0_FRC_CH0OSD0RIGHT;

/*-----------------------------------------------------------------------------
	0x038c dvi_ch0osd1top ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd1top                      :11;	//  0:10
} H14A0_FRC_CH0OSD1TOP;

/*-----------------------------------------------------------------------------
	0x0390 dvi_ch0osd1bot ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd1bot                      :11;	//  0:10
} H14A0_FRC_CH0OSD1BOT;

/*-----------------------------------------------------------------------------
	0x0394 dvi_ch0osd1left ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd1left                     :11;	//  0:10
} H14A0_FRC_CH0OSD1LEFT;

/*-----------------------------------------------------------------------------
	0x0398 dvi_ch0osd1right ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd1right                    :11;	//  0:10
} H14A0_FRC_CH0OSD1RIGHT;

/*-----------------------------------------------------------------------------
	0x039c dvi_ch0osd2top ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd2top                      :11;	//  0:10
} H14A0_FRC_CH0OSD2TOP;

/*-----------------------------------------------------------------------------
	0x03a0 dvi_ch0osd2bot ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd2bot                      :11;	//  0:10
} H14A0_FRC_CH0OSD2BOT;

/*-----------------------------------------------------------------------------
	0x03a4 dvi_ch0osd2left ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd2left                     :11;	//  0:10
} H14A0_FRC_CH0OSD2LEFT;

/*-----------------------------------------------------------------------------
	0x03a8 dvi_ch0osd2right ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd2right                    :11;	//  0:10
} H14A0_FRC_CH0OSD2RIGHT;

/*-----------------------------------------------------------------------------
	0x03ac dvi_ch0osd3top ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd3top                      :11;	//  0:10
} H14A0_FRC_CH0OSD3TOP;

/*-----------------------------------------------------------------------------
	0x03b0 dvi_ch0osd3bot ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd3bot                      :11;	//  0:10
} H14A0_FRC_CH0OSD3BOT;

/*-----------------------------------------------------------------------------
	0x03b4 dvi_ch0osd3left ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd3left                     :11;	//  0:10
} H14A0_FRC_CH0OSD3LEFT;

/*-----------------------------------------------------------------------------
	0x03b8 dvi_ch0osd3right ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0osd3right                    :11;	//  0:10
} H14A0_FRC_CH0OSD3RIGHT;

/*-----------------------------------------------------------------------------
	0x03bc dvi_ch1osdon ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osdon_0                        : 1,	//     0
	ch1osdon_1                        : 1,	//     1
	ch1osdon_2                        : 1,	//     2
	ch1osdon_3                        : 1,	//     3
	ch1osdon_4                        : 4;	//  4: 7
} H14A0_FRC_CH1OSDON;

/*-----------------------------------------------------------------------------
	0x03c0 dvi_ch1osd0top ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd0top                      :11;	//  0:10
} H14A0_FRC_CH1OSD0TOP;

/*-----------------------------------------------------------------------------
	0x03c4 dvi_ch1osd0bot ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd0bot                      :11;	//  0:10
} H14A0_FRC_CH1OSD0BOT;

/*-----------------------------------------------------------------------------
	0x03c8 dvi_ch1osd0left ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd0left                     :11;	//  0:10
} H14A0_FRC_CH1OSD0LEFT;

/*-----------------------------------------------------------------------------
	0x03cc dvi_ch1osd0right ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd0right                    :11;	//  0:10
} H14A0_FRC_CH1OSD0RIGHT;

/*-----------------------------------------------------------------------------
	0x03d0 dvi_ch1osd1top ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd1top                      :11;	//  0:10
} H14A0_FRC_CH1OSD1TOP;

/*-----------------------------------------------------------------------------
	0x03d4 dvi_ch1osd1bot ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd1bot                      :11;	//  0:10
} H14A0_FRC_CH1OSD1BOT;

/*-----------------------------------------------------------------------------
	0x03d8 dvi_ch1osd1left ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd1left                     :11;	//  0:10
} H14A0_FRC_CH1OSD1LEFT;

/*-----------------------------------------------------------------------------
	0x03dc dvi_ch1osd1right ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd1right                    :11;	//  0:10
} H14A0_FRC_CH1OSD1RIGHT;

/*-----------------------------------------------------------------------------
	0x03e0 dvi_ch1osd2top ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd2top                      :11;	//  0:10
} H14A0_FRC_CH1OSD2TOP;

/*-----------------------------------------------------------------------------
	0x03e4 dvi_ch1osd2bot ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd2bot                      :11;	//  0:10
} H14A0_FRC_CH1OSD2BOT;

/*-----------------------------------------------------------------------------
	0x03e8 dvi_ch1osd2left ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd2left                     :11;	//  0:10
} H14A0_FRC_CH1OSD2LEFT;

/*-----------------------------------------------------------------------------
	0x03ec dvi_ch1osd2right ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd2right                    :11;	//  0:10
} H14A0_FRC_CH1OSD2RIGHT;

/*-----------------------------------------------------------------------------
	0x03f0 dvi_ch1osd3top ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd3top                      :11;	//  0:10
} H14A0_FRC_CH1OSD3TOP;

/*-----------------------------------------------------------------------------
	0x03f4 dvi_ch1osd3bot ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd3bot                      :11;	//  0:10
} H14A0_FRC_CH1OSD3BOT;

/*-----------------------------------------------------------------------------
	0x03f8 dvi_ch1osd3left ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd3left                     :11;	//  0:10
} H14A0_FRC_CH1OSD3LEFT;

/*-----------------------------------------------------------------------------
	0x03fc dvi_ch1osd3right ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1osd3right                    :11;	//  0:10
} H14A0_FRC_CH1OSD3RIGHT;

/*-----------------------------------------------------------------------------
	0x0400 dvi_ask_tocnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ask_tocnt                       :10;	//  0: 9
} H14A0_FRC_ASK_TOCNT;

/*-----------------------------------------------------------------------------
	0x0404 dvi_num_hdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	num_hdata                       :11;	//  0:10
} H14A0_FRC_NUM_HDATA;

/*-----------------------------------------------------------------------------
	0x0408 dvi_num_vdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	num_vdata                       :11;	//  0:10
} H14A0_FRC_NUM_VDATA;

/*-----------------------------------------------------------------------------
	0x040c dvi_iintenable ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iintenable                      : 1;	//     0
} H14A0_FRC_IINTENABLE;

/*-----------------------------------------------------------------------------
	0x0410 dvi_iintclear ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iintclear_0                       : 1,	//     0
	iintclear_1                       : 1;	//     1
} H14A0_FRC_IINTCLEAR;

/*-----------------------------------------------------------------------------
	0x0414 dvi_iintstat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iintstat_0                        : 1,	//     0
	iintstat_1                        : 1;	//     1
} IH14A0_FRC_INTSTAT;

/*-----------------------------------------------------------------------------
	0x0418 dvi_dbg_line_cnt0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	dbg_line_cnt0                   :26;	//  1:26
} H14A0_FRC_DBG_LINE_CNT0;

/*-----------------------------------------------------------------------------
	0x041c dvi_dbg_line_cnt1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	dbg_line_cnt1                   :26;	//  1:26
} H14A0_FRC_DBG_LINE_CNT1;

/*-----------------------------------------------------------------------------
	0x0420 dvi_buffer_full_cond ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	buffer_full_cond                : 2;	//  0: 1
} H14A0_FRC_BUFFER_FULL_COND;

/*-----------------------------------------------------------------------------
	0x0424 dvi_dvi_askcmddly ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dvi_askcmddly                   : 4;	//  0: 3
} H14A0_FRC_DVI_ASKCMDDLY;

/*-----------------------------------------------------------------------------
	0x0428 dvi_hfiltcoef01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hfiltcoef01_0                     : 7,	//  0: 6
	hfiltcoef01_1                     : 7;	//  7:13
} H14A0_FRC_HFILTCOEF01;

/*-----------------------------------------------------------------------------
	0x042c dvi_hfiltcoef23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hfiltcoef23_0                     : 7,	//  0: 6
	hfiltcoef23_1                     : 7;	//  7:13
} H14A0_FRC_HFILTCOEF23;

/*-----------------------------------------------------------------------------
	0x0430 dvi_hfiltcoef45 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hfiltcoef45_0                     : 7,	//  0: 6
	hfiltcoef45_1                     : 7;	//  7:13
} H14A0_FRC_HFILTCOEF45;

/*-----------------------------------------------------------------------------
	0x0434 dvi_hfiltcoef67 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hfiltcoef67_0                     : 7,	//  0: 6
	hfiltcoef67_1                     : 7;	//  7:13
} H14A0_FRC_HFILTCOEF67;

/*-----------------------------------------------------------------------------
	0x0438 dvi_states0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x043c dvi_states1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0440 dvi_y_offset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_offset                        :11;	//  0:10
} H14A0_FRC_Y_OFFSET;

/*-----------------------------------------------------------------------------
	0x0444 dvi_u_offset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	u_offset                        :11;	//  0:10
} H14A0_FRC_U_OFFSET;

/*-----------------------------------------------------------------------------
	0x0448 dvi_v_offset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_offset                        :11;	//  0:10
} H14A0_FRC_V_OFFSET;

/*-----------------------------------------------------------------------------
	0x044c dvi_y2rcoef11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef11                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF11;

/*-----------------------------------------------------------------------------
	0x0450 dvi_y2rcoef12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef12                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF12;

/*-----------------------------------------------------------------------------
	0x0454 dvi_y2rcoef13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef13                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF13;

/*-----------------------------------------------------------------------------
	0x0458 dvi_y2rcoef21 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef21                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF21;

/*-----------------------------------------------------------------------------
	0x045c dvi_y2rcoef22 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef22                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF22;

/*-----------------------------------------------------------------------------
	0x0460 dvi_y2rcoef23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef23                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF23;

/*-----------------------------------------------------------------------------
	0x0464 dvi_y2rcoef31 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef31                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF31;

/*-----------------------------------------------------------------------------
	0x0468 dvi_y2rcoef32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef32                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF32;

/*-----------------------------------------------------------------------------
	0x046c dvi_y2rcoef33 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2rcoef33                       :12;	//  0:11
} H14A0_FRC_Y2RCOEF33;

/*-----------------------------------------------------------------------------
	0x0470 dvi_filtcoef_h_lev1_1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0474 dvi_filtcoef_h_lev1_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filtcoef_h_lev1_2               :16;	//  0:15
} H14A0_FRC_FILTCOEF_H_LEV1_2;

/*-----------------------------------------------------------------------------
	0x0478 dvi_filtcoef_h_lev2_1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x047c dvi_filtcoef_h_lev2_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filtcoef_h_lev2_2               :16;	//  0:15
} H14A0_FRC_FILTCOEF_H_LEV2_2;

/*-----------------------------------------------------------------------------
	0x0480 dvi_filtcoef_h_lev3_1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0484 dvi_filtcoef_h_lev3_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filtcoef_h_lev3_2               :16;	//  0:15
} H14A0_FRC_FILTCOEF_H_LEV3_2;

/*-----------------------------------------------------------------------------
	0x0488 dvi_filtcoef_v_lev1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x048c dvi_filtcoef_v_lev2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0490 dvi_filtcoef_v_lev3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0494 dvi_apgcmdpri_s ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	apgcmdpri_s_0                     : 4,	//  0: 3
	apgcmdpri_s_1                     : 4;	//  4: 7
} H14A0_FRC_APGCMDPRI_S;

/*-----------------------------------------------------------------------------
	0x0498 dvi_apgcmdpri_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	apgcmdpri_r_0                     : 4,	//  0: 3
	apgcmdpri_r_1                     : 4;	//  4: 7
} H14A0_FRC_APGCMDPRI_R;

/*-----------------------------------------------------------------------------
	0x049c dvi_mcadrh_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mcadrh_rd                       :19;	//  0:18
} H14A0_FRC_MCADRH_RD;

/*-----------------------------------------------------------------------------
	0x04a0 dvi_sad_startline ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_startline                   :11;	//  0:10
} H14A0_FRC_SAD_STARTLINE;

/*-----------------------------------------------------------------------------
	0x04a4 dvi_sad_endline ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_endline                     :11;	//  0:10
} H14A0_FRC_SAD_ENDLINE;

/*-----------------------------------------------------------------------------
	0x04a8 dvi_sad_thsad ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_thsad                       :16;	//  0:15
} H14A0_FRC_SAD_THSAD;

/*-----------------------------------------------------------------------------
	0x04ac dvi_sad_pg_sum0_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_sum0_even                :28;	//  0:27
} H14A0_FRC_SAD_PG_SUM0_EVEN;

/*-----------------------------------------------------------------------------
	0x04b0 dvi_sad_pg_sum1_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_sum1_even                :28;	//  0:27
} H14A0_FRC_SAD_PG_SUM1_EVEN;

/*-----------------------------------------------------------------------------
	0x04b4 dvi_sad_pg_sum2_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_sum2_even                :28;	//  0:27
} H14A0_FRC_SAD_PG_SUM2_EVEN;

/*-----------------------------------------------------------------------------
	0x04b8 dvi_sad_pg_sum0_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_sum0_odd                 :28;	//  0:27
} H14A0_FRC_SAD_PG_SUM0_ODD;

/*-----------------------------------------------------------------------------
	0x04bc dvi_sad_pg_sum1_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_sum1_odd                 :28;	//  0:27
} H14A0_FRC_SAD_PG_SUM1_ODD;

/*-----------------------------------------------------------------------------
	0x04c0 dvi_sad_pg_sum2_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_sum2_odd                 :28;	//  0:27
} H14A0_FRC_SAD_PG_SUM2_ODD;

/*-----------------------------------------------------------------------------
	0x04c4 dvi_sad_cg_sum0_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_sum0_even                :28;	//  0:27
} H14A0_FRC_SAD_CG_SUM0_EVEN;

/*-----------------------------------------------------------------------------
	0x04c8 dvi_sad_cg_sum1_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_sum1_even                :28;	//  0:27
} H14A0_FRC_SAD_CG_SUM1_EVEN;

/*-----------------------------------------------------------------------------
	0x04cc dvi_sad_cg_sum2_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_sum2_even                :28;	//  0:27
} H14A0_FRC_SAD_CG_SUM2_EVEN;

/*-----------------------------------------------------------------------------
	0x04d0 dvi_sad_cg_sum0_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_sum0_odd                 :28;	//  0:27
} H14A0_FRC_SAD_CG_SUM0_ODD;

/*-----------------------------------------------------------------------------
	0x04d4 dvi_sad_cg_sum1_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_sum1_odd                 :28;	//  0:27
} H14A0_FRC_SAD_CG_SUM1_ODD;

/*-----------------------------------------------------------------------------
	0x04d8 dvi_sad_cg_sum2_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_sum2_odd                 :28;	//  0:27
} H14A0_FRC_SAD_CG_SUM2_ODD;

/*-----------------------------------------------------------------------------
	0x04dc dvi_sad_pg_cnt0_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_cnt0_even                :20;	//  0:19
} H14A0_FRC_SAD_PG_CNT0_EVEN;

/*-----------------------------------------------------------------------------
	0x04e0 dvi_sad_pg_cnt1_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_cnt1_even                :20;	//  0:19
} H14A0_FRC_SAD_PG_CNT1_EVEN;

/*-----------------------------------------------------------------------------
	0x04e4 dvi_sad_pg_cnt2_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_cnt2_even                :20;	//  0:19
} H14A0_FRC_SAD_PG_CNT2_EVEN;

/*-----------------------------------------------------------------------------
	0x04e8 dvi_sad_pg_cnt0_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_cnt0_odd                 :20;	//  0:19
} H14A0_FRC_SAD_PG_CNT0_ODD;

/*-----------------------------------------------------------------------------
	0x04ec dvi_sad_pg_cnt1_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_cnt1_odd                 :20;	//  0:19
} H14A0_FRC_SAD_PG_CNT1_ODD;

/*-----------------------------------------------------------------------------
	0x04f0 dvi_sad_pg_cnt2_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pg_cnt2_odd                 :20;	//  0:19
} H14A0_FRC_SAD_PG_CNT2_ODD;

/*-----------------------------------------------------------------------------
	0x04f4 dvi_sad_cg_cnt0_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_cnt0_even                :20;	//  0:19
} H14A0_FRC_SAD_CG_CNT0_EVEN;

/*-----------------------------------------------------------------------------
	0x04f8 dvi_sad_cg_cnt1_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_cnt1_even                :20;	//  0:19
} H14A0_FRC_SAD_CG_CNT1_EVEN;

/*-----------------------------------------------------------------------------
	0x04fc dvi_sad_cg_cnt2_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_cnt2_even                :20;	//  0:19
} H14A0_FRC_SAD_CG_CNT2_EVEN;

/*-----------------------------------------------------------------------------
	0x0500 dvi_sad_cg_cnt0_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_cnt0_odd                 :20;	//  0:19
} H14A0_FRC_SAD_CG_CNT0_ODD;

/*-----------------------------------------------------------------------------
	0x0504 dvi_sad_cg_cnt1_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_cnt1_odd                 :20;	//  0:19
} H14A0_FRC_SAD_CG_CNT1_ODD;

/*-----------------------------------------------------------------------------
	0x0508 dvi_sad_cg_cnt2_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cg_cnt2_odd                 :20;	//  0:19
} H14A0_FRC_SAD_CG_CNT2_ODD;

/*-----------------------------------------------------------------------------
	0x050c dvi_sad_pl_sum0_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_sum0_even                :28;	//  0:27
} H14A0_FRC_SAD_PL_SUM0_EVEN;

/*-----------------------------------------------------------------------------
	0x0510 dvi_sad_pl_sum1_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_sum1_even                :28;	//  0:27
} H14A0_FRC_SAD_PL_SUM1_EVEN;

/*-----------------------------------------------------------------------------
	0x0514 dvi_sad_pl_sum2_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_sum2_even                :28;	//  0:27
} H14A0_FRC_SAD_PL_SUM2_EVEN;

/*-----------------------------------------------------------------------------
	0x0518 dvi_sad_pl_sum0_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_sum0_odd                 :28;	//  0:27
} H14A0_FRC_SAD_PL_SUM0_ODD;

/*-----------------------------------------------------------------------------
	0x051c dvi_sad_pl_sum1_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_sum1_odd                 :28;	//  0:27
} H14A0_FRC_SAD_PL_SUM1_ODD;

/*-----------------------------------------------------------------------------
	0x0520 dvi_sad_pl_sum2_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_sum2_odd                 :28;	//  0:27
} H14A0_FRC_SAD_PL_SUM2_ODD;

/*-----------------------------------------------------------------------------
	0x0524 dvi_sad_cl_sum0_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_sum0_even                :28;	//  0:27
} H14A0_FRC_SAD_CL_SUM0_EVEN;

/*-----------------------------------------------------------------------------
	0x0528 dvi_sad_cl_sum1_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_sum1_even                :28;	//  0:27
} H14A0_FRC_SAD_CL_SUM1_EVEN;

/*-----------------------------------------------------------------------------
	0x052c dvi_sad_cl_sum2_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_sum2_even                :28;	//  0:27
} H14A0_FRC_SAD_CL_SUM2_EVEN;

/*-----------------------------------------------------------------------------
	0x0530 dvi_sad_cl_sum0_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_sum0_odd                 :28;	//  0:27
} H14A0_FRC_SAD_CL_SUM0_ODD;

/*-----------------------------------------------------------------------------
	0x0534 dvi_sad_cl_sum1_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_sum1_odd                 :28;	//  0:27
} H14A0_FRC_SAD_CL_SUM1_ODD;

/*-----------------------------------------------------------------------------
	0x0538 dvi_sad_cl_sum2_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_sum2_odd                 :28;	//  0:27
} H14A0_FRC_SAD_CL_SUM2_ODD;

/*-----------------------------------------------------------------------------
	0x053c dvi_sad_pl_cnt0_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_cnt0_even                :20;	//  0:19
} H14A0_FRC_SAD_PL_CNT0_EVEN;

/*-----------------------------------------------------------------------------
	0x0540 dvi_sad_pl_cnt1_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_cnt1_even                :20;	//  0:19
} H14A0_FRC_SAD_PL_CNT1_EVEN;

/*-----------------------------------------------------------------------------
	0x0544 dvi_sad_pl_cnt2_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_cnt2_even                :20;	//  0:19
} H14A0_FRC_SAD_PL_CNT2_EVEN;

/*-----------------------------------------------------------------------------
	0x0548 dvi_sad_pl_cnt0_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_cnt0_odd                 :20;	//  0:19
} H14A0_FRC_SAD_PL_CNT0_ODD;

/*-----------------------------------------------------------------------------
	0x054c dvi_sad_pl_cnt1_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_cnt1_odd                 :20;	//  0:19
} H14A0_FRC_SAD_PL_CNT1_ODD;

/*-----------------------------------------------------------------------------
	0x0550 dvi_sad_pl_cnt2_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_pl_cnt2_odd                 :20;	//  0:19
} H14A0_FRC_SAD_PL_CNT2_ODD;

/*-----------------------------------------------------------------------------
	0x0554 dvi_sad_cl_cnt0_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_cnt0_even                :20;	//  0:19
} H14A0_FRC_SAD_CL_CNT0_EVEN;

/*-----------------------------------------------------------------------------
	0x0558 dvi_sad_cl_cnt1_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_cnt1_even                :20;	//  0:19
} H14A0_FRC_SAD_CL_CNT1_EVEN;

/*-----------------------------------------------------------------------------
	0x055c dvi_sad_cl_cnt2_even ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_cnt2_even                :20;	//  0:19
} H14A0_FRC_SAD_CL_CNT2_EVEN;

/*-----------------------------------------------------------------------------
	0x0560 dvi_sad_cl_cnt0_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_cnt0_odd                 :20;	//  0:19
} H14A0_FRC_SAD_CL_CNT0_ODD;

/*-----------------------------------------------------------------------------
	0x0564 dvi_sad_cl_cnt1_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_cnt1_odd                 :20;	//  0:19
} H14A0_FRC_SAD_CL_CNT1_ODD;

/*-----------------------------------------------------------------------------
	0x0568 dvi_sad_cl_cnt2_odd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cl_cnt2_odd                 :20;	//  0:19
} H14A0_FRC_SAD_CL_CNT2_ODD;

/*-----------------------------------------------------------------------------
	0x056c dvi_sad_ps_sum0_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_0              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_0;

/*-----------------------------------------------------------------------------
	0x0570 dvi_sad_ps_sum1_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_0              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_0;

/*-----------------------------------------------------------------------------
	0x0574 dvi_sad_ps_sum2_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_0              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_0;

/*-----------------------------------------------------------------------------
	0x0578 dvi_sad_ps_sum0_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_0               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_0;

/*-----------------------------------------------------------------------------
	0x057c dvi_sad_ps_sum1_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_0               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_0;

/*-----------------------------------------------------------------------------
	0x0580 dvi_sad_ps_sum2_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_0               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_0;

/*-----------------------------------------------------------------------------
	0x0584 dvi_sad_cs_sum0_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_0              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_0;

/*-----------------------------------------------------------------------------
	0x0588 dvi_sad_cs_sum1_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_0              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_0;

/*-----------------------------------------------------------------------------
	0x058c dvi_sad_cs_sum2_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_0              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_0;

/*-----------------------------------------------------------------------------
	0x0590 dvi_sad_cs_sum0_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_0               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_0;

/*-----------------------------------------------------------------------------
	0x0594 dvi_sad_cs_sum1_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_0               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_0;

/*-----------------------------------------------------------------------------
	0x0598 dvi_sad_cs_sum2_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_0               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_0;

/*-----------------------------------------------------------------------------
	0x059c dvi_sad_ps_cnt0_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_0              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_0;

/*-----------------------------------------------------------------------------
	0x05a0 dvi_sad_ps_cnt1_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_0              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_0;

/*-----------------------------------------------------------------------------
	0x05a4 dvi_sad_ps_cnt2_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_0              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_0;

/*-----------------------------------------------------------------------------
	0x05a8 dvi_sad_ps_cnt0_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_0               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_0;

/*-----------------------------------------------------------------------------
	0x05ac dvi_sad_ps_cnt1_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_0               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_0;

/*-----------------------------------------------------------------------------
	0x05b0 dvi_sad_ps_cnt2_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_0               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_0;

/*-----------------------------------------------------------------------------
	0x05b4 dvi_sad_cs_cnt0_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_0              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_0;

/*-----------------------------------------------------------------------------
	0x05b8 dvi_sad_cs_cnt1_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_0              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_0;

/*-----------------------------------------------------------------------------
	0x05bc dvi_sad_cs_cnt2_even_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_0              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_0;

/*-----------------------------------------------------------------------------
	0x05c0 dvi_sad_cs_cnt0_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_0               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_0;

/*-----------------------------------------------------------------------------
	0x05c4 dvi_sad_cs_cnt1_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_0               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_0;

/*-----------------------------------------------------------------------------
	0x05c8 dvi_sad_cs_cnt2_odd_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_0               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_0;

/*-----------------------------------------------------------------------------
	0x05cc dvi_sad_ps_sum0_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_1              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_1;

/*-----------------------------------------------------------------------------
	0x05d0 dvi_sad_ps_sum1_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_1              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_1;

/*-----------------------------------------------------------------------------
	0x05d4 dvi_sad_ps_sum2_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_1              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_1;

/*-----------------------------------------------------------------------------
	0x05d8 dvi_sad_ps_sum0_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_1               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_1;

/*-----------------------------------------------------------------------------
	0x05dc dvi_sad_ps_sum1_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_1               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_1;

/*-----------------------------------------------------------------------------
	0x05e0 dvi_sad_ps_sum2_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_1               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_1;

/*-----------------------------------------------------------------------------
	0x05e4 dvi_sad_cs_sum0_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_1              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_1;

/*-----------------------------------------------------------------------------
	0x05e8 dvi_sad_cs_sum1_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_1              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_1;

/*-----------------------------------------------------------------------------
	0x05ec dvi_sad_cs_sum2_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_1              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_1;

/*-----------------------------------------------------------------------------
	0x05f0 dvi_sad_cs_sum0_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_1               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_1;

/*-----------------------------------------------------------------------------
	0x05f4 dvi_sad_cs_sum1_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_1               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_1;

/*-----------------------------------------------------------------------------
	0x05f8 dvi_sad_cs_sum2_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_1               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_1;

/*-----------------------------------------------------------------------------
	0x05fc dvi_sad_ps_cnt0_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_1              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_1;

/*-----------------------------------------------------------------------------
	0x0600 dvi_sad_ps_cnt1_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_1              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_1;

/*-----------------------------------------------------------------------------
	0x0604 dvi_sad_ps_cnt2_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_1              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_1;

/*-----------------------------------------------------------------------------
	0x0608 dvi_sad_ps_cnt0_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_1               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_1;

/*-----------------------------------------------------------------------------
	0x060c dvi_sad_ps_cnt1_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_1               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_1;

/*-----------------------------------------------------------------------------
	0x0610 dvi_sad_ps_cnt2_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_1               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_1;

/*-----------------------------------------------------------------------------
	0x0614 dvi_sad_cs_cnt0_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_1              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_1;

/*-----------------------------------------------------------------------------
	0x0618 dvi_sad_cs_cnt1_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_1              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_1;

/*-----------------------------------------------------------------------------
	0x061c dvi_sad_cs_cnt2_even_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_1              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_1;

/*-----------------------------------------------------------------------------
	0x0620 dvi_sad_cs_cnt0_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_1               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_1;

/*-----------------------------------------------------------------------------
	0x0624 dvi_sad_cs_cnt1_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_1               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_1;

/*-----------------------------------------------------------------------------
	0x0628 dvi_sad_cs_cnt2_odd_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_1               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_1;

/*-----------------------------------------------------------------------------
	0x062c dvi_sad_ps_sum0_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_2              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0630 dvi_sad_ps_sum1_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_2              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0634 dvi_sad_ps_sum2_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_2              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0638 dvi_sad_ps_sum0_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_2               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_2;

/*-----------------------------------------------------------------------------
	0x063c dvi_sad_ps_sum1_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_2               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_2;

/*-----------------------------------------------------------------------------
	0x0640 dvi_sad_ps_sum2_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_2               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_2;

/*-----------------------------------------------------------------------------
	0x0644 dvi_sad_cs_sum0_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_2              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0648 dvi_sad_cs_sum1_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_2              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_2;

/*-----------------------------------------------------------------------------
	0x064c dvi_sad_cs_sum2_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_2              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0650 dvi_sad_cs_sum0_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_2               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_2;

/*-----------------------------------------------------------------------------
	0x0654 dvi_sad_cs_sum1_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_2               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_2;

/*-----------------------------------------------------------------------------
	0x0658 dvi_sad_cs_sum2_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_2               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_2;

/*-----------------------------------------------------------------------------
	0x065c dvi_sad_ps_cnt0_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_2              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0660 dvi_sad_ps_cnt1_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_2              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0664 dvi_sad_ps_cnt2_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_2              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0668 dvi_sad_ps_cnt0_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_2               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_2;

/*-----------------------------------------------------------------------------
	0x066c dvi_sad_ps_cnt1_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_2               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_2;

/*-----------------------------------------------------------------------------
	0x0670 dvi_sad_ps_cnt2_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_2               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_2;

/*-----------------------------------------------------------------------------
	0x0674 dvi_sad_cs_cnt0_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_2              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0678 dvi_sad_cs_cnt1_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_2              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_2;

/*-----------------------------------------------------------------------------
	0x067c dvi_sad_cs_cnt2_even_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_2              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_2;

/*-----------------------------------------------------------------------------
	0x0680 dvi_sad_cs_cnt0_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_2               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_2;

/*-----------------------------------------------------------------------------
	0x0684 dvi_sad_cs_cnt1_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_2               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_2;

/*-----------------------------------------------------------------------------
	0x0688 dvi_sad_cs_cnt2_odd_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_2               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_2;

/*-----------------------------------------------------------------------------
	0x068c dvi_sad_ps_sum0_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_3              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_3;

/*-----------------------------------------------------------------------------
	0x0690 dvi_sad_ps_sum1_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_3              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_3;

/*-----------------------------------------------------------------------------
	0x0694 dvi_sad_ps_sum2_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_3              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_3;

/*-----------------------------------------------------------------------------
	0x0698 dvi_sad_ps_sum0_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_3               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_3;

/*-----------------------------------------------------------------------------
	0x069c dvi_sad_ps_sum1_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_3               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_3;

/*-----------------------------------------------------------------------------
	0x06a0 dvi_sad_ps_sum2_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_3               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_3;

/*-----------------------------------------------------------------------------
	0x06a4 dvi_sad_cs_sum0_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_3              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06a8 dvi_sad_cs_sum1_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_3              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06ac dvi_sad_cs_sum2_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_3              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06b0 dvi_sad_cs_sum0_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_3               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_3;

/*-----------------------------------------------------------------------------
	0x06b4 dvi_sad_cs_sum1_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_3               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_3;

/*-----------------------------------------------------------------------------
	0x06b8 dvi_sad_cs_sum2_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_3               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_3;

/*-----------------------------------------------------------------------------
	0x06bc dvi_sad_ps_cnt0_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_3              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06c0 dvi_sad_ps_cnt1_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_3              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06c4 dvi_sad_ps_cnt2_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_3              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06c8 dvi_sad_ps_cnt0_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_3               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_3;

/*-----------------------------------------------------------------------------
	0x06cc dvi_sad_ps_cnt1_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_3               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_3;

/*-----------------------------------------------------------------------------
	0x06d0 dvi_sad_ps_cnt2_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_3               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_3;

/*-----------------------------------------------------------------------------
	0x06d4 dvi_sad_cs_cnt0_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_3              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06d8 dvi_sad_cs_cnt1_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_3              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06dc dvi_sad_cs_cnt2_even_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_3              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_3;

/*-----------------------------------------------------------------------------
	0x06e0 dvi_sad_cs_cnt0_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_3               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_3;

/*-----------------------------------------------------------------------------
	0x06e4 dvi_sad_cs_cnt1_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_3               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_3;

/*-----------------------------------------------------------------------------
	0x06e8 dvi_sad_cs_cnt2_odd_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_3               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_3;

/*-----------------------------------------------------------------------------
	0x06ec dvi_sad_ps_sum0_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_4              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_4;

/*-----------------------------------------------------------------------------
	0x06f0 dvi_sad_ps_sum1_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_4              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_4;

/*-----------------------------------------------------------------------------
	0x06f4 dvi_sad_ps_sum2_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_4              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_4;

/*-----------------------------------------------------------------------------
	0x06f8 dvi_sad_ps_sum0_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_4               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_4;

/*-----------------------------------------------------------------------------
	0x06fc dvi_sad_ps_sum1_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_4               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_4;

/*-----------------------------------------------------------------------------
	0x0700 dvi_sad_ps_sum2_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_4               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_4;

/*-----------------------------------------------------------------------------
	0x0704 dvi_sad_cs_sum0_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_4              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_4;

/*-----------------------------------------------------------------------------
	0x0708 dvi_sad_cs_sum1_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_4              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_4;

/*-----------------------------------------------------------------------------
	0x070c dvi_sad_cs_sum2_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_4              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_4;

/*-----------------------------------------------------------------------------
	0x0710 dvi_sad_cs_sum0_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_4               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_4;

/*-----------------------------------------------------------------------------
	0x0714 dvi_sad_cs_sum1_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_4               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_4;

/*-----------------------------------------------------------------------------
	0x0718 dvi_sad_cs_sum2_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_4               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_4;

/*-----------------------------------------------------------------------------
	0x071c dvi_sad_ps_cnt0_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_4              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_4;

/*-----------------------------------------------------------------------------
	0x0720 dvi_sad_ps_cnt1_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_4              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_4;

/*-----------------------------------------------------------------------------
	0x0724 dvi_sad_ps_cnt2_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_4              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_4;

/*-----------------------------------------------------------------------------
	0x0728 dvi_sad_ps_cnt0_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_4               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_4;

/*-----------------------------------------------------------------------------
	0x072c dvi_sad_ps_cnt1_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_4               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_4;

/*-----------------------------------------------------------------------------
	0x0730 dvi_sad_ps_cnt2_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_4               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_4;

/*-----------------------------------------------------------------------------
	0x0734 dvi_sad_cs_cnt0_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_4              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_4;

/*-----------------------------------------------------------------------------
	0x0738 dvi_sad_cs_cnt1_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_4              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_4;

/*-----------------------------------------------------------------------------
	0x073c dvi_sad_cs_cnt2_even_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_4              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_4;

/*-----------------------------------------------------------------------------
	0x0740 dvi_sad_cs_cnt0_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_4               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_4;

/*-----------------------------------------------------------------------------
	0x0744 dvi_sad_cs_cnt1_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_4               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_4;

/*-----------------------------------------------------------------------------
	0x0748 dvi_sad_cs_cnt2_odd_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_4               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_4;

/*-----------------------------------------------------------------------------
	0x074c dvi_sad_ps_sum0_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_5              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0750 dvi_sad_ps_sum1_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_5              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0754 dvi_sad_ps_sum2_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_5              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0758 dvi_sad_ps_sum0_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_5               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_5;

/*-----------------------------------------------------------------------------
	0x075c dvi_sad_ps_sum1_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_5               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_5;

/*-----------------------------------------------------------------------------
	0x0760 dvi_sad_ps_sum2_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_5               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_5;

/*-----------------------------------------------------------------------------
	0x0764 dvi_sad_cs_sum0_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_5              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0768 dvi_sad_cs_sum1_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_5              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_5;

/*-----------------------------------------------------------------------------
	0x076c dvi_sad_cs_sum2_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_5              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0770 dvi_sad_cs_sum0_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_5               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_5;

/*-----------------------------------------------------------------------------
	0x0774 dvi_sad_cs_sum1_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_5               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_5;

/*-----------------------------------------------------------------------------
	0x0778 dvi_sad_cs_sum2_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_5               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_5;

/*-----------------------------------------------------------------------------
	0x077c dvi_sad_ps_cnt0_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_5              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0780 dvi_sad_ps_cnt1_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_5              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0784 dvi_sad_ps_cnt2_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_5              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0788 dvi_sad_ps_cnt0_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_5               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_5;

/*-----------------------------------------------------------------------------
	0x078c dvi_sad_ps_cnt1_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_5               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_5;

/*-----------------------------------------------------------------------------
	0x0790 dvi_sad_ps_cnt2_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_5               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_5;

/*-----------------------------------------------------------------------------
	0x0794 dvi_sad_cs_cnt0_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_5              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_5;

/*-----------------------------------------------------------------------------
	0x0798 dvi_sad_cs_cnt1_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_5              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_5;

/*-----------------------------------------------------------------------------
	0x079c dvi_sad_cs_cnt2_even_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_5              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_5;

/*-----------------------------------------------------------------------------
	0x07a0 dvi_sad_cs_cnt0_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_5               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_5;

/*-----------------------------------------------------------------------------
	0x07a4 dvi_sad_cs_cnt1_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_5               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_5;

/*-----------------------------------------------------------------------------
	0x07a8 dvi_sad_cs_cnt2_odd_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_5               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_5;

/*-----------------------------------------------------------------------------
	0x07ac dvi_sad_ps_sum0_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_6              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07b0 dvi_sad_ps_sum1_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_6              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07b4 dvi_sad_ps_sum2_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_6              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07b8 dvi_sad_ps_sum0_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_6               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_6;

/*-----------------------------------------------------------------------------
	0x07bc dvi_sad_ps_sum1_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_6               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_6;

/*-----------------------------------------------------------------------------
	0x07c0 dvi_sad_ps_sum2_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_6               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_6;

/*-----------------------------------------------------------------------------
	0x07c4 dvi_sad_cs_sum0_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_6              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07c8 dvi_sad_cs_sum1_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_6              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07cc dvi_sad_cs_sum2_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_6              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07d0 dvi_sad_cs_sum0_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_6               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_6;

/*-----------------------------------------------------------------------------
	0x07d4 dvi_sad_cs_sum1_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_6               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_6;

/*-----------------------------------------------------------------------------
	0x07d8 dvi_sad_cs_sum2_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_6               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_6;

/*-----------------------------------------------------------------------------
	0x07dc dvi_sad_ps_cnt0_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_6              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07e0 dvi_sad_ps_cnt1_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_6              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07e4 dvi_sad_ps_cnt2_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_6              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07e8 dvi_sad_ps_cnt0_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_6               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_6;

/*-----------------------------------------------------------------------------
	0x07ec dvi_sad_ps_cnt1_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_6               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_6;

/*-----------------------------------------------------------------------------
	0x07f0 dvi_sad_ps_cnt2_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_6               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_6;

/*-----------------------------------------------------------------------------
	0x07f4 dvi_sad_cs_cnt0_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_6              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07f8 dvi_sad_cs_cnt1_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_6              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_6;

/*-----------------------------------------------------------------------------
	0x07fc dvi_sad_cs_cnt2_even_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_6              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_6;

/*-----------------------------------------------------------------------------
	0x0800 dvi_sad_cs_cnt0_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_6               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_6;

/*-----------------------------------------------------------------------------
	0x0804 dvi_sad_cs_cnt1_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_6               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_6;

/*-----------------------------------------------------------------------------
	0x0808 dvi_sad_cs_cnt2_odd_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_6               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_6;

/*-----------------------------------------------------------------------------
	0x080c dvi_sad_ps_sum0_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_7              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0810 dvi_sad_ps_sum1_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_7              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0814 dvi_sad_ps_sum2_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_7              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0818 dvi_sad_ps_sum0_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_7               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_7;

/*-----------------------------------------------------------------------------
	0x081c dvi_sad_ps_sum1_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_7               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_7;

/*-----------------------------------------------------------------------------
	0x0820 dvi_sad_ps_sum2_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_7               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_7;

/*-----------------------------------------------------------------------------
	0x0824 dvi_sad_cs_sum0_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_7              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0828 dvi_sad_cs_sum1_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_7              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_7;

/*-----------------------------------------------------------------------------
	0x082c dvi_sad_cs_sum2_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_7              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0830 dvi_sad_cs_sum0_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_7               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_7;

/*-----------------------------------------------------------------------------
	0x0834 dvi_sad_cs_sum1_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_7               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_7;

/*-----------------------------------------------------------------------------
	0x0838 dvi_sad_cs_sum2_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_7               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_7;

/*-----------------------------------------------------------------------------
	0x083c dvi_sad_ps_cnt0_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_7              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0840 dvi_sad_ps_cnt1_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_7              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0844 dvi_sad_ps_cnt2_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_7              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0848 dvi_sad_ps_cnt0_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_7               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_7;

/*-----------------------------------------------------------------------------
	0x084c dvi_sad_ps_cnt1_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_7               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_7;

/*-----------------------------------------------------------------------------
	0x0850 dvi_sad_ps_cnt2_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_7               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_7;

/*-----------------------------------------------------------------------------
	0x0854 dvi_sad_cs_cnt0_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_7              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0858 dvi_sad_cs_cnt1_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_7              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_7;

/*-----------------------------------------------------------------------------
	0x085c dvi_sad_cs_cnt2_even_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_7              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_7;

/*-----------------------------------------------------------------------------
	0x0860 dvi_sad_cs_cnt0_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_7               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_7;

/*-----------------------------------------------------------------------------
	0x0864 dvi_sad_cs_cnt1_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_7               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_7;

/*-----------------------------------------------------------------------------
	0x0868 dvi_sad_cs_cnt2_odd_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_7               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_7;

/*-----------------------------------------------------------------------------
	0x086c dvi_sad_ps_sum0_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_even_8              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_EVEN_8;

/*-----------------------------------------------------------------------------
	0x0870 dvi_sad_ps_sum1_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_even_8              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_EVEN_8;

/*-----------------------------------------------------------------------------
	0x0874 dvi_sad_ps_sum2_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_even_8              :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_EVEN_8;

/*-----------------------------------------------------------------------------
	0x0878 dvi_sad_ps_sum0_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum0_odd_8               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM0_ODD_8;

/*-----------------------------------------------------------------------------
	0x087c dvi_sad_ps_sum1_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum1_odd_8               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM1_ODD_8;

/*-----------------------------------------------------------------------------
	0x0880 dvi_sad_ps_sum2_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_sum2_odd_8               :25;	//  0:24
} H14A0_FRC_SAD_PS_SUM2_ODD_8;

/*-----------------------------------------------------------------------------
	0x0884 dvi_sad_cs_sum0_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_even_8              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_EVEN_8;

/*-----------------------------------------------------------------------------
	0x0888 dvi_sad_cs_sum1_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_even_8              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_EVEN_8;

/*-----------------------------------------------------------------------------
	0x088c dvi_sad_cs_sum2_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_even_8              :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_EVEN_8;

/*-----------------------------------------------------------------------------
	0x0890 dvi_sad_cs_sum0_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum0_odd_8               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM0_ODD_8;

/*-----------------------------------------------------------------------------
	0x0894 dvi_sad_cs_sum1_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum1_odd_8               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM1_ODD_8;

/*-----------------------------------------------------------------------------
	0x0898 dvi_sad_cs_sum2_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_sum2_odd_8               :25;	//  0:24
} H14A0_FRC_SAD_CS_SUM2_ODD_8;

/*-----------------------------------------------------------------------------
	0x089c dvi_sad_ps_cnt0_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_even_8              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_EVEN_8;

/*-----------------------------------------------------------------------------
	0x08a0 dvi_sad_ps_cnt1_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_even_8              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_EVEN_8;

/*-----------------------------------------------------------------------------
	0x08a4 dvi_sad_ps_cnt2_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_even_8              :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_EVEN_8;

/*-----------------------------------------------------------------------------
	0x08a8 dvi_sad_ps_cnt0_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt0_odd_8               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT0_ODD_8;

/*-----------------------------------------------------------------------------
	0x08ac dvi_sad_ps_cnt1_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt1_odd_8               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT1_ODD_8;

/*-----------------------------------------------------------------------------
	0x08b0 dvi_sad_ps_cnt2_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_ps_cnt2_odd_8               :17;	//  0:16
} H14A0_FRC_SAD_PS_CNT2_ODD_8;

/*-----------------------------------------------------------------------------
	0x08b4 dvi_sad_cs_cnt0_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_even_8              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_EVEN_8;

/*-----------------------------------------------------------------------------
	0x08b8 dvi_sad_cs_cnt1_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_even_8              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_EVEN_8;

/*-----------------------------------------------------------------------------
	0x08bc dvi_sad_cs_cnt2_even_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_even_8              :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_EVEN_8;

/*-----------------------------------------------------------------------------
	0x08c0 dvi_sad_cs_cnt0_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt0_odd_8               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT0_ODD_8;

/*-----------------------------------------------------------------------------
	0x08c4 dvi_sad_cs_cnt1_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt1_odd_8               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT1_ODD_8;

/*-----------------------------------------------------------------------------
	0x08c8 dvi_sad_cs_cnt2_odd_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sad_cs_cnt2_odd_8               :17;	//  0:16
} H14A0_FRC_SAD_CS_CNT2_ODD_8;

/*-----------------------------------------------------------------------------
	0x08cc dvi_rgb_min_range1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_min_range1                  :30;	//  0:29
} H14A0_FRC_RGB_MIN_RANGE1;

/*-----------------------------------------------------------------------------
	0x08d0 dvi_rgb_max_range1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_max_range1                  :30;	//  0:29
} H14A0_FRC_RGB_MAX_RANGE1;

/*-----------------------------------------------------------------------------
	0x08d4 dvi_rgb_min_range2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_min_range2                  :30;	//  0:29
} H14A0_FRC_RGB_MIN_RANGE2;

/*-----------------------------------------------------------------------------
	0x08d8 dvi_rgb_max_range2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_max_range2                  :30;	//  0:29
} H14A0_FRC_RGB_MAX_RANGE2;

/*-----------------------------------------------------------------------------
	0x08dc dvi_pel_cnt_range1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pel_cnt_range1                  :21;	//  0:20
} H14A0_FRC_PEL_CNT_RANGE1;

/*-----------------------------------------------------------------------------
	0x08e0 dvi_pel_cnt_range2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pel_cnt_range2                  :21;	//  0:20
} H14A0_FRC_PEL_CNT_RANGE2;

/*-----------------------------------------------------------------------------
	0x08e4 dvi_dvi_askcmddly_s ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dvi_askcmddly_s                 : 4;	//  0: 3
} H14A0_FRC_DVI_ASKCMDDLY_S;

/*-----------------------------------------------------------------------------
	0x08e8 dvi_i_aw_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x08ec dvi_i_ar_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x08f0 dvi_s_i_aw_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x08f4 dvi_rgb_mon_xloc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_mon_xloc                    :11;	//  0:10
} H14A0_FRC_RGB_MON_XLOC;

/*-----------------------------------------------------------------------------
	0x08f8 dvi_rgb_mon_yloc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_mon_yloc                    :11;	//  0:10
} H14A0_FRC_RGB_MON_YLOC;

/*-----------------------------------------------------------------------------
	0x08fc dvi_r_mon_dat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_mon_dat                       :10;	//  0: 9
} H14A0_FRC_R_MON_DAT;

/*-----------------------------------------------------------------------------
	0x0900 dvi_g_mon_dat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	g_mon_dat                       :10;	//  0: 9
} H14A0_FRC_G_MON_DAT;

/*-----------------------------------------------------------------------------
	0x0904 dvi_b_mon_dat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	b_mon_dat                       :10;	//  0: 9
} H14A0_FRC_B_MON_DAT;

/*-----------------------------------------------------------------------------
	0x0908 dvi_rgb24en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb24en                         :10;	//  0: 9
} H14A0_FRC_RGB24EN;

/*-----------------------------------------------------------------------------
	0x090c dvi_psu_falling_vs ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	psu_falling_vs                  : 1;	//     0
} H14A0_FRC_PSU_FALLING_VS;

/*-----------------------------------------------------------------------------
	0x0910 dvi_gmau_ch_pri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dvi_gmau_ch_pri_0                 : 1,	//     0
	dvi_gmau_ch_pri_1                 : 1;	//     1
} H14A0_FRC_DVI_GMAU_CH_PRI;

/*-----------------------------------------------------------------------------
	0x0914 dvi_ls_ctrl_on ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ls_ctrl_on                      : 1;	//     0
} H14A0_FRC_LS_CTRL_ON;

/*-----------------------------------------------------------------------------
	0x0918 dvi_config_ch1_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config_ch1_mask                 :18;	//  0:17
} H14A0_FRC_CONFIG_CH1_MASK;

/*-----------------------------------------------------------------------------
	0x091c dvi_config1_ch1_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config1_ch1_mask                :18;	//  0:17
} H14A0_FRC_CONFIG1_CH1_MASK;

/*-----------------------------------------------------------------------------
	0x0920 ddvi_vi_reserved ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dvi_reserved                    :16;	//  0:15
} H14A0_FRC_DVI_RESERVED;

typedef struct {
	H14A0_FRC_CONFIG_CH0                      	dvi_config_ch0                      ;	// 0x0000 : ''
	H14A0_FRC_CONFIG_CH1                      	dvi_config_ch1                      ;	// 0x0004 : ''
	H14A0_FRC_CONFIG1_CH0                     	dvi_config1_ch0                     ;	// 0x0008 : ''
	H14A0_FRC_CONFIG1_CH1                     	dvi_config1_ch1                     ;	// 0x000c : ''
	H14A0_FRC_BYPASSBA0                       	dvi_bypassba0                       ;	// 0x0010 : ''
	H14A0_FRC_MCADRH0                         	dvi_mcadrh0                         ;	// 0x0014 : ''
	H14A0_FRC_MCADRL0                         	dvi_mcadrl0                         ;	// 0x0018 : ''
	H14A0_FRC_MEYADR0                         	dvi_meyadr0                         ;	// 0x001c : ''
	H14A0_FRC_OSDMAPADR0                      	dvi_osdmapadr0                      ;	// 0x0020 : ''
	H14A0_FRC_MCADRH_S0                       	dvi_mcadrh_s0                       ;	// 0x0024 : ''
	H14A0_FRC_MCADRL_S0                       	dvi_mcadrl_s0                       ;	// 0x0028 : ''
	H14A0_FRC_BYPASSBA1                       	dvi_bypassba1                       ;	// 0x002c : ''
	H14A0_FRC_MCADRH1                         	dvi_mdvi_cadrh1                     ;	// 0x0030 : ''
	H14A0_FRC_MCADRL1                         	dvi_mcadrl1                         ;	// 0x0034 : ''
	H14A0_FRC_MEYADR1                         	dvi_meyadr1                         ;	// 0x0038 : ''
	H14A0_FRC_OSDMAPADR1                      	dvi_osdmapadr1                      ;	// 0x003c : ''
	H14A0_FRC_MCADRH_S1                       	dvi_mcadrh_s1                       ;	// 0x0040 : ''
	H14A0_FRC_MCADRL_S1                       	dvi_mcadrl_s1                       ;	// 0x0044 : ''
	H14A0_FRC_GMAU_LS                         	dvi_gmau_ls                         ;	// 0x0048 : ''
	H14A0_FRC_GMAU_LS_S                       	dvi_gmau_ls_s                       ;	// 0x004c : ''
	H14A0_FRC_GHIST00                         	dvi_ghist00                         ;	// 0x0050 : ''
	H14A0_FRC_GHIST02                         	dvi_ghist02                         ;	// 0x0054 : ''
	H14A0_FRC_GHIST04                         	dvi_ghist04                         ;	// 0x0058 : ''
	H14A0_FRC_GHIST06                         	dvi_ghist06                         ;	// 0x005c : ''
	H14A0_FRC_GHIST08                         	dvi_ghist08                         ;	// 0x0060 : ''
	H14A0_FRC_GHIST10                         	dvi_ghist10                         ;	// 0x0064 : ''
	H14A0_FRC_GHIST12                         	dvi_ghist12                         ;	// 0x0068 : ''
	H14A0_FRC_GHIST14                         	dvi_ghist14                         ;	// 0x006c : ''
	H14A0_FRC_GHIST16                         	dvi_ghist16                         ;	// 0x0070 : ''
	H14A0_FRC_GHIST18                         	dvi_ghist18                         ;	// 0x0074 : ''
	H14A0_FRC_GHIST20                         	dvi_ghist20                         ;	// 0x0078 : ''
	H14A0_FRC_GHIST22                         	dvi_ghist22                         ;	// 0x007c : ''
	H14A0_FRC_GHIST24                         	dvi_ghist24                         ;	// 0x0080 : ''
	H14A0_FRC_GHIST26                         	dvi_ghist26                         ;	// 0x0084 : ''
	H14A0_FRC_GHIST28                         	dvi_ghist28                         ;	// 0x0088 : ''
	H14A0_FRC_GHIST30                         	dvi_ghist30                         ;	// 0x008c : ''
	H14A0_FRC_PXLAV                           	dvi_pxlav                           ;	// 0x0090 : ''
	H14A0_FRC_XLAPAV                          	dvi_xlapav                          ;	// 0x0094 : ''
	H14A0_FRC_BND0VALTHR                      	dvi_bnd0valthr                      ;	// 0x0098 : ''
	H14A0_FRC_BND0CNTTHR                      	dvi_bnd0cntthr                      ;	// 0x009c : ''
	H14A0_FRC_BND0POSTOP                      	dvi_bnd0postop                      ;	// 0x00a0 : ''
	H14A0_FRC_BND0POSBOTTOM                   	dvi_bnd0posbottom                   ;	// 0x00a4 : ''
	H14A0_FRC_BND0POSLEFT                     	dvi_bnd0posleft                     ;	// 0x00a8 : ''
	H14A0_FRC_BND0POSRIGHT                    	dvi_bnd0posright                    ;	// 0x00ac : ''
	H14A0_FRC_BND0MASKTOP                     	dvi_bnd0masktop                     ;	// 0x00b0 : ''
	H14A0_FRC_BND0MASKBOTTOM                  	dvi_bnd0maskbottom                  ;	// 0x00b4 : ''
	H14A0_FRC_BND0MASKLEFT                    	dvi_bnd0maskleft                    ;	// 0x00b8 : ''
	H14A0_FRC_BND0MASKRIGHT                   	dvi_bnd0maskright                   ;	// 0x00bc : ''
	H14A0_FRC_BND1VALTHR                      	dvi_bnd1valthr                      ;	// 0x00c0 : ''
	H14A0_FRC_BND1CNTTHR                      	dvi_bnd1cntthr                      ;	// 0x00c4 : ''
	H14A0_FRC_BND1POSTOP                      	dvi_bnd1postop                      ;	// 0x00c8 : ''
	H14A0_FRC_BND1POSBOTTOM                   	dvi_bnd1posbottom                   ;	// 0x00cc : ''
	H14A0_FRC_BND1POSLEFT                     	dvi_bnd1posleft                     ;	// 0x00d0 : ''
	H14A0_FRC_BND1POSRIGHT                    	dvi_bnd1posright                    ;	// 0x00d4 : ''
	H14A0_FRC_BND1MASKTOP                     	dvi_bnd1masktop                     ;	// 0x00d8 : ''
	H14A0_FRC_BND1MASKBOTTOM                  	dvi_bnd1maskbottom                  ;	// 0x00dc : ''
	H14A0_FRC_BND1MASKLEFT                    	dvi_bnd1maskleft                    ;	// 0x00e0 : ''
	H14A0_FRC_BND1MASKRIGHT                   	dvi_bnd1maskright                   ;	// 0x00e4 : ''
	H14A0_FRC_BND0SUMTOP0                     	dvi_bnd0sumtop0                     ;	// 0x00e8 : ''
	H14A0_FRC_BND0SUMTOP1                     	dvi_bnd0sumtop1                     ;	// 0x00ec : ''
	H14A0_FRC_BND0SUMTOP2                     	dvi_bnd0sumtop2                     ;	// 0x00f0 : ''
	H14A0_FRC_BND0SUMTOP3                     	dvi_bnd0sumtop3                     ;	// 0x00f4 : ''
	H14A0_FRC_BND0SUMBOTTOM0                  	dvi_bnd0sumbottom0                  ;	// 0x00f8 : ''
	H14A0_FRC_BND0SUMBOTTOM1                  	dvi_bnd0sumbottom1                  ;	// 0x00fc : ''
	H14A0_FRC_BND0SUMBOTTOM2                  	dvi_bnd0sumbottom2                  ;	// 0x0100 : ''
	H14A0_FRC_BND0SUMBOTTOM3                  	dvi_bnd0sumbottom3                  ;	// 0x0104 : ''
	H14A0_FRC_BND0SUMLEFT0                    	dvi_bnd0sumleft0                    ;	// 0x0108 : ''
	H14A0_FRC_BND0SUMLEFT1                    	dvi_bnd0sumleft1                    ;	// 0x010c : ''
	H14A0_FRC_BND0SUMLEFT2                    	dvi_bnd0sumleft2                    ;	// 0x0110 : ''
	H14A0_FRC_BND0SUMLEFT3                    	dvi_bnd0sumleft3                    ;	// 0x0114 : ''
	H14A0_FRC_BND0SUMRIGHT0                   	dvi_bnd0sumright0                   ;	// 0x0118 : ''
	H14A0_FRC_BND0SUMRIGHT1                   	dvi_bnd0sumright1                   ;	// 0x011c : ''
	H14A0_FRC_BND0SUMRIGHT2                   	dvi_bnd0sumright2                   ;	// 0x0120 : ''
	H14A0_FRC_BND0SUMRIGHT3                   	dvi_bnd0sumright3                   ;	// 0x0124 : ''
	UINT32                                  	dvi_bnd0flagtop0                    ;	// 0x0128 : ''
	UINT32                                  	dvi_bnd0flagtop1                    ;	// 0x012c : ''
	UINT32                                  	dvi_bnd0flagbottom0                 ;	// 0x0130 : ''
	UINT32                                  	dvi_bnd0flagbottom1                 ;	// 0x0134 : ''
	UINT32                                  	dvi_bnd0flagleft0                   ;	// 0x0138 : ''
	UINT32                                  	dvi_bnd0flagleft1                   ;	// 0x013c : ''
	UINT32                                  	dvi_bnd0flagright0                  ;	// 0x0140 : ''
	UINT32                                  	dvi_bnd0flagright1                  ;	// 0x0144 : ''
	H14A0_FRC_BND1SUMTOP0                     	dvi_bnd1sumtop0                     ;	// 0x0148 : ''
	H14A0_FRC_BND1SUMTOP1                     	dvi_bnd1sumtop1                     ;	// 0x014c : ''
	H14A0_FRC_BND1SUMTOP2                     	dvi_bnd1sumtop2                     ;	// 0x0150 : ''
	H14A0_FRC_BND1SUMTOP3                     	dvi_bnd1sumtop3                     ;	// 0x0154 : ''
	H14A0_FRC_BND1SUMBOTTOM0                  	dvi_bnd1sumbottom0                  ;	// 0x0158 : ''
	H14A0_FRC_BND1SUMBOTTOM1                  	dvi_bnd1sumbottom1                  ;	// 0x015c : ''
	H14A0_FRC_BND1SUMBOTTOM2                  	dvi_bnd1sumbottom2                  ;	// 0x0160 : ''
	H14A0_FRC_BND1SUMBOTTOM3                  	dvi_bnd1sumbottom3                  ;	// 0x0164 : ''
	H14A0_FRC_BND1SUMLEFT0                    	dvi_bnd1sumleft0                    ;	// 0x0168 : ''
	H14A0_FRC_BND1SUMLEFT1                    	dvi_bnd1sumleft1                    ;	// 0x016c : ''
	H14A0_FRC_BND1SUMLEFT2                    	dvi_bnd1sumleft2                    ;	// 0x0170 : ''
	H14A0_FRC_BND1SUMLEFT3                    	dvi_bnd1sumleft3                    ;	// 0x0174 : ''
	H14A0_FRC_BND1SUMRIGHT0                   	dvi_bnd1sumright0                   ;	// 0x0178 : ''
	H14A0_FRC_BND1SUMRIGHT1                   	dvi_bnd1sumright1                   ;	// 0x017c : ''
	H14A0_FRC_BND1SUMRIGHT2                   	dvi_bnd1sumright2                   ;	// 0x0180 : ''
	H14A0_FRC_BND1SUMRIGHT3                   	dvi_bnd1sumright3                   ;	// 0x0184 : ''
	UINT32                          	      	dvi_bnd1flagtop0                    ;	// 0x0188 : ''
	UINT32                                  	dvi_bnd1flagtop1                    ;	// 0x018c : ''
	UINT32                                  	dvi_bnd1flagbottom0                 ;	// 0x0190 : ''
	UINT32                                  	dvi_bnd1flagbottom1                 ;	// 0x0194 : ''
	UINT32                                  	dvi_bnd1flagleft0                   ;	// 0x0198 : ''
	UINT32                                  	dvi_bnd1flagleft1                   ;	// 0x019c : ''
	UINT32                                  	dvi_bnd1flagright0                  ;	// 0x01a0 : ''
	UINT32                                  	dvi_bnd1flagright1                  ;	// 0x01a4 : ''
	H14A0_FRC_YUVCOEF11_ME                    	dvi_yuvcoef11_me                    ;	// 0x01a8 : ''
	H14A0_FRC_YUVCOEF12_ME                    	dvi_yuvcoef12_me                    ;	// 0x01ac : ''
	H14A0_FRC_YUVCOEF13_ME                    	dvi_yuvcoef13_me                    ;	// 0x01b0 : ''
	H14A0_FRC_NUMPIXTOT1                      	dvi_numpixtot1                      ;	// 0x01b4 : ''
	H14A0_FRC_NUMPIXTOT2                      	dvi_numpixtot2                      ;	// 0x01b8 : ''
	H14A0_FRC_NUMPIXDARK1                     	dvi_numpixdark1                     ;	// 0x01bc : ''
	H14A0_FRC_NUMPIXDARK2                     	dvi_numpixdark2                     ;	// 0x01c0 : ''
	H14A0_FRC_NUMPIXBW1                       	dvi_numpixbw1                       ;	// 0x01c4 : ''
	H14A0_FRC_NUMPIXBW2                       	dvi_numpixbw2                       ;	// 0x01c8 : ''
	H14A0_FRC_NUMPIXSC1                       	dvi_numpixsc1                       ;	// 0x01cc : ''
	H14A0_FRC_NUMPIXSC2                       	dvi_numpixsc2                       ;	// 0x01d0 : ''
	H14A0_FRC_TPIXBW1                         	dvi_tpixbw1                         ;	// 0x01d4 : ''
	H14A0_FRC_TPIXBW2                         	dvi_tpixbw2                         ;	// 0x01d8 : ''
	H14A0_FRC_TPIXSC1                         	dvi_tpixsc1                         ;	// 0x01dc : ''
	H14A0_FRC_TPIXSC2                         	dvi_tpixsc2                         ;	// 0x01e0 : ''
	H14A0_FRC_CPIXBW1                         	dvi_cpixbw1                         ;	// 0x01e4 : ''
	H14A0_FRC_CPIXBW2                         	dvi_cpixbw2                         ;	// 0x01e8 : ''
	H14A0_FRC_CPIXSC1                         	dvi_cpixsc1                         ;	// 0x01ec : ''
	H14A0_FRC_CPIXSC2                         	dvi_cpixsc2                         ;	// 0x01f0 : ''
	H14A0_FRC_STEEPGRA0                       	dvi_steepgra0                       ;	// 0x01f4 : ''
	H14A0_FRC_STEEPGRA1_0                     	dvi_steepgra1_0                     ;	// 0x01f8 : ''
	H14A0_FRC_STEEPGRA1_1                     	dvi_steepgra1_1                     ;	// 0x01fc : ''
	H14A0_FRC_STGREGION_LRUC                  	dvi_stgregion_lruc                  ;	// 0x0200 : ''
	H14A0_FRC_STGREGION_LRBC                  	dvi_stgregion_lrbc                  ;	// 0x0204 : ''
	H14A0_FRC_STGREGION_TBC                   	dvi_stgregion_tbc                   ;	// 0x0208 : ''
	H14A0_FRC_STGREGION_LRU                   	dvi_stgregion_lru                   ;	// 0x020c : ''
	H14A0_FRC_STGREGION_LRB                   	dvi_stgregion_lrb                   ;	// 0x0210 : ''
	H14A0_FRC_STGREGION_TB                    	dvi_stgregion_tb                    ;	// 0x0214 : ''
	H14A0_FRC_XLAPAV12                        	dvi_xlapav12                        ;	// 0x0218 : ''
	H14A0_FRC_XLAPAV34                        	dvi_xlapav34                        ;	// 0x021c : ''
	H14A0_FRC_XLAPAV56                        	dvi_xlapav56                        ;	// 0x0220 : ''
	H14A0_FRC_XLAPAV78                        	dvi_xlapav78                        ;	// 0x0224 : ''
	H14A0_FRC_XLAPAV9                         	dvi_xlapav9                         ;	// 0x0228 : ''
	H14A0_FRC_XLAPAH1                         	dvi_xlapah1                         ;	// 0x022c : ''
	H14A0_FRC_XLAPAH2                         	dvi_xlapah2                         ;	// 0x0230 : ''
	H14A0_FRC_XLAPAH3                         	dvi_xlapah3                         ;	// 0x0234 : ''
	H14A0_FRC_XLAPAH4                         	dvi_xlapah4                         ;	// 0x0238 : ''
	H14A0_FRC_XLAPAH5                         	dvi_xlapah5                         ;	// 0x023c : ''
	H14A0_FRC_XLAPAH6                         	dvi_xlapah6                         ;	// 0x0240 : ''
	H14A0_FRC_XLAPAH7                         	dvi_xlapah7                         ;	// 0x0244 : ''
	H14A0_FRC_XLAPAH8                         	dvi_xlapah8                         ;	// 0x0248 : ''
	H14A0_FRC_XLAPAH9                         	dvi_xlapah9                         ;	// 0x024c : ''
	H14A0_FRC_XLAPAH10                        	dvi_xlapah10                        ;	// 0x0250 : ''
	H14A0_FRC_XLAPAH11                        	dvi_xlapah11                        ;	// 0x0254 : ''
	H14A0_FRC_BOLOW0                          	dvi_bolow0                          ;	// 0x0258 : ''
	H14A0_FRC_BOHIGH0                         	dvi_bohigh0                         ;	// 0x025c : ''
	H14A0_FRC_BOLOW1                          	dvi_bolow1                          ;	// 0x0260 : ''
	H14A0_FRC_BOHIGH1                         	dvi_bohigh1                         ;	// 0x0264 : ''
	H14A0_FRC_MCTH0H00                        	dvi_mcth0h00                        ;	// 0x0268 : ''
	H14A0_FRC_MCTH0H01                        	dvi_mcth0h01                        ;	// 0x026c : ''
	H14A0_FRC_MCTH0H02                        	dvi_mcth0h02                        ;	// 0x0270 : ''
	H14A0_FRC_MCTH0H03                        	dvi_mcth0h03                        ;	// 0x0274 : ''
	H14A0_FRC_MCTH0H10                        	dvi_mcth0h10                        ;	// 0x0278 : ''
	H14A0_FRC_MCTH0H11                        	dvi_mcth0h11                        ;	// 0x027c : ''
	H14A0_FRC_MCTH0H12                        	dvi_mcth0h12                        ;	// 0x0280 : ''
	H14A0_FRC_MCTH0H13                        	dvi_mcth0h13                        ;	// 0x0284 : ''
	H14A0_FRC_MCTH0H20                        	dvi_mcth0h20                        ;	// 0x0288 : ''
	H14A0_FRC_MCTH0H21                        	dvi_mcth0h21                        ;	// 0x028c : ''
	H14A0_FRC_MCTH0H22                        	dvi_mcth0h22                        ;	// 0x0290 : ''
	H14A0_FRC_MCTH0H23                        	dvi_mcth0h23                        ;	// 0x0294 : ''
	H14A0_FRC_MCTH0H30                        	dvi_mcth0h30                        ;	// 0x0298 : ''
	H14A0_FRC_MCTH0H31                        	dvi_mcth0h31                        ;	// 0x029c : ''
	H14A0_FRC_MCTH0H32                        	dvi_mcth0h32                        ;	// 0x02a0 : ''
	H14A0_FRC_MCTH0H33                        	dvi_mcth0h33                        ;	// 0x02a4 : ''
	H14A0_FRC_MCTH0V00                        	dvi_mcth0v00                        ;	// 0x02a8 : ''
	H14A0_FRC_MCTH0V01                        	dvi_mcth0v01                        ;	// 0x02ac : ''
	H14A0_FRC_MCTH0V02                        	dvi_mcth0v02                        ;	// 0x02b0 : ''
	H14A0_FRC_MCTH0V03                        	dvi_mcth0v03                        ;	// 0x02b4 : ''
	H14A0_FRC_MCTH0V10                        	dvi_mcth0v10                        ;	// 0x02b8 : ''
	H14A0_FRC_MCTH0V11                        	dvi_mcth0v11                        ;	// 0x02bc : ''
	H14A0_FRC_MCTH0V12                        	dvi_mcth0v12                        ;	// 0x02c0 : ''
	H14A0_FRC_MCTH0V13                        	dvi_mcth0v13                        ;	// 0x02c4 : ''
	H14A0_FRC_MCTH0V20                        	dvi_mcth0v20                        ;	// 0x02c8 : ''
	H14A0_FRC_MCTH0V21                        	dvi_mcth0v21                        ;	// 0x02cc : ''
	H14A0_FRC_MCTH0V22                        	dvi_mcth0v22                        ;	// 0x02d0 : ''
	H14A0_FRC_MCTH0V23                        	dvi_mcth0v23                        ;	// 0x02d4 : ''
	H14A0_FRC_MCTH0V30                        	dvi_mcth0v30                        ;	// 0x02d8 : ''
	H14A0_FRC_MCTH0V31                        	dvi_mcth0v31                        ;	// 0x02dc : ''
	H14A0_FRC_MCTH0V32                        	dvi_mcth0v32                        ;	// 0x02e0 : ''
	H14A0_FRC_MCTH0V33                        	dvi_mcth0v33                        ;	// 0x02e4 : ''
	H14A0_FRC_MCTH1H00                        	dvi_mcth1h00                        ;	// 0x02e8 : ''
	H14A0_FRC_MCTH1H01                        	dvi_mcth1h01                        ;	// 0x02ec : ''
	H14A0_FRC_MCTH1H02                        	dvi_mcth1h02                        ;	// 0x02f0 : ''
	H14A0_FRC_MCTH1H03                        	dvi_mcth1h03                        ;	// 0x02f4 : ''
	H14A0_FRC_MCTH1H10                        	dvi_mcth1h10                        ;	// 0x02f8 : ''
	H14A0_FRC_MCTH1H11                        	dvi_mcth1h11                        ;	// 0x02fc : ''
	H14A0_FRC_MCTH1H12                        	dvi_mcth1h12                        ;	// 0x0300 : ''
	H14A0_FRC_MCTH1H13                        	dvi_mcth1h13                        ;	// 0x0304 : ''
	H14A0_FRC_MCTH1H20                        	dvi_mcth1h20                        ;	// 0x0308 : ''
	H14A0_FRC_MCTH1H21                        	dvi_mcth1h21                        ;	// 0x030c : ''
	H14A0_FRC_MCTH1H22                        	dvi_mcth1h22                        ;	// 0x0310 : ''
	H14A0_FRC_MCTH1H23                        	dvi_mcth1h23                        ;	// 0x0314 : ''
	H14A0_FRC_MCTH1H30                        	dvi_mcth1h30                        ;	// 0x0318 : ''
	H14A0_FRC_MCTH1H31                        	dvi_mcth1h31                        ;	// 0x031c : ''
	H14A0_FRC_MCTH1H32                        	dvi_mcth1h32                        ;	// 0x0320 : ''
	H14A0_FRC_MCTH1H33                        	dvi_mcth1h33                        ;	// 0x0324 : ''
	H14A0_FRC_MCTH1V00                        	dvi_mcth1v00                        ;	// 0x0328 : ''
	H14A0_FRC_MCTH1V01                        	dvi_mcth1v01                        ;	// 0x032c : ''
	H14A0_FRC_MCTH1V02                        	dvi_mcth1v02                        ;	// 0x0330 : ''
	H14A0_FRC_MCTH1V03                        	dvi_mcth1v03                        ;	// 0x0334 : ''
	H14A0_FRC_MCTH1V10                        	dvi_mcth1v10                        ;	// 0x0338 : ''
	H14A0_FRC_MCTH1V11                        	dvi_mcth1v11                        ;	// 0x033c : ''
	H14A0_FRC_MCTH1V12                        	dvi_mcth1v12                        ;	// 0x0340 : ''
	H14A0_FRC_MCTH1V13                        	dvi_mcth1v13                        ;	// 0x0344 : ''
	H14A0_FRC_MCTH1V20                        	dvi_mcth1v20                        ;	// 0x0348 : ''
	H14A0_FRC_MCTH1V21                        	dvi_mcth1v21                        ;	// 0x034c : ''
	H14A0_FRC_MCTH1V22                        	dvi_mcth1v22                        ;	// 0x0350 : ''
	H14A0_FRC_MCTH1V23                        	dvi_mcth1v23                        ;	// 0x0354 : ''
	H14A0_FRC_MCTH1V30                        	dvi_mcth1v30                        ;	// 0x0358 : ''
	H14A0_FRC_MCTH1V31                        	dvi_mcth1v31                        ;	// 0x035c : ''
	H14A0_FRC_MCTH1V32                        	dvi_mcth1v32                        ;	// 0x0360 : ''
	H14A0_FRC_MCTH1V33                        	dvi_mcth1v33                        ;	// 0x0364 : ''
	H14A0_FRC_APGCMDPRI                       	dvi_apgcmdpri                       ;	// 0x0368 : ''
	H14A0_FRC_TOTALDE                         	dvi_totalde                         ;	// 0x036c : ''
	H14A0_FRC_TOTALPIX                        	dvi_totalpix                        ;	// 0x0370 : ''
	UINT32                                  	dvi_vernum                      ;	// 0x0374 : ''
	H14A0_FRC_CH0OSDON                        	dvi_ch0osdon                        ;	// 0x0378 : ''
	H14A0_FRC_CH0OSD0TOP                      	dvi_ch0osd0top                      ;	// 0x037c : ''
	H14A0_FRC_CH0OSD0BOT                      	dvi_ch0osd0bot                      ;	// 0x0380 : ''
	H14A0_FRC_CH0OSD0LEFT                     	dvi_ch0osd0left                     ;	// 0x0384 : ''
	H14A0_FRC_CH0OSD0RIGHT                    	dvi_ch0osd0right                    ;	// 0x0388 : ''
	H14A0_FRC_CH0OSD1TOP                      	dvi_ch0osd1top                      ;	// 0x038c : ''
	H14A0_FRC_CH0OSD1BOT                      	dvi_ch0osd1bot                      ;	// 0x0390 : ''
	H14A0_FRC_CH0OSD1LEFT                     	dvi_ch0osd1left                     ;	// 0x0394 : ''
	H14A0_FRC_CH0OSD1RIGHT                    	dvi_ch0osd1right                    ;	// 0x0398 : ''
	H14A0_FRC_CH0OSD2TOP                      	dvi_ch0osd2top                      ;	// 0x039c : ''
	H14A0_FRC_CH0OSD2BOT                      	dvi_ch0osd2bot                      ;	// 0x03a0 : ''
	H14A0_FRC_CH0OSD2LEFT                     	dvi_ch0osd2left                     ;	// 0x03a4 : ''
	H14A0_FRC_CH0OSD2RIGHT                    	dvi_ch0osd2right                    ;	// 0x03a8 : ''
	H14A0_FRC_CH0OSD3TOP                      	dvi_ch0osd3top                      ;	// 0x03ac : ''
	H14A0_FRC_CH0OSD3BOT                      	dvi_ch0osd3bot                      ;	// 0x03b0 : ''
	H14A0_FRC_CH0OSD3LEFT                     	dvi_ch0osd3left                     ;	// 0x03b4 : ''
	H14A0_FRC_CH0OSD3RIGHT                    	dvi_ch0osd3right                    ;	// 0x03b8 : ''
	H14A0_FRC_CH1OSDON                        	dvi_ch1osdon                        ;	// 0x03bc : ''
	H14A0_FRC_CH1OSD0TOP                      	dvi_ch1osd0top                      ;	// 0x03c0 : ''
	H14A0_FRC_CH1OSD0BOT                      	dvi_ch1osd0bot                      ;	// 0x03c4 : ''
	H14A0_FRC_CH1OSD0LEFT                     	dvi_ch1osd0left                     ;	// 0x03c8 : ''
	H14A0_FRC_CH1OSD0RIGHT                    	dvi_ch1osd0right                    ;	// 0x03cc : ''
	H14A0_FRC_CH1OSD1TOP                      	dvi_ch1osd1top                      ;	// 0x03d0 : ''
	H14A0_FRC_CH1OSD1BOT                      	dvi_ch1osd1bot                      ;	// 0x03d4 : ''
	H14A0_FRC_CH1OSD1LEFT                     	dvi_ch1osd1left                     ;	// 0x03d8 : ''
	H14A0_FRC_CH1OSD1RIGHT                    	dvi_ch1osd1right                    ;	// 0x03dc : ''
	H14A0_FRC_CH1OSD2TOP                      	dvi_ch1osd2top                      ;	// 0x03e0 : ''
	H14A0_FRC_CH1OSD2BOT                      	dvi_ch1osd2bot                      ;	// 0x03e4 : ''
	H14A0_FRC_CH1OSD2LEFT                     	dvi_ch1osd2left                     ;	// 0x03e8 : ''
	H14A0_FRC_CH1OSD2RIGHT                    	dvi_ch1osd2right                    ;	// 0x03ec : ''
	H14A0_FRC_CH1OSD3TOP                      	dvi_ch1osd3top                      ;	// 0x03f0 : ''
	H14A0_FRC_CH1OSD3BOT                      	dvi_ch1osd3bot                      ;	// 0x03f4 : ''
	H14A0_FRC_CH1OSD3LEFT                     	dvi_ch1osd3left                     ;	// 0x03f8 : ''
	H14A0_FRC_CH1OSD3RIGHT                    	dvi_ch1osd3right                    ;	// 0x03fc : ''
	H14A0_FRC_ASK_TOCNT                       	dvi_ask_tocnt                       ;	// 0x0400 : ''
	H14A0_FRC_NUM_HDATA                       	dvi_num_hdata                       ;	// 0x0404 : ''
	H14A0_FRC_NUM_VDATA                       	dvi_num_vdata                       ;	// 0x0408 : ''
	H14A0_FRC_IINTENABLE                      	dvi_iintenable                      ;	// 0x040c : ''
	H14A0_FRC_IINTCLEAR                       	dvi_iintclear                       ;	// 0x0410 : ''
	H14A0_FRC_IINTSTAT                        	dvi_iintstat                        ;	// 0x0414 : ''
	H14A0_FRC_DBG_LINE_CNT0                   	dvi_dbg_line_cnt0                   ;	// 0x0418 : ''
	H14A0_FRC_DBG_LINE_CNT1                   	dvi_dbg_line_cnt1                   ;	// 0x041c : ''
	H14A0_FRC_BUFFER_FULL_COND                	dvi_buffer_full_cond                ;	// 0x0420 : ''
	H14A0_FRC_DVI_ASKCMDDLY                   	dvi_askcmddly                   ;	// 0x0424 : ''
	H14A0_FRC_HFILTCOEF01                     	dvi_hfiltcoef01                     ;	// 0x0428 : ''
	H14A0_FRC_HFILTCOEF23                     	dvi_hfiltcoef23                     ;	// 0x042c : ''
	H14A0_FRC_HFILTCOEF45                     	dvi_hfiltcoef45                     ;	// 0x0430 : ''
	H14A0_FRC_HFILTCOEF67                     	dvi_hfiltcoef67                     ;	// 0x0434 : ''
	UINT32                                  	dvi_states0                     ;	// 0x0438 : ''
	UINT32                                  	dvi_states1                     ;	// 0x043c : ''
	H14A0_FRC_Y_OFFSET                        	dvi_y_offset                        ;	// 0x0440 : ''
	H14A0_FRC_U_OFFSET                        	dvi_u_offset                        ;	// 0x0444 : ''
	H14A0_FRC_V_OFFSET                        	dvi_v_offset                        ;	// 0x0448 : ''
	H14A0_FRC_Y2RCOEF11                       	dvi_y2rcoef11                       ;	// 0x044c : ''
	H14A0_FRC_Y2RCOEF12                       	dvi_y2rcoef12                       ;	// 0x0450 : ''
	H14A0_FRC_Y2RCOEF13                       	dvi_y2rcoef13                       ;	// 0x0454 : ''
	H14A0_FRC_Y2RCOEF21                       	dvi_y2rcoef21                       ;	// 0x0458 : ''
	H14A0_FRC_Y2RCOEF22                       	dvi_y2rcoef22                       ;	// 0x045c : ''
	H14A0_FRC_Y2RCOEF23                       	dvi_y2rcoef23                       ;	// 0x0460 : ''
	H14A0_FRC_Y2RCOEF31                       	dvi_y2rcoef31                       ;	// 0x0464 : ''
	H14A0_FRC_Y2RCOEF32                       	dvi_y2rcoef32                       ;	// 0x0468 : ''
	H14A0_FRC_Y2RCOEF33                       	dvi_y2rcoef33                       ;	// 0x046c : ''
	UINT32                                  	dvi_filtcoef_h_lev1_1               ;	// 0x0470 : ''
	H14A0_FRC_FILTCOEF_H_LEV1_2               	dvi_filtcoef_h_lev1_2               ;	// 0x0474 : ''
	UINT32                                  	dvi_filtcoef_h_lev2_1               ;	// 0x0478 : ''
	H14A0_FRC_FILTCOEF_H_LEV2_2               	dvi_filtcoef_h_lev2_2               ;	// 0x047c : ''
	UINT32                                  	dvi_filtcoef_h_lev3_1               ;	// 0x0480 : ''
	H14A0_FRC_FILTCOEF_H_LEV3_2               	dvi_filtcoef_h_lev3_2               ;	// 0x0484 : ''
	UINT32                                  	dvi_filtcoef_v_lev1                 ;	// 0x0488 : ''
	UINT32                                  	dvi_filtcoef_v_lev2                 ;	// 0x048c : ''
	UINT32                                  	dvi_filtcoef_v_lev3                 ;	// 0x0490 : ''
	H14A0_FRC_APGCMDPRI_S                     	dvi_apgcmdpri_s                     ;	// 0x0494 : ''
	H14A0_FRC_APGCMDPRI_R                     	dvi_apgcmdpri_r                     ;	// 0x0498 : ''
	H14A0_FRC_MCADRH_RD                       	dvi_mcadrh_rd                       ;	// 0x049c : ''
	H14A0_FRC_SAD_STARTLINE                   	dvi_sad_startline                   ;	// 0x04a0 : ''
	H14A0_FRC_SAD_ENDLINE                     	dvi_sad_endline                     ;	// 0x04a4 : ''
	H14A0_FRC_SAD_THSAD                       	dvi_sad_thsad                       ;	// 0x04a8 : ''
	H14A0_FRC_SAD_PG_SUM0_EVEN                	dvi_sad_pg_sum0_even                ;	// 0x04ac : ''
	H14A0_FRC_SAD_PG_SUM1_EVEN                	dvi_sad_pg_sum1_even                ;	// 0x04b0 : ''
	H14A0_FRC_SAD_PG_SUM2_EVEN                	dvi_sad_pg_sum2_even                ;	// 0x04b4 : ''
	H14A0_FRC_SAD_PG_SUM0_ODD                 	dvi_sad_pg_sum0_odd                 ;	// 0x04b8 : ''
	H14A0_FRC_SAD_PG_SUM1_ODD                 	dvi_sad_pg_sum1_odd                 ;	// 0x04bc : ''
	H14A0_FRC_SAD_PG_SUM2_ODD                 	dvi_sad_pg_sum2_odd                 ;	// 0x04c0 : ''
	H14A0_FRC_SAD_CG_SUM0_EVEN                	dvi_sad_cg_sum0_even                ;	// 0x04c4 : ''
	H14A0_FRC_SAD_CG_SUM1_EVEN                	dvi_sad_cg_sum1_even                ;	// 0x04c8 : ''
	H14A0_FRC_SAD_CG_SUM2_EVEN                	dvi_sad_cg_sum2_even                ;	// 0x04cc : ''
	H14A0_FRC_SAD_CG_SUM0_ODD                 	dvi_sad_cg_sum0_odd                 ;	// 0x04d0 : ''
	H14A0_FRC_SAD_CG_SUM1_ODD                 	dvi_sad_cg_sum1_odd                 ;	// 0x04d4 : ''
	H14A0_FRC_SAD_CG_SUM2_ODD                 	dvi_sad_cg_sum2_odd                 ;	// 0x04d8 : ''
	H14A0_FRC_SAD_PG_CNT0_EVEN                	dvi_sad_pg_cnt0_even                ;	// 0x04dc : ''
	H14A0_FRC_SAD_PG_CNT1_EVEN                	dvi_sad_pg_cnt1_even                ;	// 0x04e0 : ''
	H14A0_FRC_SAD_PG_CNT2_EVEN                	dvi_sad_pg_cnt2_even                ;	// 0x04e4 : ''
	H14A0_FRC_SAD_PG_CNT0_ODD                 	dvi_sad_pg_cnt0_odd                 ;	// 0x04e8 : ''
	H14A0_FRC_SAD_PG_CNT1_ODD                 	dvi_sad_pg_cnt1_odd                 ;	// 0x04ec : ''
	H14A0_FRC_SAD_PG_CNT2_ODD                 	dvi_sad_pg_cnt2_odd                 ;	// 0x04f0 : ''
	H14A0_FRC_SAD_CG_CNT0_EVEN                	dvi_sad_cg_cnt0_even                ;	// 0x04f4 : ''
	H14A0_FRC_SAD_CG_CNT1_EVEN                	dvi_sad_cg_cnt1_even                ;	// 0x04f8 : ''
	H14A0_FRC_SAD_CG_CNT2_EVEN                	dvi_sad_cg_cnt2_even                ;	// 0x04fc : ''
	H14A0_FRC_SAD_CG_CNT0_ODD                 	dvi_sad_cg_cnt0_odd                 ;	// 0x0500 : ''
	H14A0_FRC_SAD_CG_CNT1_ODD                 	dvi_sad_cg_cnt1_odd                 ;	// 0x0504 : ''
	H14A0_FRC_SAD_CG_CNT2_ODD                 	dvi_sad_cg_cnt2_odd                 ;	// 0x0508 : ''
	H14A0_FRC_SAD_PL_SUM0_EVEN                	dvi_sad_pl_sum0_even                ;	// 0x050c : ''
	H14A0_FRC_SAD_PL_SUM1_EVEN                	dvi_sad_pl_sum1_even                ;	// 0x0510 : ''
	H14A0_FRC_SAD_PL_SUM2_EVEN                	dvi_sad_pl_sum2_even                ;	// 0x0514 : ''
	H14A0_FRC_SAD_PL_SUM0_ODD                 	dvi_sad_pl_sum0_odd                 ;	// 0x0518 : ''
	H14A0_FRC_SAD_PL_SUM1_ODD                 	dvi_sad_pl_sum1_odd                 ;	// 0x051c : ''
	H14A0_FRC_SAD_PL_SUM2_ODD                 	dvi_sad_pl_sum2_odd                 ;	// 0x0520 : ''
	H14A0_FRC_SAD_CL_SUM0_EVEN                	dvi_sad_cl_sum0_even                ;	// 0x0524 : ''
	H14A0_FRC_SAD_CL_SUM1_EVEN                	dvi_sad_cl_sum1_even                ;	// 0x0528 : ''
	H14A0_FRC_SAD_CL_SUM2_EVEN                	dvi_sad_cl_sum2_even                ;	// 0x052c : ''
	H14A0_FRC_SAD_CL_SUM0_ODD                 	dvi_sad_cl_sum0_odd                 ;	// 0x0530 : ''
	H14A0_FRC_SAD_CL_SUM1_ODD                 	dvi_sad_cl_sum1_odd                 ;	// 0x0534 : ''
	H14A0_FRC_SAD_CL_SUM2_ODD                 	dvi_sad_cl_sum2_odd                 ;	// 0x0538 : ''
	H14A0_FRC_SAD_PL_CNT0_EVEN                	dvi_sad_pl_cnt0_even                ;	// 0x053c : ''
	H14A0_FRC_SAD_PL_CNT1_EVEN                	dvi_sad_pl_cnt1_even                ;	// 0x0540 : ''
	H14A0_FRC_SAD_PL_CNT2_EVEN                	dvi_sad_pl_cnt2_even                ;	// 0x0544 : ''
	H14A0_FRC_SAD_PL_CNT0_ODD                 	dvi_sad_pl_cnt0_odd                 ;	// 0x0548 : ''
	H14A0_FRC_SAD_PL_CNT1_ODD                 	dvi_sad_pl_cnt1_odd                 ;	// 0x054c : ''
	H14A0_FRC_SAD_PL_CNT2_ODD                 	dvi_sad_pl_cnt2_odd                 ;	// 0x0550 : ''
	H14A0_FRC_SAD_CL_CNT0_EVEN                	dvi_sad_cl_cnt0_even                ;	// 0x0554 : ''
	H14A0_FRC_SAD_CL_CNT1_EVEN                	dvi_sad_cl_cnt1_even                ;	// 0x0558 : ''
	H14A0_FRC_SAD_CL_CNT2_EVEN                	dvi_sad_cl_cnt2_even                ;	// 0x055c : ''
	H14A0_FRC_SAD_CL_CNT0_ODD                 	dvi_sad_cl_cnt0_odd                 ;	// 0x0560 : ''
	H14A0_FRC_SAD_CL_CNT1_ODD                 	dvi_sad_cl_cnt1_odd                 ;	// 0x0564 : ''
	H14A0_FRC_SAD_CL_CNT2_ODD                 	dvi_sad_cl_cnt2_odd                 ;	// 0x0568 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_0              	dvi_sad_ps_sum0_even_0              ;	// 0x056c : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_0              	dvi_sad_ps_sum1_even_0              ;	// 0x0570 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_0              	dvi_sad_ps_sum2_even_0              ;	// 0x0574 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_0               	dvi_sad_ps_sum0_odd_0               ;	// 0x0578 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_0               	dvi_sad_ps_sum1_odd_0               ;	// 0x057c : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_0               	dvi_sad_ps_sum2_odd_0               ;	// 0x0580 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_0              	dvi_sad_cs_sum0_even_0              ;	// 0x0584 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_0              	dvi_sad_cs_sum1_even_0              ;	// 0x0588 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_0              	dvi_sad_cs_sum2_even_0              ;	// 0x058c : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_0               	dvi_sad_cs_sum0_odd_0               ;	// 0x0590 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_0               	dvi_sad_cs_sum1_odd_0               ;	// 0x0594 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_0               	dvi_sad_cs_sum2_odd_0               ;	// 0x0598 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_0              	dvi_sad_ps_cnt0_even_0              ;	// 0x059c : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_0              	dvi_sad_ps_cnt1_even_0              ;	// 0x05a0 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_0              	dvi_sad_ps_cnt2_even_0              ;	// 0x05a4 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_0               	dvi_sad_ps_cnt0_odd_0               ;	// 0x05a8 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_0               	dvi_sad_ps_cnt1_odd_0               ;	// 0x05ac : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_0               	dvi_sad_ps_cnt2_odd_0               ;	// 0x05b0 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_0              	dvi_sad_cs_cnt0_even_0              ;	// 0x05b4 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_0              	dvi_sad_cs_cnt1_even_0              ;	// 0x05b8 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_0              	dvi_sad_cs_cnt2_even_0              ;	// 0x05bc : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_0               	dvi_sad_cs_cnt0_odd_0               ;	// 0x05c0 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_0               	dvi_sad_cs_cnt1_odd_0               ;	// 0x05c4 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_0               	dvi_sad_cs_cnt2_odd_0               ;	// 0x05c8 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_1              	dvi_sad_ps_sum0_even_1              ;	// 0x05cc : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_1              	dvi_sad_ps_sum1_even_1              ;	// 0x05d0 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_1              	dvi_sad_ps_sum2_even_1              ;	// 0x05d4 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_1               	dvi_sad_ps_sum0_odd_1               ;	// 0x05d8 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_1               	dvi_sad_ps_sum1_odd_1               ;	// 0x05dc : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_1               	dvi_sad_ps_sum2_odd_1               ;	// 0x05e0 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_1              	dvi_sad_cs_sum0_even_1              ;	// 0x05e4 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_1              	dvi_sad_cs_sum1_even_1              ;	// 0x05e8 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_1              	dvi_sad_cs_sum2_even_1              ;	// 0x05ec : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_1               	dvi_sad_cs_sum0_odd_1               ;	// 0x05f0 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_1               	dvi_sad_cs_sum1_odd_1               ;	// 0x05f4 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_1               	dvi_sad_cs_sum2_odd_1               ;	// 0x05f8 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_1              	dvi_sad_ps_cnt0_even_1              ;	// 0x05fc : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_1              	dvi_sad_ps_cnt1_even_1              ;	// 0x0600 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_1              	dvi_sad_ps_cnt2_even_1              ;	// 0x0604 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_1               	dvi_sad_ps_cnt0_odd_1               ;	// 0x0608 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_1               	dvi_sad_ps_cnt1_odd_1               ;	// 0x060c : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_1               	dvi_sad_ps_cnt2_odd_1               ;	// 0x0610 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_1              	dvi_sad_cs_cnt0_even_1              ;	// 0x0614 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_1              	dvi_sad_cs_cnt1_even_1              ;	// 0x0618 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_1              	dvi_sad_cs_cnt2_even_1              ;	// 0x061c : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_1               	dvi_sad_cs_cnt0_odd_1               ;	// 0x0620 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_1               	dvi_sad_cs_cnt1_odd_1               ;	// 0x0624 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_1               	dvi_sad_cs_cnt2_odd_1               ;	// 0x0628 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_2              	dvi_sad_ps_sum0_even_2              ;	// 0x062c : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_2              	dvi_sad_ps_sum1_even_2              ;	// 0x0630 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_2              	dvi_sad_ps_sum2_even_2              ;	// 0x0634 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_2               	dvi_sad_ps_sum0_odd_2               ;	// 0x0638 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_2               	dvi_sad_ps_sum1_odd_2               ;	// 0x063c : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_2               	dvi_sad_ps_sum2_odd_2               ;	// 0x0640 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_2              	dvi_sad_cs_sum0_even_2              ;	// 0x0644 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_2              	dvi_sad_cs_sum1_even_2              ;	// 0x0648 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_2              	dvi_sad_cs_sum2_even_2              ;	// 0x064c : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_2               	dvi_sad_cs_sum0_odd_2               ;	// 0x0650 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_2               	dvi_sad_cs_sum1_odd_2               ;	// 0x0654 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_2               	dvi_sad_cs_sum2_odd_2               ;	// 0x0658 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_2              	dvi_sad_ps_cnt0_even_2              ;	// 0x065c : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_2              	dvi_sad_ps_cnt1_even_2              ;	// 0x0660 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_2              	dvi_sad_ps_cnt2_even_2              ;	// 0x0664 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_2               	dvi_sad_ps_cnt0_odd_2               ;	// 0x0668 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_2               	dvi_sad_ps_cnt1_odd_2               ;	// 0x066c : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_2               	dvi_sad_ps_cnt2_odd_2               ;	// 0x0670 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_2              	dvi_sad_cs_cnt0_even_2              ;	// 0x0674 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_2              	dvi_sad_cs_cnt1_even_2              ;	// 0x0678 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_2              	dvi_sad_cs_cnt2_even_2              ;	// 0x067c : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_2               	dvi_sad_cs_cnt0_odd_2               ;	// 0x0680 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_2               	dvi_sad_cs_cnt1_odd_2               ;	// 0x0684 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_2               	dvi_sad_cs_cnt2_odd_2               ;	// 0x0688 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_3              	dvi_sad_ps_sum0_even_3              ;	// 0x068c : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_3              	dvi_sad_ps_sum1_even_3              ;	// 0x0690 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_3              	dvi_sad_ps_sum2_even_3              ;	// 0x0694 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_3               	dvi_sad_ps_sum0_odd_3               ;	// 0x0698 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_3               	dvi_sad_ps_sum1_odd_3               ;	// 0x069c : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_3               	dvi_sad_ps_sum2_odd_3               ;	// 0x06a0 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_3              	dvi_sad_cs_sum0_even_3              ;	// 0x06a4 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_3              	dvi_sad_cs_sum1_even_3              ;	// 0x06a8 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_3              	dvi_sad_cs_sum2_even_3              ;	// 0x06ac : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_3               	dvi_sad_cs_sum0_odd_3               ;	// 0x06b0 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_3               	dvi_sad_cs_sum1_odd_3               ;	// 0x06b4 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_3               	dvi_sad_cs_sum2_odd_3               ;	// 0x06b8 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_3              	dvi_sad_ps_cnt0_even_3              ;	// 0x06bc : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_3              	dvi_sad_ps_cnt1_even_3              ;	// 0x06c0 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_3              	dvi_sad_ps_cnt2_even_3              ;	// 0x06c4 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_3               	dvi_sad_ps_cnt0_odd_3               ;	// 0x06c8 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_3               	dvi_sad_ps_cnt1_odd_3               ;	// 0x06cc : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_3               	dvi_sad_ps_cnt2_odd_3               ;	// 0x06d0 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_3              	dvi_sad_cs_cnt0_even_3              ;	// 0x06d4 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_3              	dvi_sad_cs_cnt1_even_3              ;	// 0x06d8 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_3              	dvi_sad_cs_cnt2_even_3              ;	// 0x06dc : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_3               	dvi_sad_cs_cnt0_odd_3               ;	// 0x06e0 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_3               	dvi_sad_cs_cnt1_odd_3               ;	// 0x06e4 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_3               	dvi_sad_cs_cnt2_odd_3               ;	// 0x06e8 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_4              	dvi_sad_ps_sum0_even_4              ;	// 0x06ec : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_4              	dvi_sad_ps_sum1_even_4              ;	// 0x06f0 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_4              	dvi_sad_ps_sum2_even_4              ;	// 0x06f4 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_4               	dvi_sad_ps_sum0_odd_4               ;	// 0x06f8 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_4               	dvi_sad_ps_sum1_odd_4               ;	// 0x06fc : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_4               	dvi_sad_ps_sum2_odd_4               ;	// 0x0700 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_4              	dvi_sad_cs_sum0_even_4              ;	// 0x0704 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_4              	dvi_sad_cs_sum1_even_4              ;	// 0x0708 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_4              	dvi_sad_cs_sum2_even_4              ;	// 0x070c : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_4               	dvi_sad_cs_sum0_odd_4               ;	// 0x0710 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_4               	dvi_sad_cs_sum1_odd_4               ;	// 0x0714 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_4               	dvi_sad_cs_sum2_odd_4               ;	// 0x0718 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_4              	dvi_sad_ps_cnt0_even_4              ;	// 0x071c : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_4              	dvi_sad_ps_cnt1_even_4              ;	// 0x0720 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_4              	dvi_sad_ps_cnt2_even_4              ;	// 0x0724 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_4               	dvi_sad_ps_cnt0_odd_4               ;	// 0x0728 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_4               	dvi_sad_ps_cnt1_odd_4               ;	// 0x072c : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_4               	dvi_sad_ps_cnt2_odd_4               ;	// 0x0730 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_4              	dvi_sad_cs_cnt0_even_4              ;	// 0x0734 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_4              	dvi_sad_cs_cnt1_even_4              ;	// 0x0738 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_4              	dvi_sad_cs_cnt2_even_4              ;	// 0x073c : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_4               	dvi_sad_cs_cnt0_odd_4               ;	// 0x0740 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_4               	dvi_sad_cs_cnt1_odd_4               ;	// 0x0744 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_4               	dvi_sad_cs_cnt2_odd_4               ;	// 0x0748 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_5              	dvi_sad_ps_sum0_even_5              ;	// 0x074c : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_5              	dvi_sad_ps_sum1_even_5              ;	// 0x0750 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_5              	dvi_sad_ps_sum2_even_5              ;	// 0x0754 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_5               	dvi_sad_ps_sum0_odd_5               ;	// 0x0758 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_5               	dvi_sad_ps_sum1_odd_5               ;	// 0x075c : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_5               	dvi_sad_ps_sum2_odd_5               ;	// 0x0760 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_5              	dvi_sad_cs_sum0_even_5              ;	// 0x0764 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_5              	dvi_sad_cs_sum1_even_5              ;	// 0x0768 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_5              	dvi_sad_cs_sum2_even_5              ;	// 0x076c : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_5               	dvi_sad_cs_sum0_odd_5               ;	// 0x0770 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_5               	dvi_sad_cs_sum1_odd_5               ;	// 0x0774 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_5               	dvi_sad_cs_sum2_odd_5               ;	// 0x0778 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_5              	dvi_sad_ps_cnt0_even_5              ;	// 0x077c : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_5              	dvi_sad_ps_cnt1_even_5              ;	// 0x0780 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_5              	dvi_sad_ps_cnt2_even_5              ;	// 0x0784 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_5               	dvi_sad_ps_cnt0_odd_5               ;	// 0x0788 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_5               	dvi_sad_ps_cnt1_odd_5               ;	// 0x078c : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_5               	dvi_sad_ps_cnt2_odd_5               ;	// 0x0790 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_5              	dvi_sad_cs_cnt0_even_5              ;	// 0x0794 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_5              	dvi_sad_cs_cnt1_even_5              ;	// 0x0798 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_5              	dvi_sad_cs_cnt2_even_5              ;	// 0x079c : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_5               	dvi_sad_cs_cnt0_odd_5               ;	// 0x07a0 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_5               	dvi_sad_cs_cnt1_odd_5               ;	// 0x07a4 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_5               	dvi_sad_cs_cnt2_odd_5               ;	// 0x07a8 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_6              	dvi_sad_ps_sum0_even_6              ;	// 0x07ac : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_6              	dvi_sad_ps_sum1_even_6              ;	// 0x07b0 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_6              	dvi_sad_ps_sum2_even_6              ;	// 0x07b4 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_6               	dvi_sad_ps_sum0_odd_6               ;	// 0x07b8 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_6               	dvi_sad_ps_sum1_odd_6               ;	// 0x07bc : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_6               	dvi_sad_ps_sum2_odd_6               ;	// 0x07c0 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_6              	dvi_sad_cs_sum0_even_6              ;	// 0x07c4 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_6              	dvi_sad_cs_sum1_even_6              ;	// 0x07c8 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_6              	dvi_sad_cs_sum2_even_6              ;	// 0x07cc : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_6               	dvi_sad_cs_sum0_odd_6               ;	// 0x07d0 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_6               	dvi_sad_cs_sum1_odd_6               ;	// 0x07d4 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_6               	dvi_sad_cs_sum2_odd_6               ;	// 0x07d8 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_6              	dvi_sad_ps_cnt0_even_6              ;	// 0x07dc : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_6              	dvi_sad_ps_cnt1_even_6              ;	// 0x07e0 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_6              	dvi_sad_ps_cnt2_even_6              ;	// 0x07e4 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_6               	dvi_sad_ps_cnt0_odd_6               ;	// 0x07e8 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_6               	dvi_sad_ps_cnt1_odd_6               ;	// 0x07ec : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_6               	dvi_sad_ps_cnt2_odd_6               ;	// 0x07f0 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_6              	dvi_sad_cs_cnt0_even_6              ;	// 0x07f4 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_6              	dvi_sad_cs_cnt1_even_6              ;	// 0x07f8 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_6              	dvi_sad_cs_cnt2_even_6              ;	// 0x07fc : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_6               	dvi_sad_cs_cnt0_odd_6               ;	// 0x0800 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_6               	dvi_sad_cs_cnt1_odd_6               ;	// 0x0804 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_6               	dvi_sad_cs_cnt2_odd_6               ;	// 0x0808 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_7              	dvi_sad_ps_sum0_even_7              ;	// 0x080c : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_7              	dvi_sad_ps_sum1_even_7              ;	// 0x0810 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_7              	dvi_sad_ps_sum2_even_7              ;	// 0x0814 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_7               	dvi_sad_ps_sum0_odd_7               ;	// 0x0818 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_7               	dvi_sad_ps_sum1_odd_7               ;	// 0x081c : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_7               	dvi_sad_ps_sum2_odd_7               ;	// 0x0820 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_7              	dvi_sad_cs_sum0_even_7              ;	// 0x0824 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_7              	dvi_sad_cs_sum1_even_7              ;	// 0x0828 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_7              	dvi_sad_cs_sum2_even_7              ;	// 0x082c : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_7               	dvi_sad_cs_sum0_odd_7               ;	// 0x0830 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_7               	dvi_sad_cs_sum1_odd_7               ;	// 0x0834 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_7               	dvi_sad_cs_sum2_odd_7               ;	// 0x0838 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_7              	dvi_sad_ps_cnt0_even_7              ;	// 0x083c : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_7              	dvi_sad_ps_cnt1_even_7              ;	// 0x0840 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_7              	dvi_sad_ps_cnt2_even_7              ;	// 0x0844 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_7               	dvi_sad_ps_cnt0_odd_7               ;	// 0x0848 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_7               	dvi_sad_ps_cnt1_odd_7               ;	// 0x084c : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_7               	dvi_sad_ps_cnt2_odd_7               ;	// 0x0850 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_7              	dvi_sad_cs_cnt0_even_7              ;	// 0x0854 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_7              	dvi_sad_cs_cnt1_even_7              ;	// 0x0858 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_7              	dvi_sad_cs_cnt2_even_7              ;	// 0x085c : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_7               	dvi_sad_cs_cnt0_odd_7               ;	// 0x0860 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_7               	dvi_sad_cs_cnt1_odd_7               ;	// 0x0864 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_7               	dvi_sad_cs_cnt2_odd_7               ;	// 0x0868 : ''
	H14A0_FRC_SAD_PS_SUM0_EVEN_8              	dvi_sad_ps_sum0_even_8              ;	// 0x086c : ''
	H14A0_FRC_SAD_PS_SUM1_EVEN_8              	dvi_sad_ps_sum1_even_8              ;	// 0x0870 : ''
	H14A0_FRC_SAD_PS_SUM2_EVEN_8              	dvi_sad_ps_sum2_even_8              ;	// 0x0874 : ''
	H14A0_FRC_SAD_PS_SUM0_ODD_8               	dvi_sad_ps_sum0_odd_8               ;	// 0x0878 : ''
	H14A0_FRC_SAD_PS_SUM1_ODD_8               	dvi_sad_ps_sum1_odd_8               ;	// 0x087c : ''
	H14A0_FRC_SAD_PS_SUM2_ODD_8               	dvi_sad_ps_sum2_odd_8               ;	// 0x0880 : ''
	H14A0_FRC_SAD_CS_SUM0_EVEN_8              	dvi_sad_cs_sum0_even_8              ;	// 0x0884 : ''
	H14A0_FRC_SAD_CS_SUM1_EVEN_8              	dvi_sad_cs_sum1_even_8              ;	// 0x0888 : ''
	H14A0_FRC_SAD_CS_SUM2_EVEN_8              	dvi_sad_cs_sum2_even_8              ;	// 0x088c : ''
	H14A0_FRC_SAD_CS_SUM0_ODD_8               	dvi_sad_cs_sum0_odd_8               ;	// 0x0890 : ''
	H14A0_FRC_SAD_CS_SUM1_ODD_8               	dvi_sad_cs_sum1_odd_8               ;	// 0x0894 : ''
	H14A0_FRC_SAD_CS_SUM2_ODD_8               	dvi_sad_cs_sum2_odd_8               ;	// 0x0898 : ''
	H14A0_FRC_SAD_PS_CNT0_EVEN_8              	dvi_sad_ps_cnt0_even_8              ;	// 0x089c : ''
	H14A0_FRC_SAD_PS_CNT1_EVEN_8              	dvi_sad_ps_cnt1_even_8              ;	// 0x08a0 : ''
	H14A0_FRC_SAD_PS_CNT2_EVEN_8              	dvi_sad_ps_cnt2_even_8              ;	// 0x08a4 : ''
	H14A0_FRC_SAD_PS_CNT0_ODD_8               	dvi_sad_ps_cnt0_odd_8               ;	// 0x08a8 : ''
	H14A0_FRC_SAD_PS_CNT1_ODD_8               	dvi_sad_ps_cnt1_odd_8               ;	// 0x08ac : ''
	H14A0_FRC_SAD_PS_CNT2_ODD_8               	dvi_sad_ps_cnt2_odd_8               ;	// 0x08b0 : ''
	H14A0_FRC_SAD_CS_CNT0_EVEN_8              	dvi_sad_cs_cnt0_even_8              ;	// 0x08b4 : ''
	H14A0_FRC_SAD_CS_CNT1_EVEN_8              	dvi_sad_cs_cnt1_even_8              ;	// 0x08b8 : ''
	H14A0_FRC_SAD_CS_CNT2_EVEN_8              	dvi_sad_cs_cnt2_even_8              ;	// 0x08bc : ''
	H14A0_FRC_SAD_CS_CNT0_ODD_8               	dvi_sad_cs_cnt0_odd_8               ;	// 0x08c0 : ''
	H14A0_FRC_SAD_CS_CNT1_ODD_8               	dvi_sad_cs_cnt1_odd_8               ;	// 0x08c4 : ''
	H14A0_FRC_SAD_CS_CNT2_ODD_8               	dvi_sad_cs_cnt2_odd_8               ;	// 0x08c8 : ''
	H14A0_FRC_RGB_MIN_RANGE1                  	dvi_rgb_min_range1                  ;	// 0x08cc : ''
	H14A0_FRC_RGB_MAX_RANGE1                  	dvi_rgb_max_range1                  ;	// 0x08d0 : ''
	H14A0_FRC_RGB_MIN_RANGE2                  	dvi_rgb_min_range2                  ;	// 0x08d4 : ''
	H14A0_FRC_RGB_MAX_RANGE2                  	dvi_rgb_max_range2                  ;	// 0x08d8 : ''
	H14A0_FRC_PEL_CNT_RANGE1                  	dvi_pel_cnt_range1                  ;	// 0x08dc : ''
	H14A0_FRC_PEL_CNT_RANGE2                  	dvi_pel_cnt_range2                  ;	// 0x08e0 : ''
	H14A0_FRC_DVI_ASKCMDDLY_S                 	dvi_askcmddly_s                     ;	// 0x08e4 : ''
	UINT32                                  	dvi_i_aw_cnt                        ;	// 0x08e8 : ''
	UINT32                                  	dvi_i_ar_cnt                        ;	// 0x08ec : ''
	UINT32                                  	dvi_s_i_aw_cnt                      ;	// 0x08f0 : ''
	H14A0_FRC_RGB_MON_XLOC                    	dvi_rgb_mon_xloc                    ;	// 0x08f4 : ''
	H14A0_FRC_RGB_MON_YLOC                    	dvi_rgb_mon_yloc                    ;	// 0x08f8 : ''
	H14A0_FRC_R_MON_DAT                       	dvi_r_mon_dat                       ;	// 0x08fc : ''
	H14A0_FRC_G_MON_DAT                       	dvi_g_mon_dat                       ;	// 0x0900 : ''
	H14A0_FRC_B_MON_DAT                       	dvi_b_mon_dat                       ;	// 0x0904 : ''
	H14A0_FRC_RGB24EN                         	dvi_rgb24en                         ;	// 0x0908 : ''
	H14A0_FRC_PSU_FALLING_VS                  	dvi_psu_falling_vs                  ;	// 0x090c : ''
	H14A0_FRC_DVI_GMAU_CH_PRI                 	dvi_gmau_ch_pri                     ;	// 0x0910 : ''
	H14A0_FRC_LS_CTRL_ON                      	dvi_ls_ctrl_on                      ;	// 0x0914 : ''
	H14A0_FRC_CONFIG_CH1_MASK                 	dvi_config_ch1_mask                 ;	// 0x0918 : ''
	H14A0_FRC_CONFIG1_CH1_MASK                	dvi_config1_ch1_mask                ;	// 0x091c : ''
	H14A0_FRC_DVI_RESERVED                    	dvi_reserved                        ;	// 0x0920 : ''
} FRC_DVI_REG_H14A0_T;

/*
	FRC_DVO
*/
/*-----------------------------------------------------------------------------
	0x0000 dvo_sg_htotal ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_htotal                       :13;	//  0:12
} H14A0_FRC_DVO_SG_HTOTAL;

/*-----------------------------------------------------------------------------
	0x0004 dvo_sg_hsyncwidth ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_hsyncwidth                   :13;	//  0:12
} H14A0_FRC_DVO_SG_HSYNCWIDTH;

/*-----------------------------------------------------------------------------
	0x0008 dvo_sg_hsyncstart ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_hsyncstart                   :13;	//  0:12
} H14A0_FRC_DVO_SG_HSYNCSTART;

/*-----------------------------------------------------------------------------
	0x000c dvo_sg_hactivewidth ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_hactivewidth                 :13;	//  0:12
} H14A0_FRC_DVO_SG_HACTIVEWIDTH;

/*-----------------------------------------------------------------------------
	0x0010 dvo_sg_hactivestart ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_hactivestart                 :13;	//  0:12
} H14A0_FRC_DVO_SG_HACTIVESTART;

/*-----------------------------------------------------------------------------
	0x00014 dvo_sg_vtotal ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_vtotal                       :13;	//  0:12
} H14A0_FRC_DVO_SG_VTOTAL;

/*-----------------------------------------------------------------------------
	0x00018 dvo_sg_vsyncwidth ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_vsyncwidth                   :13;	//  0:12
} H14A0_FRC_DVO_SG_VSYNCWIDTH;

/*-----------------------------------------------------------------------------
	0x001c dvo_sg_vsyncvstart ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_vsyncvstart                  :13;	//  0:12
} H14A0_FRC_DVO_SG_VSYNCVSTART;

/*-----------------------------------------------------------------------------
	0x0020 dvo_sg_vsynchstart ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_vsynchstart                  :13;	//  0:12
} H14A0_FRC_DVO_SG_VSYNCHSTART;

/*-----------------------------------------------------------------------------
	0x0024 dvo_sg_vactivewidth ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_vactivewidth                 :13;	//  0:12
} H14A0_FRC_DVO_SG_VACTIVEWIDTH;

/*-----------------------------------------------------------------------------
	0x0028 dvo_sg_vactivestart ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_vactivestart                 :13;	//  0:12
} H14A0_FRC_DVO_SG_VACTIVESTART;

/*-----------------------------------------------------------------------------
	0x002c dvo_sync_master ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sync_master                     : 1;	//     0
} H14A0_FRC_DVO_SYNC_MASTER;

/*-----------------------------------------------------------------------------
	0x0030 dvo_sync_cont ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sync_cont				: 1,	//     0
	_rsvd                    		: 3,	//  1: 3 reserved
	sync_rst                       	: 1;	//     4
} H14A0_FRC_DVO_SYNC_CONT;

/*-----------------------------------------------------------------------------
	0x0034 dvo_int_xy_pos_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	int_x_pos_0                     :13,	//  0:12
	_rsvd                                : 3,	// 13:15 reserved
	int_y_pos_0                     :13;	// 16:28
} H14A0_FRC_DVO_INT_XY_POS_0;

/*-----------------------------------------------------------------------------
	0x0038 dvo_int_xy_pos_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	int_x_pos_1                     :13,	//  0:12
	_rsvd                              	: 3,	// 13:15 reserved
	int_y_pos_1                     :13;	// 16:28
} H14A0_FRC_DVO_INT_XY_POS_1;

/*-----------------------------------------------------------------------------
	0x003c dvo_int_xy_pos_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	int_x_pos_2                     :13,	//  0:12
	_rsvd                                : 3,	// 13:15 reserved
	int_y_pos_2                     :13;	// 16:28
} H14A0_FRC_DVO_INT_XY_POS_2;

/*-----------------------------------------------------------------------------
	0x0040 dvo_int_xy_pos_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	int_x_pos_3                     :13,	//  0:12
	_rsvd                                : 3,	// 13:15 reserved
	int_y_pos_3                     :13;	// 16:28
} H14A0_FRC_DVO_INT_XY_POS_3;

/*-----------------------------------------------------------------------------
	0x0044 dvo_disp_in_3d_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_in_3d_mode                 : 2;	//  0: 1
} H14A0_FRC_DVO_DISP_IN_3D_MODE;

/*-----------------------------------------------------------------------------
	0x0048 dvo_disp_out_3d_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_out_3d_mode                : 3;	//  0: 2
} H14A0_FRC_DVO_DISP_OUT_3D_MODE;

/*-----------------------------------------------------------------------------
	0x004c dvo_d_frame_lr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	d_frame_lr                      : 1;	//     0
} H14A0_FRC_DVO_D_FRAME_LR;

/*-----------------------------------------------------------------------------
	0x0050 dvo_disp_sg_ctrl0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lr_o_sync_s_xpos                :13,	//  0:12
	_rsvd_00                                : 2,	// 13:14 reserved
	lr_o_sync_sel                   : 1,	//    15
	lr_o_sync_s_ypos                :13,	// 16:28
	_rsvd_01                                : 2,	// 29:30 reserved
	lr_o_sync_en                    : 1;	//    31
} H14A0_FRC_DVO_DISP_SG_CTRL0;

/*-----------------------------------------------------------------------------
	0x0054 dvo_disp_sg_ctrl1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lr_tcon_sync_s_xpos             :13,	//  0:12
	_rsvd_00                                : 2,	// 13:14 reserved
	lr_tcon_sync_sel                : 1,	//    15
	lr_tcon_sync_s_ypos             :13,	// 16:28
	lr_tcon_mode_sel                : 1,	//    29
	_rsvd_01                                : 1,	//    30 reserved
	lr_tcon_sync_en                 : 1;	//    31
} H14A0_FRC_DVO_DISP_SG_CTRL1;

/*-----------------------------------------------------------------------------
	0x0058 dvo_disp_osd_ctrl0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_osd_enable                 : 1,	//     0
	_rsvd_00                                : 3,	//  1: 3 reserved
	disp_osd_line_size              : 3,	//  4: 6
	_rsvd_01                                : 1,	//     7 reserved
	hsc_osd_ctrl                    : 1,	//     8
	_rsvd_02                                : 3,	//  9:11 reserved
	ext_h_osd_bmap                  : 5,	// 12:16
	_rsvd_03                                : 3,	// 17:19 reserved
	osd_bmap_mode                   : 2;	// 20:21
} H14A0_FRC_DVO_DISP_OSD_CTRL0;

/*-----------------------------------------------------------------------------
	0x005c dvo_disp_osd_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_osd_addr                   :19;	//  0:18
} H14A0_FRC_DVO_DISP_OSD_ADDR;

/*-----------------------------------------------------------------------------
	0x0060 dvo_disp_osd_3d_l_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_osd_3d_l_addr              :19;	//  0:18
} H14A0_FRC_DVO_DISP_OSD_3D_L_ADDR;

/*-----------------------------------------------------------------------------
	0x0064 dvo_disp_osd_3d_r_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_osd_3d_r_addr              :19;	//  0:18
} H14A0_FRC_DVO_DISP_OSD_3D_R_ADDR;

/*-----------------------------------------------------------------------------
	0x0068 dvo_disp_view_mep_mv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	view_melo                       : 1,	//     0
	view_melo_srch_aloc             : 1,	//     1
	view_mepo                       : 1,	//     2
	view_mero                       : 1,	//     3
	view_melp_full                  : 1,	//     4
	view_melp_fwd                   : 1,	//     5
	view_melp_map0                  : 1,	//     6
	view_melp_map1                  : 1,	//     7
	view_mero_ucc                   : 1;	//     8
} H14A0_FRC_DVO_DISP_VIEW_MEP_MV;

/*-----------------------------------------------------------------------------
	0x006c rsv ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0070 dvo_disp_reg_force_set ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_reg_force_set              : 1;	//     0
} H14A0_FRC_DVO_DISP_REG_FORCE_SET;

/*-----------------------------------------------------------------------------
	0x0074 dvo_disp_pixel_read_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_pel_x_pos                    :12,	//  0:11
	_rsvd_00                          	: 4,	// 12:15 reserved
	rd_pel_y_pos                    :12,	// 16:27
	_rsvd_01                          	: 3,	// 28:30 reserved
	rd_pel_pat_en                   : 1;	//    31
} H14A0_FRC_DVO_DISP_PIXEL_READ_CTRL;

/*-----------------------------------------------------------------------------
	0x0078 dvo_disp_pixel_read_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	msb8_rd_pel_gy                  : 8,	//  0: 7
	msb8_rd_pel_cb                  : 8,	//  8:15
	msb8_rd_pel_cr                  : 8,	// 16:23
	lsb2_rd_pel_gy                  : 2,	// 24:25
	lsb2_rd_pel_cb                  : 2,	// 26:27
	lsb2_rd_pel_cr                  : 2;	// 28:29
} H14A0_FRC_DVO_DISP_PIXEL_READ_DATA;

/*-----------------------------------------------------------------------------
	0x007c dvo_disp_pat_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_in_ramp_pat_en               : 1,	//     0
	sc_out_ramp_pat_en              : 1,	//     1
	sc_in_color_en                  : 2,	//  2: 3
	sc_in_gbrw_pat_en               : 2,	//  4: 5
	sc_out_gbrw_pat_en              : 2;	//  6: 7
} H14A0_FRC_DVO_DISP_PAT_CTRL;

/*-----------------------------------------------------------------------------
	0x0080 dvo_disp_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_start                      : 1,	//     0
	_rsvd                                : 3,	//  1: 3 reserved
	param_disp_start                : 4;	//  4: 7
} H14A0_FRC_DVO_DISP_START;

/*-----------------------------------------------------------------------------
	0x0084 dvo_rgb_yuvb ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_yuvb                        : 1;	//     0
} H14A0_FRC_DVO_RGB_YUVB;

/*-----------------------------------------------------------------------------
	0x0088 dvo_disp_line_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_line_size                   : 3,	//  0: 2
	_rsvd_00                                : 1,	//     3 reserved
	yuv_msb_line_size               : 3,	//  4: 6
	_rsvd_01                                : 1,	//     7 reserved
	yuv_lsb_line_size               : 3,	//  8:10
	_rsvd_02                                : 1,	//    11 reserved
	rgb_line_size_3dss              : 3,	// 12:14
	_rsvd_03                                : 1,	//    15 reserved
	yuv_msb_line_size_3dss          : 3,	// 16:18
	_rsvd_04                                : 1,	//    19 reserved
	yuv_lsb_line_size_3dss          : 3;	// 20:22
} H14A0_FRC_DVO_DISP_LINE_SIZE;

/*-----------------------------------------------------------------------------
	0x008c dvo_disp_dir ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hor_rev                         : 1,	//     0
	ver_rev                         : 1;	//     1
} H14A0_FRC_DVO_DISP_DIR;

/*-----------------------------------------------------------------------------
	0x0090 dvo_disp_scale_dual ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_gy_scale                   : 1,	//     0
	disp_dual                       : 1,	//     1
	yuv_scale                       : 1;	//     2
} H14A0_FRC_DVO_DISP_SCALE_DUAL;

/*-----------------------------------------------------------------------------
	0x0094 dvo_disp_lineinter ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_line_inter                 : 2,	//  0: 1
	_rsvd                                : 1,	//     2 reserved
	rgb_line_inter                  : 1;	//     3
} H14A0_FRC_DVO_DISP_LINEINTER;

/*-----------------------------------------------------------------------------
	0x0098 dvo_disp_width ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
