/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

#ifndef _REG_OVI_H14A0_H_
#define _REG_OVI_H14A0_H_

/*
	OVI_TCON
*/

/*-----------------------------------------------------------------------------
	0x0000 tcon_nop ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0004 tcon_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_en                          : 1,	//     0
	wb_en                           : 1,	//     1
	dga_en                          : 1,	//     2
	dither_en                       : 1,	//     3
	xtr_en                          : 1,	//     4
	_rsvd                      : 3;	//     5:7
} H14A0_OVI_TCON_CONTROL;

/*-----------------------------------------------------------------------------
	0x0008 tcon_test_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_left_en                     : 1,	//     0
	wb_left_en                      : 1,	//     1
	dga_left_en                     : 1,	//     2
	dither_left_en                  : 1,	//     3
	tosel0                          : 1,	//     4
	tosel1                          : 1,	//     5
	_rsvd                      : 1,	//     6
	bypass_en                       : 1;	//     7
} H14A0_OVI_TCON_TEST_CTL;

/*-----------------------------------------------------------------------------
	0x000c tcon_sync_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	out_de_inv                      : 1,	//     0
	out_hsync_inv                   : 1,	//     1
	out_vsync_inv                   : 1,	//     2
	out_vsync_sel                   : 1,	//     3
	in_de_inv                       : 1,	//     4
	in_hsync_inv                    : 1,	//     5
	in_vsync_inv                    : 1,	//     6
	_rsvd                      : 1;	//     7
} H14A0_OVI_TCON_SYNC_CTL;

/*-----------------------------------------------------------------------------
	0x0010 tcon_sts ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pix2_lock                       : 1,	//     0
	init_done1                      : 1,	//     1
	init_done2                      : 1,	//     2
	_rsvd                      : 5;	//     3:7
} H14A0_OVI_TCON_STS;

/*-----------------------------------------------------------------------------
	0x0014 tcon_dga_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dga_sel0                        : 1,	//     0
	dga_sel1                        : 1,	//     1
	dga_upload                      : 1,	//     2
	_rsvd                      : 5;	//     3:7
} H14A0_OVI_TCON_DGA_SEL;

/*-----------------------------------------------------------------------------
	0x0018 tcon_odc_opt1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame_freeze_on                 : 1,	//     0
	lodc_en_3d                      : 1,	//     1
	lodc_en_2d                      : 1,	//     2
	_rsvd                      : 2,	//     3:4
	subpix_shift_right_en           : 1,	//     5
	first_last_subpix_en            : 1,	//     6
	pcid20_en                       : 1;	//     7
} H14A0_OVI_TCON_ODC_OPT1;

/*-----------------------------------------------------------------------------
	0x001c tcon_odc_opt2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_rsvd                      : 3,	//  0: 2
	lr_ind_inv                      : 1,	//     3
	odc_bypass                      : 1,	//     4
	odc_upload                      : 1,	//     5
	lodc_upload                     : 1,	//     6
	wb_odc_en                       : 1;	//     7
} H14A0_OVI_TCON_ODC_OPT2;

/*-----------------------------------------------------------------------------
	0x0020 tcon_btc_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_still_en                    : 1,	//     0
	btc_still_mode0                 : 1,	//     1
	btc_still_mode1                 : 1,	//     2
	btc_last_de_mode                : 1,	//     3
	_rsvd                      : 3,	//     4:6
	uv_still_en                     : 1;	//     7
} H14A0_OVI_TCON_BTC_CONFIG;

/*-----------------------------------------------------------------------------
	0x0024 tcon_btc_config_iodc_opt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_rsvd_00                      : 1,	//     0
	hk_en                           : 1,	//     1
	k_lsb_mode0                     : 1,	//     2
	k_lsb_mode1                     : 1,	//     3
	hk_still                        : 1,	//     4
	th_mux                          : 1,	//     5
	prev_en                         : 1,	//     6
	_rsvd_01                      : 1;	//     7
} H14A0_OVI_TCON_BTC_CONFIG_IODC_OPT;

/*-----------------------------------------------------------------------------
	0x0028 tcon_odc_lut1_opt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut1_same_opt                   : 1,	//     0
	lut1_zero_opt                   : 1,	//     1
	lut1_full_opt                   : 1,	//     2
	lut1_add_opt                    : 1,	//     3
	_rsvd                      : 4;	//     4:7
} H14A0_OVI_TCON_ODC_LUT1_OPT;

/*-----------------------------------------------------------------------------
	0x002c tcon_btc_config_3d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_3d_odc_still_en                 : 1,	//     0
	_3d_btc_still_mode0              : 1,	//     1
	_3d_btc_still_mode1              : 1,	//     2
	_3d_btc_last_de_mode             : 1,	//     3
	_rsvd                      : 3,	//  4: 6
	_3d_uv_still_en                  : 1;	//     7
} H14A0_OVI_TCON_BTC_CONFIG_3D;

/*-----------------------------------------------------------------------------
	0x0030 tcon_btc_config_iodc_opt_3d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_rsvd_00                      : 1,	//     0
	_3d_hk_en                        : 1,	//     1
	_3d_k_lsb_mode0                  : 1,	//     2
	_3d_k_lsb_mode1                  : 1,	//     3
	_3d_hk_still                     : 1,	//     4
	_3d_th_mux                       : 1,	//     5
	prev_en                         : 1,	//     6
	_rsvd_01                      : 1;	//     7
} H14A0_OVI_TCON_BTC_CONFIG_IODC_OPT_3D;

/*-----------------------------------------------------------------------------
	0x0034 tcon_odc_lut2_opt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_2d_lut2_same_opt                : 1,	//     0
	_2d_lut2_zero_opt                : 1,	//     1
	_2d_lut2_full_opt                : 1,	//     2
	_2d_lut2_add_opt                 : 1,	//     3
	_3d_lut2_same_opt                : 1,	//     4
	_3d_lut2_zero_opt                : 1,	//     5
	_3d_lut2_full_opt                : 1,	//     6
	_3d_lut2_add_opt                 : 1;	//     7
} H14A0_OVI_TCON_ODC_LUT2_OPT;

/*-----------------------------------------------------------------------------
	0x0038 tcon_btc_config_lodc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lodc_still_en                   : 1,	//     0
	lodc_still_mode0                : 1,	//     1
	lodc_still_mode1                : 1,	//     2
	lodc_uv_still_en                : 1,	//     3
	_rsvd                      : 4;	//     4:7
} H14A0_OVI_TCON_BTC_CONFIG_LODC;

/*-----------------------------------------------------------------------------
	0x003c tcon_btc_config_thrsh_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_th_r                        : 8;	//  0: 7
} H14A0_OVI_TCON_BTC_CONFIG_THRSH_R;

/*-----------------------------------------------------------------------------
	0x0040 tcon_btc_config_thrsh_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_th_g                        : 8;	//  0: 7
} H14A0_OVI_TCON_BTC_CONFIG_THRSH_G;

/*-----------------------------------------------------------------------------
	0x0044 tcon_btc_config_thrsh_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_th_b                        : 8;	//  0: 7
} H14A0_OVI_TCON_BTC_CONFIG_THRSH_B;

/*-----------------------------------------------------------------------------
	0x0048 tcon_btc_config_thrsh_lodc_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lodc_th_r                       : 8;	//  0: 7
} H14A0_OVI_TCON_BTC_CONFIG_THRSH_LODC_R;

/*-----------------------------------------------------------------------------
	0x004c tcon_btc_config_thrsh_lodc_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lodc_th_g                       : 8;	//  0: 7
} H14A0_OVI_TCON_BTC_CONFIG_THRSH_LODC_G;

/*-----------------------------------------------------------------------------
	0x0050 tcon_btc_config_thrsh_lodc_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lodc_th_b                       : 8;	//  0: 7
} H14A0_OVI_TCON_BTC_CONFIG_THRSH_LODC_B;

/*-----------------------------------------------------------------------------
	0x0054 tcon_btc_line_margin ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	btc_margin                      : 8;	//  0: 7
} H14A0_OVI_TCON_BTC_LINE_MARGIN;

/*-----------------------------------------------------------------------------
	0x0058 tcon_v_sync_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsyn_st_val                     : 8;	//  0: 7
} H14A0_OVI_TCON_V_SYNC_START;

/*-----------------------------------------------------------------------------
	0x005c tcon_v_sync_end ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsyn_end_val                    : 8;	//  0: 7
} H14A0_OVI_TCON_V_SYNC_END;

/*-----------------------------------------------------------------------------
	0x0060 tcon_wb_rgain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_r_gain                       :16;	//  0:15
} H14A0_OVI_TCON_WB_RGAIN;

/*-----------------------------------------------------------------------------
	0x0068 tcon_wb_roffset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_r_offset                     :16;	//  0:15
} H14A0_OVI_TCON_WB_ROFFSET;

/*-----------------------------------------------------------------------------
	0x0070 tcon_wb_ggain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_g_gain                       :16;	//  0:15
} H14A0_OVI_TCON_WB_GGAIN;

/*-----------------------------------------------------------------------------
	0x0078 tcon_wb_goffset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_g_offset                     :16;	//  0:15
} H14A0_OVI_TCON_WB_GOFFSET;

/*-----------------------------------------------------------------------------
	0x0080 tcon_wb_bgain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_b_gain                       :16;	//  0:15
} H14A0_OVI_TCON_WB_BGAIN;

/*-----------------------------------------------------------------------------
	0x0088 tcon_wb_boffset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_b_offset                     :16;	//  0:15
} H14A0_OVI_TCON_WB_BOFFSET;

/*-----------------------------------------------------------------------------
	0x0090 tcon_sgen_hbp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_hbp                        : 8;	//  0: 7
} H14A0_OVI_TCON_SGEN_HBP;

/*-----------------------------------------------------------------------------
	0x0094 tcon_sgen_hs ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_hs                         : 8;	//  0: 7
} H14A0_OVI_TCON_SGEN_HS;

/*-----------------------------------------------------------------------------
	0x0098 tcon_sgen_hfp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_hfp                        : 8;	//  0: 7
} H14A0_OVI_TCON_SGEN_HFP;

/*-----------------------------------------------------------------------------
	0x009c tcon_sgen_vbp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_vbp                        : 8;	//  0: 7
} H14A0_OVI_TCON_SGEN_VBP;

/*-----------------------------------------------------------------------------
	0x00a0 tcon_sgen_vs ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_vs                         : 8;	//  0: 7
} H14A0_OVI_TCON_SGEN_VS;

/*-----------------------------------------------------------------------------
	0x00a4 tcon_sgen_vfp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_vfp                        : 8;	//  0: 7
} H14A0_OVI_TCON_SGEN_VFP;

/*-----------------------------------------------------------------------------
	0x00a8 tcon_sgen_dewidth ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_dewidth                    :11;	//  0:10
} H14A0_OVI_TCON_SGEN_DEWIDTH;

/*-----------------------------------------------------------------------------
	0x00b0 tcon_sgen_denum ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sgen_denumber                   :12;	//  0:11
} H14A0_OVI_TCON_SGEN_DENUM;

/*-----------------------------------------------------------------------------
	0x00b8 tcon_vblank_width ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ver_blank_width                 : 8;	//  0: 7
} H14A0_OVI_TCON_VBLANK_WIDTH;

/*-----------------------------------------------------------------------------
	0x00bc tcon_vsync_width ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsync_width                     : 8;	//  0: 7
} H14A0_OVI_TCON_VSYNC_WIDTH;

/*-----------------------------------------------------------------------------
	0x00c0 tcon_abn_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	abn_en                          : 1;	//     0
} H14A0_OVI_TCON_ABN_EN;

/*-----------------------------------------------------------------------------
	0x00d4 tcon_pgen_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_test                       : 1,	//     0
	pgen_sync_mode                  : 1,	//     1
	pgen_reverse                    : 1,	//     2
	pgen_mode_4_0                   : 5;	//  3: 7
} H14A0_OVI_TCON_PGEN_CTL;

/*-----------------------------------------------------------------------------
	0x00d8 tcon_mode_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mode_test                       : 1,	//     0
	mode_test_sel                   : 1;	//     1
} H14A0_OVI_TCON_MODE_CTL;

/*-----------------------------------------------------------------------------
	0x00dc tcon_pgen_vscr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_vscr_en                    : 1,	//     0
	pgen_vscr_up                    : 1,	//     1
	pgen_vscr_val                   : 6;	//  2: 7
} H14A0_OVI_TCON_PGEN_VSCR;

/*-----------------------------------------------------------------------------
	0x00e0 tcon_pgen_hscr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_hscr_en                    : 1,	//     0
	pgen_hscr_left                  : 1,	//     1
	pgen_hscr_val                   : 6;	//  2: 7
} H14A0_OVI_TCON_PGEN_HSCR;

/*-----------------------------------------------------------------------------
	0x00e4 tcon_pgen_agpr1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_r1                   :10;	//  0: 9
} H14A0_OVI_TCON_PGEN_AGPR1;

/*-----------------------------------------------------------------------------
	0x00ec tcon_pgen_agpg1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_g1                   :10;	//  0: 9
} H14A0_OVI_TCON_PGEN_AGPG1;

/*-----------------------------------------------------------------------------
	0x00f4 tcon_pgen_agpb1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_b1                   :10;	//  0: 9
} H14A0_OVI_TCON_PGEN_AGPB1;

/*-----------------------------------------------------------------------------
	0x00fc tcon_pgen_agpr2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_r2                   :10;	//  0: 9
} H14A0_OVI_TCON_PGEN_AGPR2;

/*-----------------------------------------------------------------------------
	0x0104 tcon_pgen_agpg2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_g2                   :10;	//  0: 9
} H14A0_OVI_TCON_PGEN_AGPG2;

/*-----------------------------------------------------------------------------
	0x010c tcon_pgen_agpb2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_color_b2                   :10;	//  0: 9
} H14A0_OVI_TCON_PGEN_AGPB2;

/*-----------------------------------------------------------------------------
	0x0114 tcon_pgen_vline1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_vline1                     :12;	//  0:11
} H14A0_OVI_TCON_PGEN_VLINE1;

/*-----------------------------------------------------------------------------
	0x011c tcon_pgen_vline2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_vline2                     :12;	//  0:11
} H14A0_OVI_TCON_PGEN_VLINE2;

/*-----------------------------------------------------------------------------
	0x0124 tcon_pgen_hline1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_hpixel1                    :12;	//  0:11
} H14A0_OVI_TCON_PGEN_HLINE1;

/*-----------------------------------------------------------------------------
	0x012c tcon_pgen_hline2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_hpixel2                    :12;	//  0:11
} H14A0_OVI_TCON_PGEN_HLINE2;

/*-----------------------------------------------------------------------------
	0x0134 tcon_pgen_x1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_x1_11_0                    :12;	//  0:11
} H14A0_OVI_TCON_PGEN_X1;

/*-----------------------------------------------------------------------------
	0x013c tcon_pgen_x2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_x2_11_0                    :12;	//  0:11
} H14A0_OVI_TCON_PGEN_X2;

/*-----------------------------------------------------------------------------
	0x0144 tcon_pgen_y1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_y1_11_0                    :12;	//  0:11
} H14A0_OVI_TCON_PGEN_Y1;

/*-----------------------------------------------------------------------------
	0x014c tcon_pgen_y2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pgen_y2_11_0                    :12;	//  0:11
} H14A0_OVI_TCON_PGEN_Y2;

/*-----------------------------------------------------------------------------
	0x0154 tcon_dither_carry ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither_sel                      : 3;	//  0: 2
} H14A0_OVI_TCON_DITHER_CARRY;

/*-----------------------------------------------------------------------------
	0x0160 tcon_base_address ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	base_address                    ;   	// 0: 31
} H14A0_OVI_TCON_BASE_ADDRESS;

/*-----------------------------------------------------------------------------
	0x0170 tcon_offset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          ;   	// 0: 31
} H14A0_OVI_TCON_OFFSET;

/*-----------------------------------------------------------------------------
	0x0174 tcon_axi_gate ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bus_access_gating_r             : 1,	//     0
	bus_access_gating_w             : 1;	//     1
} H14A0_OVI_TCON_AXI_GATE;

/*-----------------------------------------------------------------------------
	0x0178 tcon_axi_gate_monitor ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bus_cmd_access_in_gating_r      : 1,	//     0
	bus_cmd_access_in_gating_w      : 1,	//     1
	bus_data_access_in_gating_w     : 1;	//     2
} H14A0_OVI_TCON_AXI_GATE_MONITOR;

/*-----------------------------------------------------------------------------
	0x0180 tcon_pri_user ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	write_priority                  : 3,	//  0: 2
	_rsvd_00                      : 1,	//     3
	read_priority                   : 3,	//  4: 6
	_rsvd_01                      : 1;	//     7
} H14A0_OVI_TCON_PRI_USER;

/*-----------------------------------------------------------------------------
	0x0184 tcon_axi_status0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err0_cnt              ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS0;

/*-----------------------------------------------------------------------------
	0x0188 tcon_axi_status1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err1_cnt              ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS1;

/*-----------------------------------------------------------------------------
	0x018c tcon_axi_status2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err2_cnt              ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS2;

/*-----------------------------------------------------------------------------
	0x0190 tcon_axi_status3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err3_cnt              ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS3;

/*-----------------------------------------------------------------------------
	0x0194 tcon_axi_status4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_write_err4_cnt              ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS4;

/*-----------------------------------------------------------------------------
	0x0198 tcon_axi_status5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_sequence_err                ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS5;

/*-----------------------------------------------------------------------------
	0x019c tcon_axi_ctl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	flush_en_vsync                  : 1,	//     0
	flush_en_cpu                    : 1,	//     1
	flush_en_self                   : 1,	//     2
	flush_done_mask                 : 1;	//     3
} H14A0_OVI_TCON_AXI_CTL;

/*-----------------------------------------------------------------------------
	0x01a0 tcon_axi_write_wait ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	write_wait                      : 8;	//  0: 7
} H14A0_OVI_TCON_AXI_WRITE_WAIT;

/*-----------------------------------------------------------------------------
	0x01a4 tcon_axi_read_wait ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	read_wait                       : 8;	//  0: 7
} H14A0_OVI_TCON_AXI_READ_WAIT;

/*-----------------------------------------------------------------------------
	0x01a8 tcon_axi_burst_wait ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	burst_wait                      : 8;	//  0: 7
} H14A0_OVI_TCON_AXI_BURST_WAIT;

/*-----------------------------------------------------------------------------
	0x01ac tcon_tmp0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01b0 tcon_tmp1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01b4 tcon_tmp2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01b8 tcon_tmp3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01bc tcon_tmp4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01c0 tcon_tmp5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01c4 tcon_tmp6 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01c8 tcon_tmp7 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01cc tcon_tmp8 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01d0 tcon_tmp9 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x01d4 tcon_mem_ls ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	odc_ls_en                       : 1,	//     0
	axi_ls_en                       : 1,	//     1
	dga_ls_en                       : 1,	//     2
	dither_ls_en                    : 1,	//     3
	_rsvd                      : 4;	//     4:7
} H14A0_OVI_TCON_MEM_LS;

/*-----------------------------------------------------------------------------
	0x01d8 tcon_mon_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mon_sel0                        : 1,	//     0
	mon_sel1                        : 1;	//     1
} H14A0_OVI_TCON_MON_SEL;

/*-----------------------------------------------------------------------------
	0x01dc tcon_init_test ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	init1_test                      : 1,	//     0
	init2_test                      : 1;	//     1
} H14A0_OVI_TCON_INIT_TEST;

/*-----------------------------------------------------------------------------
	0x01e0 tcon_axi_status6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_read_err0_cnt               ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS6;

/*-----------------------------------------------------------------------------
	0x01e4 tcon_axi_status7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_read_err1_cnt               ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS7;

/*-----------------------------------------------------------------------------
	0x01e8 tcon_axi_status8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	axi_read_err2_cnt               ;   	// 0: 31
} H14A0_OVI_TCON_AXI_STATUS8;

/*-----------------------------------------------------------------------------
	0x01ec tcon_axi_status9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	_rsvd                           ;	//  0: 31
} H14A0_OVI_TCON_AXI_STATUS9;

/*-----------------------------------------------------------------------------
	0x01f0 tcon_bit_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bit_sel                          : 1;	//     0
} H14A0_OVI_TCON_BIT_SEL;

/*-----------------------------------------------------------------------------
	0x01f4 tcon_x_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x_start                         :11;	//  0:10
} H14A0_OVI_TCON_X_START;

/*-----------------------------------------------------------------------------
	0x01fc tcon_x_end ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x_end                           :11;	//  0:10
} H14A0_OVI_TCON_X_END;

/*-----------------------------------------------------------------------------
	0x0204 tcon_y_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_start                         :11;	//  0:10
} H14A0_OVI_TCON_Y_START;

/*-----------------------------------------------------------------------------
	0x020c tcon_y_end ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_end                           :11;	//  0:10
} H14A0_OVI_TCON_Y_END;

/*-----------------------------------------------------------------------------
	0x0214 tcon_th_gray_diff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gray_diff_th                    :10;	//  0: 9
} H14A0_OVI_TCON_TH_GRAY_DIFF;

/*-----------------------------------------------------------------------------
	0x021c tcon_th_pat_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_th                    :20;	//  0:19
} H14A0_OVI_TCON_TH_PAT_VALUE;

/*-----------------------------------------------------------------------------
	0x0228 tcon_pat_id_hold ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_id_hold                     : 1;	//     0
} H14A0_OVI_TCON_PAT_ID_HOLD;

/*-----------------------------------------------------------------------------
	0x022c tcon_pat_id_dec ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_id_dec                      : 4;	//  0: 3
} H14A0_OVI_TCON_PAT_ID_DEC;

/*-----------------------------------------------------------------------------
	0x0230 tcon_pat_id_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_id_1                        : 4;	//  0: 3
} H14A0_OVI_TCON_PAT_ID_1;

/*-----------------------------------------------------------------------------
	0x0234 tcon_pat_value_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_1                     :20;	//  0:19
} H14A0_OVI_TCON_PAT_VALUE_1;

/*-----------------------------------------------------------------------------
	0x0240 tcon_pat_id_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_id_2                        : 4;	//  0: 3
} H14A0_OVI_TCON_PAT_ID_2;

/*-----------------------------------------------------------------------------
	0x0244 tcon_pat_value_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_value_2                     :20;	//  0:19
} H14A0_OVI_TCON_PAT_VALUE_2;

/*-----------------------------------------------------------------------------
	0x0250 tcon_pat_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_mask                        :10;	//  0: 9
} H14A0_OVI_TCON_PAT_MASK;

/*-----------------------------------------------------------------------------
	0x0258 tcon_frontdummy ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fdummy                          : 4;	//  0: 3
} H14A0_OVI_TCON_FRONTDUMMY;

/*-----------------------------------------------------------------------------
	0x025c tcon_backdummy ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bdummy                          : 5;	//  0: 4
} H14A0_OVI_TCON_BACKDUMMY;

/*-----------------------------------------------------------------------------
	0x0260 tcon_vertline ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vline                           :12;	//  0:11
} H14A0_OVI_TCON_VERTLINE;

/*-----------------------------------------------------------------------------
	0x0264 tcon_ltd_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ltd_right                       : 1,	//     0
	ltd_even                        : 1,	//     1
	ltd_en                          : 1,	//     2
	ltd_v14                         : 1;	//     3
} H14A0_OVI_TCON_LTD_MODE;

/*-----------------------------------------------------------------------------
	0x0268 tcon_rgb_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgb_sel_b1                      : 3,	//  0: 2
	rgb_sel_b0                      : 3,	//  3: 5
	rgb_sel_g1                      : 3,	//  6: 8
	rgb_sel_g0                      : 3,	//  9:11
	rgb_sel_r1                      : 3,	// 12:14
	rgb_sel_r0                      : 3,	// 15:17
	rgb_sel_en                      : 1;	//    18
} H14A0_OVI_TCON_RGB_SEL;

/*-----------------------------------------------------------------------------
	0x026c tcon_hor_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hor_reverse                     : 1,	//     0
	hor_divide                      : 1;	//     1
} H14A0_OVI_TCON_HOR_MODE;

/*-----------------------------------------------------------------------------
	0x0270 tcon_dfhd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dfhd                            : 1;	//     0
} H14A0_OVI_TCON_DFHD;

/*-----------------------------------------------------------------------------
	0x0274 tcon_mtest_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_en                        : 1;	//     0
} H14A0_OVI_TCON_MTEST_EN;

/*-----------------------------------------------------------------------------
	0x0278 tcon_mtest_pr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_pr                        : 8;	//  0: 7
} H14A0_OVI_TCON_MTEST_PR;

/*-----------------------------------------------------------------------------
	0x027c tcon_mtest_pg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_pg                        : 8;	//  0: 7
} H14A0_OVI_TCON_MTEST_PG;

/*-----------------------------------------------------------------------------
	0x0280 tcon_mtest_pb ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mtest_pb                        : 8;	//  0: 7
} H14A0_OVI_TCON_MTEST_PB;

/*-----------------------------------------------------------------------------
	0x0284 tcon_epi_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_mode                         : 1,	//     0
	epi_num                         : 2,	//  1: 2
	epi_sel_en                      : 1,	//     3
	epi_last_en                     : 1,	//     4
	drd_mode                        : 1;	//     5
} H14A0_OVI_TCON_EPI_MODE;

/*-----------------------------------------------------------------------------
	0x0288 tcon_epi_sel0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel0                        ;   	// 31: 0
} H14A0_OVI_TCON_EPI_SEL0;

/*-----------------------------------------------------------------------------
	0x028c tcon_epi_sel1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_sel1                        ;   	// 31: 0
} H14A0_OVI_TCON_EPI_SEL1;

/*-----------------------------------------------------------------------------
	0x0290 tcon_epi_ctr1_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr1_0                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR1_0;

/*-----------------------------------------------------------------------------
	0x0294 tcon_epi_ctr1_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr1_1                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR1_1;

/*-----------------------------------------------------------------------------
	0x0298 tcon_epi_ctr1_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr1_2                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR1_2;

/*-----------------------------------------------------------------------------
	0x029c tcon_epi_ctr1_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr1_3                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR1_3;

/*-----------------------------------------------------------------------------
	0x02a0 tcon_epi_ctr1_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr1_4                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR1_4;

/*-----------------------------------------------------------------------------
	0x02a4 tcon_epi_ctr1_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr1_5                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR1_5;

/*-----------------------------------------------------------------------------
	0x02a8 tcon_epi_ctr1_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr1_6                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR1_6;

/*-----------------------------------------------------------------------------
	0x02ac tcon_epi_ctr1_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr1_7                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR1_7;

/*-----------------------------------------------------------------------------
	0x02c0 tcon_epi_ctr2_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr2_0                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR2_0;

/*-----------------------------------------------------------------------------
	0x02c4 tcon_epi_ctr2_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr2_1                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR2_1;

/*-----------------------------------------------------------------------------
	0x02c8 tcon_epi_ctr2_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr2_2                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR2_2;

/*-----------------------------------------------------------------------------
	0x02cc tcon_epi_ctr2_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr2_3                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR2_3;

/*-----------------------------------------------------------------------------
	0x02d0 tcon_epi_ctr2_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr2_4                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR2_4;

/*-----------------------------------------------------------------------------
	0x02d4 tcon_epi_ctr2_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr2_5                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR2_5;

/*-----------------------------------------------------------------------------
	0x02d8 tcon_epi_ctr2_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr2_6                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR2_6;

/*-----------------------------------------------------------------------------
	0x02dc tcon_epi_ctr2_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	epi_ctr2_7                      :24;	//  0:23
} H14A0_OVI_TCON_EPI_CTR2_7;

/*-----------------------------------------------------------------------------
	0x030c tcon_drd_h_blank ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	drd_hblank                      : 9;	//  0: 8
} H14A0_OVI_TCON_DRD_H_BLANK;

/*-----------------------------------------------------------------------------
	0x0318 tcon_gspline ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gspline                         :11;	//  0:10
} H14A0_OVI_TCON_GSPLINE;

/*-----------------------------------------------------------------------------
	0x031c tcon_dpm_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpm_on_fra0                     : 1,	//     0
	dpm_on_fra1                     : 1,	//     1
	dpm_on_fra2                     : 1,	//     2
	dpm_on_fra3                     : 1,	//     3
	dpm_mask_fra0                   : 1,	//     4
	dpm_mask_fra1                   : 1,	//     5
	dpm_mask_fra2                   : 1,	//     6
	dpm_mask_fra3                   : 1;	//     7
} H14A0_OVI_TCON_DPM_CNT;

/*-----------------------------------------------------------------------------
	0x0320 tcon_vst_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_en                          : 1,	//     0
	vst_m1_en                       : 1,	//     1
	vst_m2_en                       : 1,	//     2
	vst_m3_en                       : 1,	//     3
	vst_p2_en                       : 2,	//  4: 5
	vst_v_m_d                       : 1,	//     6
	_rsvd                      : 1;	//     7
} H14A0_OVI_TCON_VST_CONTROL;

/*-----------------------------------------------------------------------------
	0x0324 tcon_vst_dpm ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_pre_dpm_en                  : 1,	//     0
	vst_dpm_en                      : 1,	//     1
	vst_post_dpm_en                 : 1,	//     2
	vst_dm_d                        : 1,	//     3
	_rsvd                      : 4;	//     4:7
} H14A0_OVI_TCON_VST_DPM;

/*-----------------------------------------------------------------------------
	0x0328 tcon_vst_m1_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_line1                    :12;	//  0:11
} H14A0_OVI_TCON_VST_M1_LINE1;

/*-----------------------------------------------------------------------------
	0x032c tcon_vst_m1_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_line2                    :12;	//  0:11
} H14A0_OVI_TCON_VST_M1_LINE2;

/*-----------------------------------------------------------------------------
	0x0330 tcon_vst_m1_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_pix1                     :12;	//  0:11
} H14A0_OVI_TCON_VST_M1_PIX1;

/*-----------------------------------------------------------------------------
	0x0334 tcon_vst_m1_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_pix2                     :12;	//  0:11
} H14A0_OVI_TCON_VST_M1_PIX2;

/*-----------------------------------------------------------------------------
	0x0338 tcon_vst_m1_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m1_d                        : 3;	//  0: 2
} H14A0_OVI_TCON_VST_M1_D;

/*-----------------------------------------------------------------------------
	0x033c tcon_vst_m2_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_line1                    :12;	//  0:11
} H14A0_OVI_TCON_VST_M2_LINE1;

/*-----------------------------------------------------------------------------
	0x0340 tcon_vst_m2_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_line2                    :12;	//  0:11
} H14A0_OVI_TCON_VST_M2_LINE2;

/*-----------------------------------------------------------------------------
	0x0344 tcon_vst_m2_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_pix1                     :12;	//  0:11
} H14A0_OVI_TCON_VST_M2_PIX1;

/*-----------------------------------------------------------------------------
	0x0348 tcon_vst_m2_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_pix2                     :12;	//  0:11
} H14A0_OVI_TCON_VST_M2_PIX2;

/*-----------------------------------------------------------------------------
	0x034c tcon_vst_m2_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m2_d                        : 3;	//  0: 2
} H14A0_OVI_TCON_VST_M2_D;

/*-----------------------------------------------------------------------------
	0x0350 tcon_vst_m3_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_line1                    :12;	//  0:11
} H14A0_OVI_TCON_VST_M3_LINE1;

/*-----------------------------------------------------------------------------
	0x0354 tcon_vst_m3_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_line2                    :12;	//  0:11
} H14A0_OVI_TCON_VST_M3_LINE2;

/*-----------------------------------------------------------------------------
	0x0358 tcon_vst_m3_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_pix1                     :12;	//  0:11
} H14A0_OVI_TCON_VST_M3_PIX1;

/*-----------------------------------------------------------------------------
	0x035c tcon_vst_m3_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_pix2                     :12;	//  0:11
} H14A0_OVI_TCON_VST_M3_PIX2;

/*-----------------------------------------------------------------------------
	0x0360 tcon_vst_m3_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_m3_d                        : 3;	//  0: 2
} H14A0_OVI_TCON_VST_M3_D;

/*-----------------------------------------------------------------------------
	0x0364 tcon_vst_p1_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p2_line                     : 4;	//  0: 3
} H14A0_OVI_TCON_VST_P1_LINE;

/*-----------------------------------------------------------------------------
	0x0368 tcon_vst_p1_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p1_pix1                     :12;	//  0:11
} H14A0_OVI_TCON_VST_P1_PIX1;

/*-----------------------------------------------------------------------------
	0x036c tcon_vst_p1_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p1_pix2                     :12;	//  0:11
} H14A0_OVI_TCON_VST_P1_PIX2;

/*-----------------------------------------------------------------------------
	0x0370 tcon_vst_p1_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p1_d                        : 3;	//  0: 2
} H14A0_OVI_TCON_VST_P1_D;

/*-----------------------------------------------------------------------------
	0x0374 tcon_vst_p2_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p2_line                     : 4;	//  0: 3
} H14A0_OVI_TCON_VST_P2_LINE;

/*-----------------------------------------------------------------------------
	0x0378 tcon_vst_p2_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p2_pix1                     :12;	//  0:11
} H14A0_OVI_TCON_VST_P2_PIX1;

/*-----------------------------------------------------------------------------
	0x037c tcon_vst_p2_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p2_pix2                     :12;	//  0:11
} H14A0_OVI_TCON_VST_P2_PIX2;

/*-----------------------------------------------------------------------------
	0x0380 tcon_vst_p2_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_p2_d                        : 3;	//  0: 2
} H14A0_OVI_TCON_VST_P2_D;

/*-----------------------------------------------------------------------------
	0x0384 tcon_vst_abn_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_pix1                    :24;	//  0:23
} H14A0_OVI_TCON_VST_ABN_PIX1;

/*-----------------------------------------------------------------------------
	0x0388 tcon_vst_abn_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_pix2                    :24;	//  0:23
} H14A0_OVI_TCON_VST_ABN_PIX2;

/*-----------------------------------------------------------------------------
	0x038c tcon_vst_abn_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vst_abn_d0                      : 1,	//     0
	vst_abn_d1                      : 1,	//     1
	vst_abn_d2                      : 1;	//     2
} H14A0_OVI_TCON_VST_ABN_D;

/*-----------------------------------------------------------------------------
	0x0390 tcon_gclk_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_en                         : 1,	//     0
	gclk_m1_en                      : 1,	//     1
	gclk_m2_en                      : 1,	//     2
	gclk_m3_en                      : 1,	//     3
	gclk_p2_en                      : 2,	//  4: 5
	gclk_v_m_d                      : 1;	//     6
} H14A0_OVI_TCON_GCLK_CONTROL;

/*-----------------------------------------------------------------------------
	0x0394 tcon_gclk_dpm ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_pre_dpm_en                 : 1,	//     0
	gclk_dpm_en                     : 1,	//     1
	gclk_post_dpm_en                : 1,	//     2
	gclk_dm_d                       : 1;	//     3
} H14A0_OVI_TCON_GCLK_DPM;

/*-----------------------------------------------------------------------------
	0x0398 tcon_gclk_m1_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_line1                   :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M1_LINE1;

/*-----------------------------------------------------------------------------
	0x039c tcon_gclk_m1_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_line2                   :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M1_LINE2;

/*-----------------------------------------------------------------------------
	0x03a0 tcon_gclk_m1_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M1_PIX1;

/*-----------------------------------------------------------------------------
	0x03a4 tcon_gclk_m1_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M1_PIX2;

/*-----------------------------------------------------------------------------
	0x03a8 tcon_gclk_m1_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m1_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_GCLK_M1_D;

/*-----------------------------------------------------------------------------
	0x03ac tcon_gclk_m2_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_line1                   :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M2_LINE1;

/*-----------------------------------------------------------------------------
	0x03b0 tcon_gclk_m2_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_line2                   :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M2_LINE2;

/*-----------------------------------------------------------------------------
	0x03b4 tcon_gclk_m2_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M2_PIX1;

/*-----------------------------------------------------------------------------
	0x03b8 tcon_gclk_m2_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M2_PIX2;

/*-----------------------------------------------------------------------------
	0x03bc tcon_gclk_m2_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m2_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_GCLK_M2_D;

/*-----------------------------------------------------------------------------
	0x03c0 tcon_gclk_m3_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_line1                   :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M3_LINE1;

/*-----------------------------------------------------------------------------
	0x03c4 tcon_gclk_m3_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_line2                   :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M3_LINE2;

/*-----------------------------------------------------------------------------
	0x03c8 tcon_gclk_m3_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M3_PIX1;

/*-----------------------------------------------------------------------------
	0x03cc tcon_gclk_m3_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_M3_PIX2;

/*-----------------------------------------------------------------------------
	0x03d0 tcon_gclk_m3_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_m3_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_GCLK_M3_D;

/*-----------------------------------------------------------------------------
	0x03d4 tcon_gclk_p1_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p2_line                    : 4;	//  0: 3
} H14A0_OVI_TCON_GCLK_P1_LINE;

/*-----------------------------------------------------------------------------
	0x03d8 tcon_gclk_p1_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p1_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_P1_PIX1;

/*-----------------------------------------------------------------------------
	0x03dc tcon_gclk_p1_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p1_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_P1_PIX2;

/*-----------------------------------------------------------------------------
	0x03e0 tcon_gclk_p1_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p1_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_GCLK_P1_D;

/*-----------------------------------------------------------------------------
	0x03e4 tcon_gclk_p2_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p2_line                    : 4;	//  0: 3
} H14A0_OVI_TCON_GCLK_P2_LINE;

/*-----------------------------------------------------------------------------
	0x03e8 tcon_gclk_p2_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p2_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_P2_PIX1;

/*-----------------------------------------------------------------------------
	0x03ec tcon_gclk_p2_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p2_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_GCLK_P2_PIX2;

/*-----------------------------------------------------------------------------
	0x03f0 tcon_gclk_p2_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gclk_p2_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_GCLK_P2_D;

/*-----------------------------------------------------------------------------
	0x03f4 tcon_mclk_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_en                         : 1,	//     0
	mclk_m1_en                      : 1,	//     1
	mclk_m2_en                      : 1,	//     2
	mclk_m3_en                      : 1,	//     3
	mclk_p2_en                      : 2,	//  4: 5
	mclk_v_m_d                      : 1;	//     6
} H14A0_OVI_TCON_MCLK_CONTROL;

/*-----------------------------------------------------------------------------
	0x03f8 tcon_mclk_dpm ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_pre_dpm_en                 : 1,	//     0
	mclk_dpm_en                     : 1,	//     1
	mclk_post_dpm_en                : 1,	//     2
	mclk_dm_d                       : 1;	//     3
} H14A0_OVI_TCON_MCLK_DPM;

/*-----------------------------------------------------------------------------
	0x03fc tcon_mclk_m1_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_line1                   :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M1_LINE1;

/*-----------------------------------------------------------------------------
	0x0400 tcon_mclk_m1_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_line2                   :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M1_LINE2;

/*-----------------------------------------------------------------------------
	0x0404 tcon_mclk_m1_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M1_PIX1;

/*-----------------------------------------------------------------------------
	0x0408 tcon_mclk_m1_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M1_PIX2;

/*-----------------------------------------------------------------------------
	0x040c tcon_mclk_m1_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m1_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_MCLK_M1_D;

/*-----------------------------------------------------------------------------
	0x0410 tcon_mclk_m2_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_line1                   :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M2_LINE1;

/*-----------------------------------------------------------------------------
	0x0414 tcon_mclk_m2_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_line2                   :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M2_LINE2;

/*-----------------------------------------------------------------------------
	0x0418 tcon_mclk_m2_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M2_PIX1;

/*-----------------------------------------------------------------------------
	0x041c tcon_mclk_m2_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M2_PIX2;

/*-----------------------------------------------------------------------------
	0x0420 tcon_mclk_m2_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m2_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_MCLK_M2_D;

/*-----------------------------------------------------------------------------
	0x0424 tcon_mclk_m3_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_line1                   :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M3_LINE1;

/*-----------------------------------------------------------------------------
	0x0428 tcon_mclk_m3_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_line2                   :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M3_LINE2;

/*-----------------------------------------------------------------------------
	0x042c tcon_mclk_m3_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M3_PIX1;

/*-----------------------------------------------------------------------------
	0x0430 tcon_mclk_m3_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_M3_PIX2;

/*-----------------------------------------------------------------------------
	0x0434 tcon_mclk_m3_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_m3_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_MCLK_M3_D;

/*-----------------------------------------------------------------------------
	0x0438 tcon_mclk_p1_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_line                    : 4;	//  0: 3
} H14A0_OVI_TCON_MCLK_P1_LINE;

/*-----------------------------------------------------------------------------
	0x043c tcon_mclk_p1_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_P1_PIX1;

/*-----------------------------------------------------------------------------
	0x0440 tcon_mclk_p1_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_P1_PIX2;

/*-----------------------------------------------------------------------------
	0x0444 tcon_mclk_p1_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p1_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_MCLK_P1_D;

/*-----------------------------------------------------------------------------
	0x0448 tcon_mclk_p2_line ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p2_line                    : 4;	//  0: 3
} H14A0_OVI_TCON_MCLK_P2_LINE;

/*-----------------------------------------------------------------------------
	0x044c tcon_mclk_p2_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p2_pix1                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_P2_PIX1;

/*-----------------------------------------------------------------------------
	0x0450 tcon_mclk_p2_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p2_pix2                    :12;	//  0:11
} H14A0_OVI_TCON_MCLK_P2_PIX2;

/*-----------------------------------------------------------------------------
	0x0454 tcon_mclk_p2_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mclk_p2_d                       : 3;	//  0: 2
} H14A0_OVI_TCON_MCLK_P2_D;

/*-----------------------------------------------------------------------------
	0x0458 tcon_eo_fcon_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_en                      : 1,	//     0
	eo_fcon_f2_en                   : 1;	//     1
} H14A0_OVI_TCON_EO_FCON_CONTROL;

/*-----------------------------------------------------------------------------
	0x045c tcon_eo_fcon_dpm ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_pre_dpm_en              : 1,	//     0
	eo_fcon_dpm_en                  : 1,	//     1
	eo_fcon_post_dpm_en             : 1,	//     2
	eo_fcon_dm_d                    : 1;	//     3
} H14A0_OVI_TCON_EO_FCON_DPM;

/*-----------------------------------------------------------------------------
	0x0460 tcon_eo_fcon_f1_fra ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_fra                  :11;	//  0:10
} H14A0_OVI_TCON_EO_FCON_F1_FRA;

/*-----------------------------------------------------------------------------
	0x0464 tcon_eo_fcon_f1_line1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_line1                :12;	//  0:11
} H14A0_OVI_TCON_EO_FCON_F1_LINE1;

/*-----------------------------------------------------------------------------
	0x0468 tcon_eo_fcon_f1_line2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_line2                :12;	//  0:11
} H14A0_OVI_TCON_EO_FCON_F1_LINE2;

/*-----------------------------------------------------------------------------
	0x046c tcon_eo_fcon_f1_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_pix1                 :12;	//  0:11
} H14A0_OVI_TCON_EO_FCON_F1_PIX1;

/*-----------------------------------------------------------------------------
	0x0470 tcon_eo_fcon_f1_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_pix2                 :12;	//  0:11
} H14A0_OVI_TCON_EO_FCON_F1_PIX2;

/*-----------------------------------------------------------------------------
	0x0474 tcon_eo_fcon_f1_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_fcon_f1_d                    : 4;	//  0: 3
} H14A0_OVI_TCON_EO_FCON_F1_D;

/*-----------------------------------------------------------------------------
	0x0480 tcon_eo_abn_pix1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_pix1                     :24;	//  0:23
} H14A0_OVI_TCON_EO_ABN_PIX1;

/*-----------------------------------------------------------------------------
	0x0484 tcon_eo_abn_pix2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_pix2                     :24;	//  0:23
} H14A0_OVI_TCON_EO_ABN_PIX2;

/*-----------------------------------------------------------------------------
	0x0488 tcon_eo_abn_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	eo_abn_d0                       : 1,	//     0
	eo_abn_d1                       : 1,	//     1
	eo_abn_d2                       : 1;	//     2
} H14A0_OVI_TCON_EO_ABN_D;

/*-----------------------------------------------------------------------------
	0x048c tcon_pol_normal ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	normal_frame_num                : 3,	//  0: 2
	normal_h_conv                   : 1,	//     3
	normal_line_num                 : 2,	//  4: 5
	normal_line_t                   : 1,	//     6
	normal_pol_t                    : 1;	//     7
} H14A0_OVI_TCON_POL_NORMAL;

/*-----------------------------------------------------------------------------
	0x0490 tcon_pol_dpc1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc1_frame_num                  : 3,	//  0: 2
	dpc1_h_conv                     : 1,	//     3
	dpc1_line_num                   : 2,	//  4: 5
	dpc1_line_t                     : 1,	//     6
	dpc1_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC1;

/*-----------------------------------------------------------------------------
	0x0494 tcon_pol_dpc2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc2_frame_num                  : 3,	//  0: 2
	dpc2_h_conv                     : 1,	//     3
	dpc2_line_num                   : 2,	//  4: 5
	dpc2_line_t                     : 1,	//     6
	dpc2_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC2;

/*-----------------------------------------------------------------------------
	0x0498 tcon_pol_dpc3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc3_frame_num                  : 3,	//  0: 2
	dpc3_h_conv                     : 1,	//     3
	dpc3_line_num                   : 2,	//  4: 5
	dpc3_line_t                     : 1,	//     6
	dpc3_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC3;

/*-----------------------------------------------------------------------------
	0x049c tcon_pol_dpc4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc4_frame_num                  : 3,	//  0: 2
	dpc4_h_conv                     : 1,	//     3
	dpc4_line_num                   : 2,	//  4: 5
	dpc4_line_t                     : 1,	//     6
	dpc4_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC4;

/*-----------------------------------------------------------------------------
	0x04a0 tcon_pol_dpc5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc5_frame_num                  : 3,	//  0: 2
	dpc5_h_conv                     : 1,	//     3
	dpc5_line_num                   : 2,	//  4: 5
	dpc5_line_t                     : 1,	//     6
	dpc5_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC5;

/*-----------------------------------------------------------------------------
	0x04a4 tcon_pol_dpc6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc6_frame_num                  : 3,	//  0: 2
	dpc6_h_conv                     : 1,	//     3
	dpc6_line_num                   : 2,	//  4: 5
	dpc6_line_t                     : 1,	//     6
	dpc6_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC6;

/*-----------------------------------------------------------------------------
	0x04a8 tcon_pol_dpc7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc7_frame_num                  : 3,	//  0: 2
	dpc7_h_conv                     : 1,	//     3
	dpc7_line_num                   : 2,	//  4: 5
	dpc7_line_t                     : 1,	//     6
	dpc7_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC7;

/*-----------------------------------------------------------------------------
	0x04ac tcon_pol_dpc8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc8_frame_num                  : 3,	//  0: 2
	dpc8_h_conv                     : 1,	//     3
	dpc8_line_num                   : 2,	//  4: 5
	dpc8_line_t                     : 1,	//     6
	dpc8_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC8;

/*-----------------------------------------------------------------------------
	0x04b0 tcon_pol_dpc9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc9_frame_num                  : 3,	//  0: 2
	dpc9_h_conv                     : 1,	//     3
	dpc9_line_num                   : 2,	//  4: 5
	dpc9_line_t                     : 1,	//     6
	dpc9_pol_t                      : 1;	//     7
} H14A0_OVI_TCON_POL_DPC9;

/*-----------------------------------------------------------------------------
	0x04b4 tcon_pol_dpc10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpc10_frame_num                 : 3,	//  0: 2
	dpc10_h_conv                    : 1,	//     3
	dpc10_line_num                  : 2,	//  4: 5
	dpc10_line_t                    : 1,	//     6
	dpc10_pol_t                     : 1;	//     7
} H14A0_OVI_TCON_POL_DPC10;

/*-----------------------------------------------------------------------------
	0x04b8 tcon_hconv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	h_conv_pol                      : 1;	//     0
} H14A0_OVI_TCON_HCONV;

/*-----------------------------------------------------------------------------
	0x073c tcon_status ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0800 tcon_dga_low_rs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x13fc tcon_dga_low_re ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1400 tcon_dga_low_gs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1ffc tcon_dga_low_ge ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x2000 tcon_dga_low_bs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x2bfc tcon_dga_low_be ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x2c00 tcon_dga_med_rs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x37fc tcon_dga_med_re ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3800 tcon_dga_med_gs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x43fc tcon_dga_med_ge ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x4400 tcon_dga_med_bs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x4ffc tcon_dga_med_be ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x5000 tcon_dga_high_rs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x5bfc tcon_dga_high_re ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x5c00 tcon_dga_high_gs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x67fc tcon_dga_high_ge ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x6800 tcon_dga_high_bs ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x73fc tcon_dga_high_be ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x7400 tcon_dither_start ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x77fc tcon_dither_end ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x7800 tcon_odc_start_2d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x7c80 tcon_odc_end_2d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x7cc0 tcon_odc_start_3d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x8140 tcon_odc_end_3d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x8180 tcon_lodc_start_3d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x8600 tcon_lodc_end_3d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x8640 tcon_end ''
------------------------------------------------------------------------------*/
/*	no field */

typedef struct {
	UINT32                          	tcon_nop                     ;	// 0x0000 : ''
	H14A0_OVI_TCON_CONTROL                    	tcon_control                    ;	// 0x0004 : ''
	H14A0_OVI_TCON_TEST_CTL                   	tcon_test_ctl                   ;	// 0x0008 : ''
	H14A0_OVI_TCON_SYNC_CTL                   	tcon_sync_ctl                   ;	// 0x000c : ''
	H14A0_OVI_TCON_STS                        	tcon_sts                        ;	// 0x0010 : ''
	H14A0_OVI_TCON_DGA_SEL                    	tcon_dga_sel                    ;	// 0x0014 : ''
	H14A0_OVI_TCON_ODC_OPT1                   	tcon_odc_opt1                   ;	// 0x0018 : ''
	H14A0_OVI_TCON_ODC_OPT2                   	tcon_odc_opt2                   ;	// 0x001c : ''
	H14A0_OVI_TCON_BTC_CONFIG                 	tcon_btc_config                 ;	// 0x0020 : ''
	H14A0_OVI_TCON_BTC_CONFIG_IODC_OPT        	tcon_btc_config_iodc_opt        ;	// 0x0024 : ''
	H14A0_OVI_TCON_ODC_LUT1_OPT               	tcon_odc_lut1_opt               ;	// 0x0028 : ''
	H14A0_OVI_TCON_BTC_CONFIG_3D              	tcon_btc_config_3d              ;	// 0x002c : ''
	H14A0_OVI_TCON_BTC_CONFIG_IODC_OPT_3D     	tcon_btc_config_iodc_opt_3d     ;	// 0x0030 : ''
	H14A0_OVI_TCON_ODC_LUT2_OPT               	tcon_odc_lut2_opt               ;	// 0x0034 : ''
	H14A0_OVI_TCON_BTC_CONFIG_LODC            	tcon_btc_config_lodc            ;	// 0x0038 : ''
	H14A0_OVI_TCON_BTC_CONFIG_THRSH_R         	tcon_btc_config_thrsh_r         ;	// 0x003c : ''
	H14A0_OVI_TCON_BTC_CONFIG_THRSH_G         	tcon_btc_config_thrsh_g         ;	// 0x0040 : ''
	H14A0_OVI_TCON_BTC_CONFIG_THRSH_B         	tcon_btc_config_thrsh_b         ;	// 0x0044 : ''
	H14A0_OVI_TCON_BTC_CONFIG_THRSH_LODC_R    	tcon_btc_config_thrsh_lodc_r    ;	// 0x0048 : ''
	H14A0_OVI_TCON_BTC_CONFIG_THRSH_LODC_G    	tcon_btc_config_thrsh_lodc_g    ;	// 0x004c : ''
	H14A0_OVI_TCON_BTC_CONFIG_THRSH_LODC_B    	tcon_btc_config_thrsh_lodc_b    ;	// 0x0050 : ''
	H14A0_OVI_TCON_BTC_LINE_MARGIN            	tcon_btc_line_margin            ;	// 0x0054 : ''
	H14A0_OVI_TCON_V_SYNC_START               	tcon_v_sync_start               ;	// 0x0058 : ''
	H14A0_OVI_TCON_V_SYNC_END                 	tcon_v_sync_end                 ;	// 0x005c : ''
	H14A0_OVI_TCON_WB_RGAIN                   	tcon_wb_rgain                   ;	// 0x0060 : ''
	UINT32                          	                 _rsvd_00[   1];	// 0x0064
	H14A0_OVI_TCON_WB_ROFFSET               	tcon_wb_roffset               ;	// 0x0068 : ''
	UINT32                          	                 _rsvd_01[   1];	// 0x006c
	H14A0_OVI_TCON_WB_GGAIN                 	tcon_wb_ggain                 ;	// 0x0070 : ''
	UINT32                          	                 _rsvd_02[   1];	// 0x0074
	H14A0_OVI_TCON_WB_GOFFSET               	tcon_wb_goffset               ;	// 0x0078 : ''
	UINT32                          	                 _rsvd_03[   1];	// 0x007c
	H14A0_OVI_TCON_WB_BGAIN                 	tcon_wb_bgain                 ;	// 0x0080 : ''
	UINT32                          	                 _rsvd_04[   1];	// 0x0084
	H14A0_OVI_TCON_WB_BOFFSET               	tcon_wb_boffset               ;	// 0x0088 : ''
	UINT32                          	                 _rsvd_05[   1];	// 0x008c
	H14A0_OVI_TCON_SGEN_HBP                   	tcon_sgen_hbp                   ;	// 0x0090 : ''
	H14A0_OVI_TCON_SGEN_HS                    	tcon_sgen_hs                    ;	// 0x0094 : ''
	H14A0_OVI_TCON_SGEN_HFP                   	tcon_sgen_hfp                   ;	// 0x0098 : ''
	H14A0_OVI_TCON_SGEN_VBP                   	tcon_sgen_vbp                   ;	// 0x009c : ''
	H14A0_OVI_TCON_SGEN_VS                    	tcon_sgen_vs                    ;	// 0x00a0 : ''
	H14A0_OVI_TCON_SGEN_VFP                   	tcon_sgen_vfp                   ;	// 0x00a4 : ''
	H14A0_OVI_TCON_SGEN_DEWIDTH               	tcon_sgen_dewidth               ;	// 0x00a8 : ''
	UINT32                          	                 _rsvd_06[   1];	// 0x00ac
	H14A0_OVI_TCON_SGEN_DENUM                 	tcon_sgen_denum                 ;	// 0x00b0 : ''
	UINT32                          	                 _rsvd_07[   1];	// 0x00b4
	H14A0_OVI_TCON_VBLANK_WIDTH               	tcon_vblank_width               ;	// 0x00b8 : ''
	H14A0_OVI_TCON_VSYNC_WIDTH                	tcon_vsync_width                ;	// 0x00bc : ''
	H14A0_OVI_TCON_ABN_EN                     	tcon_abn_en                     ;	// 0x00c0 : ''
	UINT32                          	                 _rsvd_08[   4];	// 0x00c4 ~ 0x00d0
	H14A0_OVI_TCON_PGEN_CTL                   	tcon_pgen_ctl                   ;	// 0x00d4 : ''
	H14A0_OVI_TCON_MODE_CTL                   	tcon_mode_ctl                   ;	// 0x00d8 : ''
	H14A0_OVI_TCON_PGEN_VSCR                  	tcon_pgen_vscr                  ;	// 0x00dc : ''
	H14A0_OVI_TCON_PGEN_HSCR                  	tcon_pgen_hscr                  ;	// 0x00e0 : ''
	H14A0_OVI_TCON_PGEN_AGPR1                 	tcon_pgen_agpr1                 ;	// 0x00e4 : ''
	UINT32                          	                 _rsvd_09[   1];	// 0x00e8
	H14A0_OVI_TCON_PGEN_AGPG1                 	tcon_pgen_agpg1                 ;	// 0x00ec : ''
	UINT32                          	                 _rsvd_10[   1];	// 0x00f0
	H14A0_OVI_TCON_PGEN_AGPB1                 	tcon_pgen_agpb1                 ;	// 0x00f4 : ''
	UINT32                          	                 _rsvd_11[   1];	// 0x00f8
	H14A0_OVI_TCON_PGEN_AGPR2                 	tcon_pgen_agpr2                 ;	// 0x00fc : ''
	UINT32                          	                 _rsvd_12[   1];	// 0x0100
	H14A0_OVI_TCON_PGEN_AGPG2                 	tcon_pgen_agpg2                 ;	// 0x0104 : ''
	UINT32                          	                 _rsvd_13[   1];	// 0x0108
	H14A0_OVI_TCON_PGEN_AGPB2                 	tcon_pgen_agpb2                 ;	// 0x010c : ''
	UINT32                          	                 _rsvd_14[   1];	// 0x0110
	H14A0_OVI_TCON_PGEN_VLINE1                	tcon_pgen_vline1                ;	// 0x0114 : ''
	UINT32                          	                 _rsvd_15[   1];	// 0x0118
	H14A0_OVI_TCON_PGEN_VLINE2                	tcon_pgen_vline2                ;	// 0x011c : ''
	UINT32                          	                 _rsvd_16[   1];	// 0x0120
	H14A0_OVI_TCON_PGEN_HLINE1                	tcon_pgen_hline1                ;	// 0x0124 : ''
	UINT32                          	                 _rsvd_17[   1];	// 0x0128
	H14A0_OVI_TCON_PGEN_HLINE2                	tcon_pgen_hline2                ;	// 0x012c : ''
	UINT32                          	                 _rsvd_18[   1];	// 0x0130
	H14A0_OVI_TCON_PGEN_X1                    	tcon_pgen_x1                    ;	// 0x0134 : ''
	UINT32                          	                 _rsvd_19[   1];	// 0x0138
	H14A0_OVI_TCON_PGEN_X2                    	tcon_pgen_x2                    ;	// 0x013c : ''
	UINT32                          	                 _rsvd_20[   1];	// 0x0140
	H14A0_OVI_TCON_PGEN_Y1                    	tcon_pgen_y1                    ;	// 0x0144 : ''
	UINT32                          	                 _rsvd_21[   1];	// 0x0148
	H14A0_OVI_TCON_PGEN_Y2                    	tcon_pgen_y2                    ;	// 0x014c : ''
	UINT32                          	                 _rsvd_22[   1];	// 0x0150
	H14A0_OVI_TCON_DITHER_CARRY               	tcon_dither_carry               ;	// 0x0154 : ''
	UINT32                          	                 _rsvd_23[   2];	// 0x0158 ~ 0x015c
	H14A0_OVI_TCON_BASE_ADDRESS              	tcon_base_address              ;	// 0x0160 : ''
	UINT32                          	                 _rsvd_24[   3];	// 0x0164 ~ 0x016c
	H14A0_OVI_TCON_OFFSET                    	tcon_offset                    ;	// 0x0170 : ''
	H14A0_OVI_TCON_AXI_GATE                   	tcon_axi_gate                   ;	// 0x0174 : ''
	H14A0_OVI_TCON_AXI_GATE_MONITOR           	tcon_axi_gate_monitor           ;	// 0x0178 : ''
	UINT32                          	                 _rsvd_25[   1];	// 0x017c
	H14A0_OVI_TCON_PRI_USER                   	tcon_pri_user                   ;	// 0x0180 : ''
	H14A0_OVI_TCON_AXI_STATUS0                	tcon_axi_status0                ;	// 0x0184 : ''
	H14A0_OVI_TCON_AXI_STATUS1                	tcon_axi_status1                ;	// 0x0188 : ''
	H14A0_OVI_TCON_AXI_STATUS2                	tcon_axi_status2                ;	// 0x018c : ''
	H14A0_OVI_TCON_AXI_STATUS3                	tcon_axi_status3                ;	// 0x0190 : ''
	H14A0_OVI_TCON_AXI_STATUS4                	tcon_axi_status4                ;	// 0x0194 : ''
	H14A0_OVI_TCON_AXI_STATUS5                	tcon_axi_status5                ;	// 0x0198 : ''
	H14A0_OVI_TCON_AXI_CTL                    	tcon_axi_ctl                    ;	// 0x019c : ''
	H14A0_OVI_TCON_AXI_WRITE_WAIT             	tcon_axi_write_wait             ;	// 0x01a0 : ''
	H14A0_OVI_TCON_AXI_READ_WAIT              	tcon_axi_read_wait              ;	// 0x01a4 : ''
	H14A0_OVI_TCON_AXI_BURST_WAIT             	tcon_axi_burst_wait             ;	// 0x01a8 : ''
	UINT32                          	tcon_tmp0                       ;	// 0x01ac : ''
	UINT32                          	tcon_tmp1                       ;	// 0x01b0 : ''
	UINT32                          	tcon_tmp2                       ;	// 0x01b4 : ''
	UINT32                          	tcon_tmp3                       ;	// 0x01b8 : ''
	UINT32                          	tcon_tmp4                       ;	// 0x01bc : ''
	UINT32                          	tcon_tmp5                       ;	// 0x01c0 : ''
	UINT32                          	tcon_tmp6                       ;	// 0x01c4 : ''
	UINT32                          	tcon_tmp7                       ;	// 0x01c8 : ''
	UINT32                          	tcon_tmp8                       ;	// 0x01cc : ''
	UINT32                          	tcon_tmp9                       ;	// 0x01d0 : ''
	H14A0_OVI_TCON_MEM_LS                     	tcon_mem_ls                     ;	// 0x01d4 : ''
	H14A0_OVI_TCON_MON_SEL                    	tcon_mon_sel                    ;	// 0x01d8 : ''
	H14A0_OVI_TCON_INIT_TEST                  	tcon_init_test                  ;	// 0x01dc : ''
	H14A0_OVI_TCON_AXI_STATUS6                	tcon_axi_status6                ;	// 0x01e0 : ''
	H14A0_OVI_TCON_AXI_STATUS7                	tcon_axi_status7                ;	// 0x01e4 : ''
	H14A0_OVI_TCON_AXI_STATUS8                	tcon_axi_status8                ;	// 0x01e8 : ''
	H14A0_OVI_TCON_AXI_STATUS9				tcon_axi_status9                ;	// 0x01ec : ''
	H14A0_OVI_TCON_BIT_SEL					tcon_bit_sel                    ;	// 0x01f0 : ''
	H14A0_OVI_TCON_X_START                    	tcon_x_start                    ;	// 0x01f4 : ''
	UINT32                          	                 _rsvd_26[   1];	// 0x01f8
	H14A0_OVI_TCON_X_END                      	tcon_x_end                      ;	// 0x01fc : ''
	UINT32                          	                 _rsvd_27[   1];	// 0x0200
	H14A0_OVI_TCON_Y_START                    	tcon_y_start                    ;	// 0x0204 : ''
	UINT32                          	                 _rsvd_28[   1];	// 0x0208
	H14A0_OVI_TCON_Y_END                      	tcon_y_end                      ;	// 0x020c : ''
	UINT32                          	                 _rsvd_29[   1];	// 0x0210
	H14A0_OVI_TCON_TH_GRAY_DIFF               	tcon_th_gray_diff               ;	// 0x0214 : ''
	UINT32                          	                 _rsvd_30[   1];	// 0x0218
	H14A0_OVI_TCON_TH_PAT_VALUE               	tcon_th_pat_value               ;	// 0x021c : ''
	UINT32                          	                 _rsvd_31[   2];	// 0x0220 ~ 0x0224
	H14A0_OVI_TCON_PAT_ID_HOLD                	tcon_pat_id_hold                ;	// 0x0228 : ''
	H14A0_OVI_TCON_PAT_ID_DEC                 	tcon_pat_id_dec                 ;	// 0x022c : ''
	H14A0_OVI_TCON_PAT_ID_1                   	tcon_pat_id_1                   ;	// 0x0230 : ''
	H14A0_OVI_TCON_PAT_VALUE_1                	tcon_pat_value_1                ;	// 0x0234 : ''
	UINT32                          	                 _rsvd_32[   2];	// 0x0238 ~ 0x023c
	H14A0_OVI_TCON_PAT_ID_2                   	tcon_pat_id_2                   ;	// 0x0240 : ''
	H14A0_OVI_TCON_PAT_VALUE_2                	tcon_pat_value_2                ;	// 0x0244 : ''
	UINT32                          	                 _rsvd_33[   2];	// 0x0248 ~ 0x024c
	H14A0_OVI_TCON_PAT_MASK                   	tcon_pat_mask                   ;	// 0x0250 : ''
	UINT32                          	                 _rsvd_34[   1];	// 0x0254
	H14A0_OVI_TCON_FRONTDUMMY                 	tcon_frontdummy                 ;	// 0x0258 : ''
	H14A0_OVI_TCON_BACKDUMMY                  	tcon_backdummy                  ;	// 0x025c : ''
	H14A0_OVI_TCON_VERTLINE                   	tcon_vertline                   ;	// 0x0260 : ''
	H14A0_OVI_TCON_LTD_MODE                   	tcon_ltd_mode                   ;	// 0x0264 : ''
	H14A0_OVI_TCON_RGB_SEL                    	tcon_rgb_sel                    ;	// 0x0268 : ''
	H14A0_OVI_TCON_HOR_MODE                   	tcon_hor_mode                   ;	// 0x026c : ''
	H14A0_OVI_TCON_DFHD                       	tcon_dfhd                       ;	// 0x0270 : ''
	H14A0_OVI_TCON_MTEST_EN                   	tcon_mtest_en                   ;	// 0x0274 : ''
	H14A0_OVI_TCON_MTEST_PR                   	tcon_mtest_pr                   ;	// 0x0278 : ''
	H14A0_OVI_TCON_MTEST_PG                   	tcon_mtest_pg                   ;	// 0x027c : ''
	H14A0_OVI_TCON_MTEST_PB                   	tcon_mtest_pb                   ;	// 0x0280 : ''
	H14A0_OVI_TCON_EPI_MODE                   	tcon_epi_mode                   ;	// 0x0284 : ''
	H14A0_OVI_TCON_EPI_SEL0                   	tcon_epi_sel0                   ;	// 0x0288 : ''
	H14A0_OVI_TCON_EPI_SEL1                   	tcon_epi_sel1                   ;	// 0x028c : ''
	H14A0_OVI_TCON_EPI_CTR1_0                 	tcon_epi_ctr1_0                 ;	// 0x0290 : ''
	H14A0_OVI_TCON_EPI_CTR1_1                 	tcon_epi_ctr1_1                 ;	// 0x0294 : ''
	H14A0_OVI_TCON_EPI_CTR1_2                 	tcon_epi_ctr1_2                 ;	// 0x0298 : ''
	H14A0_OVI_TCON_EPI_CTR1_3                 	tcon_epi_ctr1_3                 ;	// 0x029c : ''
	H14A0_OVI_TCON_EPI_CTR1_4                 	tcon_epi_ctr1_4                 ;	// 0x02a0 : ''
	H14A0_OVI_TCON_EPI_CTR1_5                 	tcon_epi_ctr1_5                 ;	// 0x02a4 : ''
	H14A0_OVI_TCON_EPI_CTR1_6                 	tcon_epi_ctr1_6                 ;	// 0x02a8 : ''
	H14A0_OVI_TCON_EPI_CTR1_7                 	tcon_epi_ctr1_7                 ;	// 0x02ac : ''
	UINT32                          	                 _rsvd_35[   4];	// 0x02b0 ~ 0x02bc
	H14A0_OVI_TCON_EPI_CTR2_0                 	tcon_epi_ctr2_0                 ;	// 0x02c0 : ''
	H14A0_OVI_TCON_EPI_CTR2_1                 	tcon_epi_ctr2_1                 ;	// 0x02c4 : ''
	H14A0_OVI_TCON_EPI_CTR2_2                 	tcon_epi_ctr2_2                 ;	// 0x02c8 : ''
	H14A0_OVI_TCON_EPI_CTR2_3                 	tcon_epi_ctr2_3                 ;	// 0x02cc : ''
	H14A0_OVI_TCON_EPI_CTR2_4                 	tcon_epi_ctr2_4                 ;	// 0x02d0 : ''
	H14A0_OVI_TCON_EPI_CTR2_5                 	tcon_epi_ctr2_5                 ;	// 0x02d4 : ''
	H14A0_OVI_TCON_EPI_CTR2_6                 	tcon_epi_ctr2_6                 ;	// 0x02d8 : ''
	H14A0_OVI_TCON_EPI_CTR2_7                 	tcon_epi_ctr2_7                 ;	// 0x02dc : ''
	UINT32                          	                 _rsvd_36[  11];	// 0x02e0 ~ 0x0308
	H14A0_OVI_TCON_DRD_H_BLANK                	tcon_drd_h_blank                ;	// 0x030c : ''
	UINT32                          	                 _rsvd_37[   2];	// 0x0310 ~ 0x0314
	H14A0_OVI_TCON_GSPLINE                    	tcon_gspline                    ;	// 0x0318 : ''
	H14A0_OVI_TCON_DPM_CNT                    	tcon_dpm_cnt                    ;	// 0x031c : ''
	H14A0_OVI_TCON_VST_CONTROL                	tcon_vst_control                ;	// 0x0320 : ''
	H14A0_OVI_TCON_VST_DPM                    	tcon_vst_dpm                    ;	// 0x0324 : ''
	H14A0_OVI_TCON_VST_M1_LINE1               	tcon_vst_m1_line1               ;	// 0x0328 : ''
	H14A0_OVI_TCON_VST_M1_LINE2               	tcon_vst_m1_line2               ;	// 0x032c : ''
	H14A0_OVI_TCON_VST_M1_PIX1                	tcon_vst_m1_pix1                ;	// 0x0330 : ''
	H14A0_OVI_TCON_VST_M1_PIX2                	tcon_vst_m1_pix2                ;	// 0x0334 : ''
	H14A0_OVI_TCON_VST_M1_D                   	tcon_vst_m1_d                   ;	// 0x0338 : ''
	H14A0_OVI_TCON_VST_M2_LINE1               	tcon_vst_m2_line1               ;	// 0x033c : ''
	H14A0_OVI_TCON_VST_M2_LINE2               	tcon_vst_m2_line2               ;	// 0x0340 : ''
	H14A0_OVI_TCON_VST_M2_PIX1                	tcon_vst_m2_pix1                ;	// 0x0344 : ''
	H14A0_OVI_TCON_VST_M2_PIX2                	tcon_vst_m2_pix2                ;	// 0x0348 : ''
	H14A0_OVI_TCON_VST_M2_D                   	tcon_vst_m2_d                   ;	// 0x034c : ''
	H14A0_OVI_TCON_VST_M3_LINE1               	tcon_vst_m3_line1               ;	// 0x0350 : ''
	H14A0_OVI_TCON_VST_M3_LINE2               	tcon_vst_m3_line2               ;	// 0x0354 : ''
	H14A0_OVI_TCON_VST_M3_PIX1                	tcon_vst_m3_pix1                ;	// 0x0358 : ''
	H14A0_OVI_TCON_VST_M3_PIX2                	tcon_vst_m3_pix2                ;	// 0x035c : ''
	H14A0_OVI_TCON_VST_M3_D                   	tcon_vst_m3_d                   ;	// 0x0360 : ''
	H14A0_OVI_TCON_VST_P1_LINE                	tcon_vst_p1_line                ;	// 0x0364 : ''
	H14A0_OVI_TCON_VST_P1_PIX1                	tcon_vst_p1_pix1                ;	// 0x0368 : ''
	H14A0_OVI_TCON_VST_P1_PIX2                	tcon_vst_p1_pix2                ;	// 0x036c : ''
	H14A0_OVI_TCON_VST_P1_D                   	tcon_vst_p1_d                   ;	// 0x0370 : ''
	H14A0_OVI_TCON_VST_P2_LINE                	tcon_vst_p2_line                ;	// 0x0374 : ''
	H14A0_OVI_TCON_VST_P2_PIX1                	tcon_vst_p2_pix1                ;	// 0x0378 : ''
	H14A0_OVI_TCON_VST_P2_PIX2                	tcon_vst_p2_pix2                ;	// 0x037c : ''
	H14A0_OVI_TCON_VST_P2_D                   	tcon_vst_p2_d                   ;	// 0x0380 : ''
	H14A0_OVI_TCON_VST_ABN_PIX1               	tcon_vst_abn_pix1               ;	// 0x0384 : ''
	H14A0_OVI_TCON_VST_ABN_PIX2               	tcon_vst_abn_pix2               ;	// 0x0388 : ''
	H14A0_OVI_TCON_VST_ABN_D                  	tcon_vst_abn_d                  ;	// 0x038c : ''
	H14A0_OVI_TCON_GCLK_CONTROL               	tcon_gclk_control               ;	// 0x0390 : ''
	H14A0_OVI_TCON_GCLK_DPM                   	tcon_gclk_dpm                   ;	// 0x0394 : ''
	H14A0_OVI_TCON_GCLK_M1_LINE1              	tcon_gclk_m1_line1              ;	// 0x0398 : ''
	H14A0_OVI_TCON_GCLK_M1_LINE2              	tcon_gclk_m1_line2              ;	// 0x039c : ''
	H14A0_OVI_TCON_GCLK_M1_PIX1               	tcon_gclk_m1_pix1               ;	// 0x03a0 : ''
	H14A0_OVI_TCON_GCLK_M1_PIX2               	tcon_gclk_m1_pix2               ;	// 0x03a4 : ''
	H14A0_OVI_TCON_GCLK_M1_D                  	tcon_gclk_m1_d                  ;	// 0x03a8 : ''
	H14A0_OVI_TCON_GCLK_M2_LINE1              	tcon_gclk_m2_line1              ;	// 0x03ac : ''
	H14A0_OVI_TCON_GCLK_M2_LINE2              	tcon_gclk_m2_line2              ;	// 0x03b0 : ''
	H14A0_OVI_TCON_GCLK_M2_PIX1               	tcon_gclk_m2_pix1               ;	// 0x03b4 : ''
	H14A0_OVI_TCON_GCLK_M2_PIX2               	tcon_gclk_m2_pix2               ;	// 0x03b8 : ''
	H14A0_OVI_TCON_GCLK_M2_D                  	tcon_gclk_m2_d                  ;	// 0x03bc : ''
	H14A0_OVI_TCON_GCLK_M3_LINE1              	tcon_gclk_m3_line1              ;	// 0x03c0 : ''
	H14A0_OVI_TCON_GCLK_M3_LINE2              	tcon_gclk_m3_line2              ;	// 0x03c4 : ''
	H14A0_OVI_TCON_GCLK_M3_PIX1               	tcon_gclk_m3_pix1               ;	// 0x03c8 : ''
	H14A0_OVI_TCON_GCLK_M3_PIX2               	tcon_gclk_m3_pix2               ;	// 0x03cc : ''
	H14A0_OVI_TCON_GCLK_M3_D                  	tcon_gclk_m3_d                  ;	// 0x03d0 : ''
	H14A0_OVI_TCON_GCLK_P1_LINE               	tcon_gclk_p1_line               ;	// 0x03d4 : ''
	H14A0_OVI_TCON_GCLK_P1_PIX1               	tcon_gclk_p1_pix1               ;	// 0x03d8 : ''
	H14A0_OVI_TCON_GCLK_P1_PIX2               	tcon_gclk_p1_pix2               ;	// 0x03dc : ''
	H14A0_OVI_TCON_GCLK_P1_D                  	tcon_gclk_p1_d                  ;	// 0x03e0 : ''
	H14A0_OVI_TCON_GCLK_P2_LINE               	tcon_gclk_p2_line               ;	// 0x03e4 : ''
	H14A0_OVI_TCON_GCLK_P2_PIX1               	tcon_gclk_p2_pix1               ;	// 0x03e8 : ''
	H14A0_OVI_TCON_GCLK_P2_PIX2               	tcon_gclk_p2_pix2               ;	// 0x03ec : ''
	H14A0_OVI_TCON_GCLK_P2_D                  	tcon_gclk_p2_d                  ;	// 0x03f0 : ''
	H14A0_OVI_TCON_MCLK_CONTROL               	tcon_mclk_control               ;	// 0x03f4 : ''
	H14A0_OVI_TCON_MCLK_DPM                   	tcon_mclk_dpm                   ;	// 0x03f8 : ''
	H14A0_OVI_TCON_MCLK_M1_LINE1              	tcon_mclk_m1_line1              ;	// 0x03fc : ''
	H14A0_OVI_TCON_MCLK_M1_LINE2              	tcon_mclk_m1_line2              ;	// 0x0400 : ''
	H14A0_OVI_TCON_MCLK_M1_PIX1               	tcon_mclk_m1_pix1               ;	// 0x0404 : ''
	H14A0_OVI_TCON_MCLK_M1_PIX2               	tcon_mclk_m1_pix2               ;	// 0x0408 : ''
	H14A0_OVI_TCON_MCLK_M1_D                  	tcon_mclk_m1_d                  ;	// 0x040c : ''
	H14A0_OVI_TCON_MCLK_M2_LINE1              	tcon_mclk_m2_line1              ;	// 0x0410 : ''
	H14A0_OVI_TCON_MCLK_M2_LINE2              	tcon_mclk_m2_line2              ;	// 0x0414 : ''
	H14A0_OVI_TCON_MCLK_M2_PIX1               	tcon_mclk_m2_pix1               ;	// 0x0418 : ''
	H14A0_OVI_TCON_MCLK_M2_PIX2               	tcon_mclk_m2_pix2               ;	// 0x041c : ''
	H14A0_OVI_TCON_MCLK_M2_D                  	tcon_mclk_m2_d                  ;	// 0x0420 : ''
	H14A0_OVI_TCON_MCLK_M3_LINE1              	tcon_mclk_m3_line1              ;	// 0x0424 : ''
	H14A0_OVI_TCON_MCLK_M3_LINE2              	tcon_mclk_m3_line2              ;	// 0x0428 : ''
	H14A0_OVI_TCON_MCLK_M3_PIX1               	tcon_mclk_m3_pix1               ;	// 0x042c : ''
	H14A0_OVI_TCON_MCLK_M3_PIX2               	tcon_mclk_m3_pix2               ;	// 0x0430 : ''
	H14A0_OVI_TCON_MCLK_M3_D                  	tcon_mclk_m3_d                  ;	// 0x0434 : ''
	H14A0_OVI_TCON_MCLK_P1_LINE               	tcon_mclk_p1_line               ;	// 0x0438 : ''
	H14A0_OVI_TCON_MCLK_P1_PIX1               	tcon_mclk_p1_pix1               ;	// 0x043c : ''
	H14A0_OVI_TCON_MCLK_P1_PIX2               	tcon_mclk_p1_pix2               ;	// 0x0440 : ''
	H14A0_OVI_TCON_MCLK_P1_D                  	tcon_mclk_p1_d                  ;	// 0x0444 : ''
	H14A0_OVI_TCON_MCLK_P2_LINE               	tcon_mclk_p2_line               ;	// 0x0448 : ''
	H14A0_OVI_TCON_MCLK_P2_PIX1               	tcon_mclk_p2_pix1               ;	// 0x044c : ''
	H14A0_OVI_TCON_MCLK_P2_PIX2               	tcon_mclk_p2_pix2               ;	// 0x0450 : ''
	H14A0_OVI_TCON_MCLK_P2_D                  	tcon_mclk_p2_d                  ;	// 0x0454 : ''
	H14A0_OVI_TCON_EO_FCON_CONTROL            	tcon_eo_fcon_control            ;	// 0x0458 : ''
	H14A0_OVI_TCON_EO_FCON_DPM                	tcon_eo_fcon_dpm                ;	// 0x045c : ''
	H14A0_OVI_TCON_EO_FCON_F1_FRA             	tcon_eo_fcon_f1_fra             ;	// 0x0460 : ''
	H14A0_OVI_TCON_EO_FCON_F1_LINE1           	tcon_eo_fcon_f1_line1           ;	// 0x0464 : ''
	H14A0_OVI_TCON_EO_FCON_F1_LINE2           	tcon_eo_fcon_f1_line2           ;	// 0x0468 : ''
	H14A0_OVI_TCON_EO_FCON_F1_PIX1            	tcon_eo_fcon_f1_pix1            ;	// 0x046c : ''
	H14A0_OVI_TCON_EO_FCON_F1_PIX2            	tcon_eo_fcon_f1_pix2            ;	// 0x0470 : ''
	H14A0_OVI_TCON_EO_FCON_F1_D               	tcon_eo_fcon_f1_d               ;	// 0x0474 : ''
	UINT32                          	                 _rsvd_38[   2];	// 0x0478 ~ 0x047c
	H14A0_OVI_TCON_EO_ABN_PIX1                	tcon_eo_abn_pix1                ;	// 0x0480 : ''
	H14A0_OVI_TCON_EO_ABN_PIX2                	tcon_eo_abn_pix2                ;	// 0x0484 : ''
	H14A0_OVI_TCON_EO_ABN_D                   	tcon_eo_abn_d                   ;	// 0x0488 : ''
	H14A0_OVI_TCON_POL_NORMAL                 	tcon_pol_normal                 ;	// 0x048c : ''
	H14A0_OVI_TCON_POL_DPC1                   	tcon_pol_dpc1                   ;	// 0x0490 : ''
	H14A0_OVI_TCON_POL_DPC2                   	tcon_pol_dpc2                   ;	// 0x0494 : ''
	H14A0_OVI_TCON_POL_DPC3                   	tcon_pol_dpc3                   ;	// 0x0498 : ''
	H14A0_OVI_TCON_POL_DPC4                   	tcon_pol_dpc4                   ;	// 0x049c : ''
	H14A0_OVI_TCON_POL_DPC5                   	tcon_pol_dpc5                   ;	// 0x04a0 : ''
	H14A0_OVI_TCON_POL_DPC6                   	tcon_pol_dpc6                   ;	// 0x04a4 : ''
	H14A0_OVI_TCON_POL_DPC7                   	tcon_pol_dpc7                   ;	// 0x04a8 : ''
	H14A0_OVI_TCON_POL_DPC8                   	tcon_pol_dpc8                   ;	// 0x04ac : ''
	H14A0_OVI_TCON_POL_DPC9                   	tcon_pol_dpc9                   ;	// 0x04b0 : ''
	H14A0_OVI_TCON_POL_DPC10                  	tcon_pol_dpc10                  ;	// 0x04b4 : ''
	H14A0_OVI_TCON_HCONV                      	tcon_hconv                      ;	// 0x04b8 : ''
	UINT32                          	                 _rsvd_39[ 160];	// 0x04bc ~ 0x0738
	UINT32                          	tcon_status                     ;	// 0x073c : ''
	UINT32                          	                 _rsvd_40[  48];	// 0x0740 ~ 0x07fc
	UINT32                          	tcon_dga_low_rs                 ;	// 0x0800 : ''
	UINT32                          	                 _rsvd_41[ 766];	// 0x0804 ~ 0x13f8
	UINT32                          	tcon_dga_low_re                 ;	// 0x13fc : ''
	UINT32                          	tcon_dga_low_gs                 ;	// 0x1400 : ''
	UINT32                          	                 _rsvd_42[ 766];	// 0x1404 ~ 0x1ff8
	UINT32                          	tcon_dga_low_ge                 ;	// 0x1ffc : ''
	UINT32                          	tcon_dga_low_bs                 ;	// 0x2000 : ''
	UINT32                          	                 _rsvd_43[ 766];	// 0x2004 ~ 0x2bf8
	UINT32                          	tcon_dga_low_be                 ;	// 0x2bfc : ''
	UINT32                          	tcon_dga_med_rs                 ;	// 0x2c00 : ''
	UINT32                          	                 _rsvd_44[ 766];	// 0x2c04 ~ 0x37f8
	UINT32                          	tcon_dga_med_re                 ;	// 0x37fc : ''
	UINT32                          	tcon_dga_med_gs                 ;	// 0x3800 : ''
	UINT32                             _rsvd_45[ 766];	// 0x3804 ~ 0x43f8
	UINT32                          	tcon_dga_med_ge                 ;	// 0x43fc : ''
	UINT32                          	tcon_dga_med_bs                 ;	// 0x4400 : ''
	UINT32                          	                 _rsvd_46[ 766];	// 0x4404 ~ 0x4ff8
	UINT32                          	tcon_dga_med_be                 ;	// 0x4ffc : ''
	UINT32                          	tcon_dga_high_rs                ;	// 0x5000 : ''
	UINT32                          	                 _rsvd_47[ 766];	// 0x5004 ~ 0x5bf8
	UINT32                          	tcon_dga_high_re                ;	// 0x5bfc : ''
	UINT32                          	tcon_dga_high_gs                ;	// 0x5c00 : ''
	UINT32                          	                 _rsvd_48[ 766];	// 0x5c04 ~ 0x67f8
	UINT32                          	tcon_dga_high_ge                ;	// 0x67fc : ''
	UINT32                          	tcon_dga_high_bs                ;	// 0x6800 : ''
	UINT32                          	                 _rsvd_49[ 766];	// 0x6804 ~ 0x73f8
	UINT32                          	tcon_dga_high_be                ;	// 0x73fc : ''
	UINT32                          	tcon_dither_start               ;	// 0x7400 : ''
	UINT32                          	                 _rsvd_50[ 254];	// 0x7404 ~ 0x77f8
	UINT32                          	tcon_dither_end                 ;	// 0x77fc : ''
	UINT32                          	tcon_odc_start_2d               ;	// 0x7800 : ''
	UINT32                          	                 _rsvd_51[ 287];	// 0x7804 ~ 0x7c7c
	UINT32                          	tcon_odc_end_2d                 ;	// 0x7c80 : ''
	UINT32                          	                 _rsvd_52[  15];	// 0x7c84 ~ 0x7cbc
	UINT32                          	tcon_odc_start_3d               ;	// 0x7cc0 : ''
	UINT32                          	                 _rsvd_53[ 287];	// 0x7cc4 ~ 0x813c
	UINT32                          	tcon_odc_end_3d                 ;	// 0x8140 : ''
	UINT32                          	                 _rsvd_54[  15];	// 0x8144 ~ 0x817c
	UINT32                          	tcon_lodc_start_3d              ;	// 0x8180 : ''
	UINT32                          	                 _rsvd_55[ 287];	// 0x8184 ~ 0x85fc
	UINT32                          	tcon_lodc_end_3d                ;	// 0x8600 : ''
	UINT32                          	                 _rsvd_56[  15];	// 0x8604 ~ 0x863c
	UINT32                          	tcon_end                        ;	// 0x8640 : ''
} OVI_TCON_REG_H14A0_T;

/*
	OVI_OIF
*/

/*-----------------------------------------------------------------------------
	0x9000 oif_vch_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vch_hb_width                    :12,	//  0:11
	vch_out_h_width                 :11,	// 12:22
	rsvd_00                                : 1,	//    23 
	vch_out_port                    : 2,	// 24:25
	vch_h_reverse                   : 1,	//    26
	vch_line_delay                  : 1,	//    27
	vch_rgbw_en                     : 1,	//    28
	rsvd_01					: 3; // 29:31
} H14A0_OVI_OIF_VCH_CONFIG;

/*-----------------------------------------------------------------------------
	0x9004 oif_och_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	och_hb_width                    :12,	//  0:11
	och_out_h_width                 :11,	// 12:22
	rsvd_00                                : 1,	//    23
	och_out_port                    : 2,	// 24:25
	och_h_reverse                   : 1,	//    26
	och_line_delay                  : 1,	//    27
	rsvd_01					: 4; // 28:31
} H14A0_OVI_OIF_OCH_CONFIG;

/*-----------------------------------------------------------------------------
	0x9008 oif_vx1_config0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_sel                         :25,	//  0:24
	vx1_out_mode                    : 1,	//    25
	vx1_en                          : 1,	//    26
	rsvd                            : 5;	// 27:31
} H14A0_OVI_OIF_VX1_CONFIG0;

/*-----------------------------------------------------------------------------
	0x900c oif_vx1_config1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_force_even_data             :31,	//  0:30
	rsvd                            : 1;	//    31
} H14A0_OVI_OIF_VX1_CONFIG1;

/*-----------------------------------------------------------------------------
	0x9010 oif_vx1_config2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_force_odd_data              :31,	//  0:30
	rsvd                            : 1;	//    31
} H14A0_OVI_OIF_VX1_CONFIG2;

/*-----------------------------------------------------------------------------
	0x9014 oif_vx1_config3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_resv3                       : 2,	//  0: 1
	vx1_resv2                       : 2,	//  2: 3
	vx1_resv1                       : 2,	//  4: 5
	vx1_resv0                       : 2,	//  6: 7
	vx1_resv_sel                    : 3,	//  8:10
	rsvd                            :21;	// 11:31
} H14A0_OVI_OIF_VX1_CONFIG3;

/*-----------------------------------------------------------------------------
	0x9018 oif_lvds_config0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_sel                        :13,	//  0:12
	lvds_swap                       : 1,	//    13
	lvds_8bit_mode                  : 1,	//    14
	lvds_lsb_first                  : 1,	//    15
	rsvd                            :16;	// 16:31
} H14A0_OVI_OIF_LVDS_CONFIG0;

/*-----------------------------------------------------------------------------
	0x901c oif_lvds_config1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_even_data            :31,	//  0:30
	rsvd                            : 1;	//    31
} H14A0_OVI_OIF_LVDS_CONFIG1;

/*-----------------------------------------------------------------------------
	0x9020 oif_lvds_config2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_odd_data             :31,	//  0:30
	rsvd                            : 1;	//    31
} H14A0_OVI_OIF_LVDS_CONFIG2;

/*-----------------------------------------------------------------------------
	0x9024 oif_lvds_config3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_data                 :16,	//  0:15
	lvds_force_en                   :16;	// 16:31
} H14A0_OVI_OIF_LVDS_CONFIG3;

/*-----------------------------------------------------------------------------
	0x9028 oif_p2i_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_sync_ctrl                   : 3,	//  0: 2
	p2i_top_reset                   : 1,	//     3
	p2i_enable                      : 1;	//     4
} H14A0_OVI_OIF_P2I_CONFIG;

/*-----------------------------------------------------------------------------
	0x902c oif_p2i_hfp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_hfp                         :12;	//  0:11
} H14A0_OVI_OIF_P2I_HFP;

/*-----------------------------------------------------------------------------
	0x9030 oif_p2i_hsync ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_hsync                       :12;	//  0:11
} H14A0_OVI_OIF_P2I_HSYNC;

/*-----------------------------------------------------------------------------
	0x9034 oif_p2i_hbp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_hbp                         :12;	//  0:11
} H14A0_OVI_OIF_P2I_HBP;

/*-----------------------------------------------------------------------------
	0x9038 oif_p2i_ha ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_ha                          :12;	//  0:11
} H14A0_OVI_OIF_P2I_HA;

/*-----------------------------------------------------------------------------
	0x903c oif_p2i_hn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_hn                          :12;	//  0:11
} H14A0_OVI_OIF_P2I_HN;

/*-----------------------------------------------------------------------------
	0x9040 oif_p2i_vsync ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vsync                       :12;	//  0:11
} H14A0_OVI_OIF_P2I_VSYNC;

/*-----------------------------------------------------------------------------
	0x9044 oif_p2i_vbp0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vbp0                        :12;	//  0:11
} H14A0_OVI_OIF_P2I_VBP0;

/*-----------------------------------------------------------------------------
	0x9048 oif_p2i_vbp1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vbp1                        :12;	//  0:11
} H14A0_OVI_OIF_P2I_VBP1;

/*-----------------------------------------------------------------------------
	0x904c oif_p2i_va ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_va                          :12;	//  0:11
} H14A0_OVI_OIF_P2I_VA;

/*-----------------------------------------------------------------------------
	0x9050 oif_p2i_vn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vn                          :12;	//  0:11
} H14A0_OVI_OIF_P2I_VN;

/*-----------------------------------------------------------------------------
	0x9054 oif_p2i_vris0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vris0                       :12;	//  0:11
} H14A0_OVI_OIF_P2I_VRIS0;

/*-----------------------------------------------------------------------------
	0x9058 oif_p2i_vris1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vris1                       :12;	//  0:11
} H14A0_OVI_OIF_P2I_VRIS1;

typedef struct {
	H14A0_OVI_OIF_VCH_CONFIG                  	oif_vch_config                  ;	// 0x9000 : ''
	H14A0_OVI_OIF_OCH_CONFIG                  	oif_och_config                  ;	// 0x9004 : ''
	H14A0_OVI_OIF_VX1_CONFIG0                 	oif_vx1_config0                 ;	// 0x9008 : ''
	H14A0_OVI_OIF_VX1_CONFIG1                 	oif_vx1_config1                 ;	// 0x900c : ''
	H14A0_OVI_OIF_VX1_CONFIG2                 	oif_vx1_config2                 ;	// 0x9010 : ''
	H14A0_OVI_OIF_VX1_CONFIG3                 	oif_vx1_config3                 ;	// 0x9014 : ''
	H14A0_OVI_OIF_LVDS_CONFIG0                	oif_lvds_config0                ;	// 0x9018 : ''
	H14A0_OVI_OIF_LVDS_CONFIG1                	oif_lvds_config1                ;	// 0x901c : ''
	H14A0_OVI_OIF_LVDS_CONFIG2                	oif_lvds_config2                ;	// 0x9020 : ''
	H14A0_OVI_OIF_LVDS_CONFIG3                	oif_lvds_config3                ;	// 0x9024 : ''
	H14A0_OVI_OIF_P2I_CONFIG                  	oif_p2i_config                  ;	// 0x9028 : ''
	H14A0_OVI_OIF_P2I_HFP                     	oif_p2i_hfp                     ;	// 0x902c : ''
	H14A0_OVI_OIF_P2I_HSYNC                   	oif_p2i_hsync                   ;	// 0x9030 : ''
	H14A0_OVI_OIF_P2I_HBP                     	oif_p2i_hbp                     ;	// 0x9034 : ''
	H14A0_OVI_OIF_P2I_HA                      	oif_p2i_ha                      ;	// 0x9038 : ''
	H14A0_OVI_OIF_P2I_HN                      	oif_p2i_hn                      ;	// 0x903c : ''
	H14A0_OVI_OIF_P2I_VSYNC                   	oif_p2i_vsync                   ;	// 0x9040 : ''
	H14A0_OVI_OIF_P2I_VBP0                    	oif_p2i_vbp0                    ;	// 0x9044 : ''
	H14A0_OVI_OIF_P2I_VBP1                    	oif_p2i_vbp1                    ;	// 0x9048 : ''
	H14A0_OVI_OIF_P2I_VA                      	oif_p2i_va                      ;	// 0x904c : ''
	H14A0_OVI_OIF_P2I_VN                      	oif_p2i_vn                      ;	// 0x9050 : ''
	H14A0_OVI_OIF_P2I_VRIS0                   	oif_p2i_vris0                   ;	// 0x9054 : ''
	H14A0_OVI_OIF_P2I_VRIS1                   	oif_p2i_vris1                   ;	// 0x9058 : ''
} OVI_OIF_REG_H14A0_T;

#endif //#ifndef _REG_OVI_H14A0_H_
