/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

#ifndef _PE_PE1_REG_M14A0_H_
#define _PE_PE1_REG_M14A0_H_
/*-----------------------------------------------------------------------------
		0xc0035300L pe1_top_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 load_time                          : 1 ;  //     0     
	UINT32 load_enable                        : 1 ;  //     1     
	UINT32 load_type                          : 1 ;  //     2     
} PE_M14A0_PE1_TOP_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035304L pe1_top_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 width                              : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 height                             : 12;  // 27:16     
} PE_M14A0_PE1_TOP_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035308L pe1_top_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_positon                        : 1 ;  //     0     
	UINT32 chroma_sel                         : 1 ;  //     1     
	UINT32 pe1_detour                         : 1 ;  //     2     
	UINT32 intp_mode                          : 1 ;  //     3     
	UINT32 disp_active_mux                    : 1 ;  //     4     
	UINT32 async_delay_mode                   : 1 ;  //     5     
	UINT32 ud_mode                            : 1 ;  //     6     
	UINT32 mode_3d                            : 1 ;  //     7     
	UINT32 vdpulse_pos                        : 12;  // 19: 8     
	UINT32 line_masking_mode                  : 2 ;  // 21:20     
	UINT32                                    : 2 ;  // 23:22     reserved
	UINT32 master_en                          : 1 ;  //    24     
} PE_M14A0_PE1_TOP_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003530cL pe1_top_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vcnt                               : 12;  // 11: 0     
	UINT32 va_pe1_in                          : 1 ;  //    12     
	UINT32 va_pe1_out                         : 1 ;  //    13     
	UINT32                                    : 2 ;  // 15:14     reserved
	UINT32 vcnt2                              : 12;  // 27:16     
} PE_M14A0_PE1_TOP_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035320L pe1_win1_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win0_en                            : 1 ;  //     0     
	UINT32 win1_en                            : 1 ;  //     1     
	UINT32 win01_en                           : 1 ;  //     2     
	UINT32                                    : 3 ;  //  5: 3     reserved
	UINT32 win_outside                        : 1 ;  //     6     
	UINT32 win_en                             : 1 ;  //     7     
	UINT32 bdr_alpha                          : 5 ;  // 12: 8     
	UINT32 bdr_wid                            : 2 ;  // 14:13     
	UINT32 bdr_en                             : 1 ;  //    15     
	UINT32 cr5                                : 5 ;  // 20:16     
	UINT32 cb5                                : 5 ;  // 25:21     
	UINT32 yy6                                : 6 ;  // 31:26     
} PE_M14A0_PE1_WIN1_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035324L pe1_win1_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w0_y0                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN1_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035328L pe1_win1_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w0_y1                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN1_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003532cL pe1_win1_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w1_y0                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN1_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035330L pe1_win1_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w1_y1                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN1_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035334L pe1_win2_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win0_en                            : 1 ;  //     0     
	UINT32 win1_en                            : 1 ;  //     1     
	UINT32 win01_en                           : 1 ;  //     2     
	UINT32                                    : 3 ;  //  5: 3     reserved
	UINT32 win_outside                        : 1 ;  //     6     
	UINT32 win_en                             : 1 ;  //     7     
	UINT32 bdr_alpha                          : 5 ;  // 12: 8     
	UINT32 bdr_wid                            : 2 ;  // 14:13     
	UINT32 bdr_en                             : 1 ;  //    15     
	UINT32 cr5                                : 5 ;  // 20:16     
	UINT32 cb5                                : 5 ;  // 25:21     
	UINT32 yy6                                : 6 ;  // 31:26     
} PE_M14A0_PE1_WIN2_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035338L pe1_win2_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w0_y0                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN2_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc003533cL pe1_win2_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w0_y1                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN2_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc0035340L pe1_win2_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w1_y0                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN2_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035344L pe1_win2_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w1_y1                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN2_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035350L pe1_apl_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_win_ctrl_x0                    : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 apl_win_ctrl_y0                    : 12;  // 27:16     
} PE_M14A0_PE1_APL_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035354L pe1_apl_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_win_ctrl_x1                    : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 apl_win_ctrl_y1                    : 12;  // 27:16     
} PE_M14A0_PE1_APL_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035358L pe1_apl_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_position                       : 2 ;  //  1: 0     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 apl_y_type                         : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 act_win_mode                       : 1 ;  //     8     
} PE_M14A0_PE1_APL_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003535cL pe1_apl_stat_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_y                              : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 apl_rgb                            : 10;  // 25:16     
} PE_M14A0_PE1_APL_STAT_00_T;

/*-----------------------------------------------------------------------------
		0xc0035360L pe1_apl_stat_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_b                              : 10;  //  9: 0     
	UINT32 apl_g                              : 10;  // 19:10     
	UINT32 apl_r                              : 10;  // 29:20     
} PE_M14A0_PE1_APL_STAT_01_T;

/*-----------------------------------------------------------------------------
		0xc0035364L pe1_apl_stat_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_y_other_side                   : 10;  //  9: 0     
} PE_M14A0_PE1_APL_STAT_02_T;

/*-----------------------------------------------------------------------------
		0xc0035368L pe1_apl_stat_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_b_other_side                   : 10;  //  9: 0     
	UINT32 apl_g_other_side                   : 10;  // 19:10     
	UINT32 apl_r_other_side                   : 10;  // 29:20     
} PE_M14A0_PE1_APL_STAT_03_T;

/*-----------------------------------------------------------------------------
		0xc0035370L pe1_tpg_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_enable                         : 1 ;  //     0     
	UINT32 pattern_type                       : 2 ;  //  2: 1     
	UINT32                                    : 1 ;  //     3     reserved
	UINT32 blend_alpha                        : 4 ;  //  7: 4     
	UINT32 blt_size_x                         : 12;  // 19: 8     
	UINT32 blt_size_y                         : 12;  // 31:20     
} PE_M14A0_PE1_TPG_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035374L pe1_tpg_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gradation_stride                   : 7 ;  //  6: 0     
	UINT32 gradation_direction                : 1 ;  //     7     
	UINT32 gradation_bar_en                   : 4 ;  // 11: 8     
} PE_M14A0_PE1_TPG_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035378L pe1_tpg_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 patch_en                           : 16;  // 15: 0     
} PE_M14A0_PE1_TPG_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003537cL pe1_tpg_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 patch_inout_sel                    : 16;  // 15: 0     
} PE_M14A0_PE1_TPG_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035380L pe1_tpg_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bg_color_r                         : 10;  //  9: 0     
	UINT32 bg_color_b                         : 10;  // 19:10     
	UINT32 bg_color_g                         : 10;  // 29:20     
} PE_M14A0_PE1_TPG_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035384L pe1_tpg_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_indir_addr                     : 7 ;  //  6: 0     
	UINT32                                    : 5 ;  // 11: 7     reserved
	UINT32 tpg_indir_ai_en                    : 1 ;  //    12     
} PE_M14A0_PE1_TPG_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc0035388L pe1_tpg_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_indir_data                     : 32;  // 31: 0     
} PE_M14A0_PE1_TPG_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc00353a0L pe1_film_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vignetting_enable                  : 1 ;  //     0     
	UINT32 film_contrast_enable               : 1 ;  //     1     
	UINT32                                    : 6 ;  //  7: 2     reserved
	UINT32 contrast_alpha                     : 8 ;  // 15: 8     
	UINT32 contrast_delta_max                 : 8 ;  // 23:16     
	UINT32 vignetting_gain                    : 8 ;  // 31:24     
} PE_M14A0_PE1_FILM_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00353a4L pe1_film_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 noise_gen_enable                   : 1 ;  //     0     
	UINT32 noise_frame_rate                   : 3 ;  //  3: 1     
	UINT32 noise_size                         : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 noise_gain                         : 8 ;  // 15: 8     
} PE_M14A0_PE1_FILM_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00353a8L pe1_film_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 tone_gain                          : 7 ;  //  6: 0     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 tone_offset                        : 6 ;  // 13: 8     
} PE_M14A0_PE1_FILM_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00353b0L pe1_win3_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win0_en                            : 1 ;  //     0     
	UINT32 win1_en                            : 1 ;  //     1     
	UINT32 win01_en                           : 1 ;  //     2     
	UINT32                                    : 3 ;  //  5: 3     reserved
	UINT32 win_outside                        : 1 ;  //     6     
	UINT32 win_en                             : 1 ;  //     7     
	UINT32 bdr_alpha                          : 5 ;  // 12: 8     
	UINT32 bdr_wid                            : 2 ;  // 14:13     
	UINT32 bdr_en                             : 1 ;  //    15     
	UINT32 cr5                                : 5 ;  // 20:16     
	UINT32 cb5                                : 5 ;  // 25:21     
	UINT32 yy6                                : 6 ;  // 31:26     
} PE_M14A0_PE1_WIN3_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00353b4L pe1_win3_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w0_y0                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN3_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00353b8L pe1_win3_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w0_y1                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN3_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00353bcL pe1_win3_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w1_y0                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN3_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc00353c0L pe1_win3_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                          : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 win_w1_y1                          : 12;  // 27:16     
} PE_M14A0_PE1_WIN3_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc00353d0L pe1_derh_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsum_mode                          : 2 ;  //  1: 0     
	UINT32 hsum_mode                          : 2 ;  //  3: 2     
	UINT32 vsum121_en                         : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 vertical_min_max                   : 2 ;  //  9: 8     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 a_flt_mux                          : 2 ;  // 17:16     
	UINT32 a_e_mux                            : 2 ;  // 19:18     
	UINT32 t_mux                              : 1 ;  //    20     
	UINT32                                    : 3 ;  // 23:21     reserved
	UINT32 a_gen_width                        : 4 ;  // 27:24     
} PE_M14A0_PE1_DERH_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00353d4L pe1_derh_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 a_gen_of_y                         : 8 ;  //  7: 0     
	UINT32 a_gen_of_c                         : 8 ;  // 15: 8     
	UINT32 avg_flt_mode                       : 3 ;  // 18:16     
	UINT32 avg_flt_en                         : 1 ;  //    19     
	UINT32                                    : 4 ;  // 23:20     reserved
	UINT32 max_flt_mode                       : 3 ;  // 26:24     
} PE_M14A0_PE1_DERH_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00353d8L pe1_derh_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 a_exp_gain_ctrl_y0                 : 4 ;  //  3: 0     
	UINT32 a_exp2_gain_ctrl_x0                : 4 ;  //  7: 4     
	UINT32 a_exp2_gain_ctrl_y1                : 4 ;  // 11: 8     
	UINT32 a_exp2_gain_ctrl_x1                : 4 ;  // 15:12     
	UINT32 a_avg2_flt_wid                     : 4 ;  // 19:16     
	UINT32 a_avg2_flt_en                      : 1 ;  //    20     
	UINT32                                    : 3 ;  // 23:21     reserved
	UINT32 a_exp_max2_en                      : 1 ;  //    24     
	UINT32                                    : 1 ;  //    25     reserved
	UINT32 y_sum_mode                         : 2 ;  // 27:26     
} PE_M14A0_PE1_DERH_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00353dcL pe1_derh_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 5 ;  //  4: 0     reserved
	UINT32 a_mux_for_edge_gaintable           : 3 ;  //  7: 5     
	UINT32                                    : 9 ;  // 16: 8     reserved
	UINT32 a_mux_for_detail_filter            : 3 ;  // 19:17     
	UINT32                                    : 1 ;  //    20     reserved
	UINT32 a_mux_for_edge_filter              : 3 ;  // 23:21     
	UINT32 a_scaling_flat_filter_             : 4 ;  // 27:24     
	UINT32                                    : 1 ;  //    28     reserved
	UINT32 a_mux_for_flat_filter              : 3 ;  // 31:29     
} PE_M14A0_PE1_DERH_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc00353e0L pe1_derh_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 1 ;  //     0     reserved
	UINT32 reg_dbg_scale                      : 1 ;  //     1     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 sum_mux                            : 4 ;  //  7: 4     
	UINT32 reg_enh_en_cc                      : 3 ;  // 10: 8     
	UINT32                                    : 1 ;  //    11     reserved
	UINT32 reg_enh_en_yy                      : 3 ;  // 14:12     
} PE_M14A0_PE1_DERH_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc00353e4L pe1_derh_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vmm_param                      : 2 ;  //  1: 0     
	UINT32                                    : 6 ;  //  7: 2     reserved
	UINT32 reg_csft_gain                      : 6 ;  // 13: 8     
	UINT32                                    : 2 ;  // 15:14     reserved
	UINT32 reg_th_gain_edge                   : 6 ;  // 21:16     
	UINT32 reg_th_gain_flat                   : 2 ;  // 23:22     
	UINT32 reg_th_manual_th                   : 7 ;  // 30:24     
	UINT32 reg_th_manual_en                   : 1 ;  //    31     
} PE_M14A0_PE1_DERH_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc00353e8L pe1_derh_ctrl_06 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 8 ;  //  7: 0     reserved
	UINT32 edge_filter_white_gain             : 6 ;  // 13: 8     
	UINT32                                    : 2 ;  // 15:14     reserved
	UINT32 edge_filter_black_gain             : 6 ;  // 21:16     
	UINT32                                    : 2 ;  // 23:22     reserved
	UINT32 reg_amean_en                       : 1 ;  //    24     
	UINT32                                    : 1 ;  //    25     reserved
	UINT32 edge_filter_v_tap                  : 2 ;  // 27:26     
	UINT32                                    : 2 ;  // 29:28     reserved
	UINT32 edge_c_filter_en                   : 1 ;  //    30     
	UINT32 edge_y_filter_en                   : 1 ;  //    31     
} PE_M14A0_PE1_DERH_CTRL_06_T;

/*-----------------------------------------------------------------------------
		0xc00353ecL pe1_derh_ctrl_07 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 avg_filter_tap                     : 2 ;  //  1: 0     
	UINT32                                    : 22;  // 23: 2     reserved
	UINT32 flat_filter_gain                   : 6 ;  // 29:24     
	UINT32 flat_filter_type                   : 1 ;  //    30     
	UINT32 flat_filter_en                     : 1 ;  //    31     
} PE_M14A0_PE1_DERH_CTRL_07_T;

/*-----------------------------------------------------------------------------
		0xc00353f0L pe1_derh_ctrl_08 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 amod_ctrl0_y0                      : 8 ;  //  7: 0     
	UINT32 amod_ctrl0_x0                      : 8 ;  // 15: 8     
	UINT32 amod_ctrl0_y1                      : 8 ;  // 23:16     
	UINT32 amod_ctrl0_x1                      : 8 ;  // 31:24     
} PE_M14A0_PE1_DERH_CTRL_08_T;

/*-----------------------------------------------------------------------------
		0xc00353f4L pe1_derh_ctrl_09 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 amod_ctrl1_x0                      : 8 ;  //  7: 0     
	UINT32 amod_ctrl1_x1                      : 8 ;  // 15: 8     
	UINT32 y_c_mux_control                    : 3 ;  // 18:16     
	UINT32 chroma_weight                      : 5 ;  // 23:19     
} PE_M14A0_PE1_DERH_CTRL_09_T;

/*-----------------------------------------------------------------------------
		0xc0035400L pe1_derv_ctrl_0 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 der_v_en                           : 1 ;  //     0     
	UINT32 der_gain_mapping                   : 2 ;  //  2: 1     
	UINT32 bif_en                             : 1 ;  //     3     
	UINT32 output_mux                         : 4 ;  //  7: 4     
	UINT32 bif_manual_th                      : 8 ;  // 15: 8     
	UINT32 th_gain                            : 6 ;  // 21:16     
	UINT32                                    : 2 ;  // 23:22     reserved
	UINT32 th_mode                            : 1 ;  //    24     
} PE_M14A0_PE1_DERV_CTRL_0_T;

/*-----------------------------------------------------------------------------
		0xc0035404L pe1_derv_ctrl_1 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 csft_gain                          : 6 ;  //  5: 0     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 csft_mode                          : 1 ;  //     8     
} PE_M14A0_PE1_DERV_CTRL_1_T;

/*-----------------------------------------------------------------------------
		0xc0035408L pe1_derv_ctrl_2 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 mmd_sel                            : 3 ;  //  2: 0     
	UINT32                                    : 1 ;  //     3     reserved
	UINT32 max_sel                            : 3 ;  //  6: 4     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 avg_sel                            : 2 ;  //  9: 8     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 gain_th1                           : 8 ;  // 23:16     
	UINT32 gain_th2                           : 8 ;  // 31:24     
} PE_M14A0_PE1_DERV_CTRL_2_T;

/*-----------------------------------------------------------------------------
		0xc003540cL pe1_derv_ctrl_3 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gain_b                             : 7 ;  //  6: 0     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 gain_w                             : 7 ;  // 14: 8     
} PE_M14A0_PE1_DERV_CTRL_3_T;

/*-----------------------------------------------------------------------------
		0xc0035410L pe1_dp_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 debug_display                      : 3 ;  //  2: 0     
} PE_M14A0_PE1_DP_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035414L pe1_dp_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_gain_b                        : 7 ;  //  6: 0     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 edge_gain_w                        : 7 ;  // 14: 8     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 texture_gain_b                     : 7 ;  // 22:16     
	UINT32                                    : 1 ;  //    23     reserved
	UINT32 texture_gain_w                     : 7 ;  // 30:24     
} PE_M14A0_PE1_DP_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035420L pe1_coring_stat_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 tm_h                               : 16;  // 15: 0     
	UINT32 tm_v                               : 16;  // 31:16     
} PE_M14A0_PE1_CORING_STAT_00_T;

/*-----------------------------------------------------------------------------
		0xc0035424L pe1_coring_stat_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 tm_h                               : 16;  // 15: 0     
} PE_M14A0_PE1_CORING_STAT_01_T;

/*-----------------------------------------------------------------------------
		0xc0035470L pe1_derh_ctrl_0a ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 a2g_mode_e                         : 1 ;  //     0     
	UINT32 a2g_mode_f                         : 1 ;  //     1     
	UINT32                                    : 6 ;  //  7: 2     reserved
	UINT32 a2g_mgain_e                        : 6 ;  // 13: 8     
	UINT32                                    : 2 ;  // 15:14     reserved
	UINT32 a2g_mgain_f                        : 6 ;  // 21:16     
	UINT32                                    : 2 ;  // 23:22     reserved
	UINT32 debug_mode                         : 4 ;  // 27:24     
} PE_M14A0_PE1_DERH_CTRL_0A_T;

/*-----------------------------------------------------------------------------
		0xc0035474L pe1_derh_ctrl_0b ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 e_gain_th1                         : 8 ;  //  7: 0     
	UINT32 e_gain_th2                         : 8 ;  // 15: 8     
	UINT32 f_gain_th1                         : 8 ;  // 23:16     
	UINT32 f_gain_th2                         : 8 ;  // 31:24     
} PE_M14A0_PE1_DERH_CTRL_0B_T;

/*-----------------------------------------------------------------------------
		0xc0035478L pe1_derh_ctrl_0c ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 e_gain_max                         : 6 ;  //  5: 0     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 f_gain_max                         : 6 ;  // 13: 8     
} PE_M14A0_PE1_DERH_CTRL_0C_T;

/*-----------------------------------------------------------------------------
		0xc003547cL pe1_derh_ctrl_0d ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_DERH_CTRL_0D_T;

/*-----------------------------------------------------------------------------
		0xc0035490L pe1_sp_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_enhance_enable                : 1 ;  //     0     
	UINT32                                    : 11;  // 11: 1     reserved
	UINT32 edge_operator_selection            : 2 ;  // 13:12     
} PE_M14A0_PE1_SP_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035494L pe1_sp_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 white_gain                         : 7 ;  //  6: 0     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 black_gain                         : 7 ;  // 14: 8     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 horizontal_gain                    : 8 ;  // 23:16     
	UINT32 vertical_gain                      : 8 ;  // 31:24     
} PE_M14A0_PE1_SP_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035498L pe1_sp_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 sobel_weight                       : 8 ;  //  7: 0     
	UINT32 laplacian_weight                   : 8 ;  // 15: 8     
	UINT32 sobel_manual_mode_en               : 1 ;  //    16     
	UINT32                                    : 7 ;  // 23:17     reserved
	UINT32 sobel_manual_gain                  : 8 ;  // 31:24     
} PE_M14A0_PE1_SP_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003549cL pe1_sp_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_SP_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc00354a0L pe1_sp_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 8 ;  //  7: 0     reserved
	UINT32 display_mode                       : 4 ;  // 11: 8     
	UINT32 gx_weight_manual_mode              : 1 ;  //    12     
	UINT32                                    : 3 ;  // 15:13     reserved
	UINT32 gx_weight_manual_gain              : 8 ;  // 23:16     
} PE_M14A0_PE1_SP_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc00354a8L pe1_sp_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_SP_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc00354acL pe1_sp_ctrl_06 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lap_h_mode                         : 2 ;  //  1: 0     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 lap_v_mode                         : 1 ;  //     4     
} PE_M14A0_PE1_SP_CTRL_06_T;

/*-----------------------------------------------------------------------------
		0xc00354b0L pe1_sp_ctrl_07 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_en                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 gb_mode                            : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 gb_x1                              : 8 ;  // 15: 8     
	UINT32 gb_y1                              : 8 ;  // 23:16     
} PE_M14A0_PE1_SP_CTRL_07_T;

/*-----------------------------------------------------------------------------
		0xc00354b4L pe1_sp_ctrl_08 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_x2                              : 8 ;  //  7: 0     
	UINT32 gb_y2                              : 8 ;  // 15: 8     
	UINT32 gb_y3                              : 8 ;  // 23:16     
} PE_M14A0_PE1_SP_CTRL_08_T;

/*-----------------------------------------------------------------------------
		0xc00354b8L pe1_sp_ctrl_09 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_x_l0                          : 8 ;  //  7: 0     
	UINT32 lum1_x_l1                          : 8 ;  // 15: 8     
	UINT32 lum1_x_h0                          : 8 ;  // 23:16     
	UINT32 lum1_x_h1                          : 8 ;  // 31:24     
} PE_M14A0_PE1_SP_CTRL_09_T;

/*-----------------------------------------------------------------------------
		0xc00354bcL pe1_sp_ctrl_0a ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_y0                            : 8 ;  //  7: 0     
	UINT32 lum1_y1                            : 8 ;  // 15: 8     
	UINT32 lum1_y2                            : 8 ;  // 23:16     
	UINT32 lum2_x_l0                          : 8 ;  // 31:24     
} PE_M14A0_PE1_SP_CTRL_0A_T;

/*-----------------------------------------------------------------------------
		0xc00354c0L pe1_sp_ctrl_0b ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_x_l1                          : 8 ;  //  7: 0     
	UINT32 lum2_x_h0                          : 8 ;  // 15: 8     
	UINT32 lum2_x_h1                          : 8 ;  // 23:16     
	UINT32 lum2_y0                            : 8 ;  // 31:24     
} PE_M14A0_PE1_SP_CTRL_0B_T;

/*-----------------------------------------------------------------------------
		0xc00354c4L pe1_sp_ctrl_0c ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_y1                            : 8 ;  //  7: 0     
	UINT32 lum2_y2                            : 8 ;  // 15: 8     
} PE_M14A0_PE1_SP_CTRL_0C_T;

/*-----------------------------------------------------------------------------
		0xc00354d0L pe1_debug_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable_debug_mode                  : 1 ;  //     0     
	UINT32 status_enable                      : 1 ;  //     1     
	UINT32 debug_mode                         : 1 ;  //     2     
	UINT32 show_dce_blur                      : 1 ;  //     3     
	UINT32                                    : 5 ;  //  8: 4     reserved
	UINT32 show_sqm2                          : 1 ;  //     9     
	UINT32 sqm2_debug_image                   : 4 ;  // 13:10     
	UINT32                                    : 1 ;  //    14     reserved
	UINT32 show_bbd                           : 2 ;  // 16:15     
	UINT32 bbd_line_width                     : 3 ;  // 19:17     
	UINT32 show_apl                           : 1 ;  //    20     
} PE_M14A0_PE1_DEBUG_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00354d4L pe1_debug_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 1 ;  //     0     reserved
	UINT32 force_yy_enable                    : 1 ;  //     1     
	UINT32 force_cb_enable                    : 1 ;  //     2     
	UINT32 force_cr_enable                    : 1 ;  //     3     
	UINT32 yc_debug_mode_sel                  : 3 ;  //  6: 4     
} PE_M14A0_PE1_DEBUG_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00354d8L pe1_debug_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 10;  //  9: 0     reserved
	UINT32 force_cb                           : 10;  // 19:10     
	UINT32 force_cr                           : 10;  // 29:20     
} PE_M14A0_PE1_DEBUG_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00354f0L pe1_mp_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_enhance_enable                : 1 ;  //     0     
	UINT32                                    : 11;  // 11: 1     reserved
	UINT32 edge_operator_selection            : 2 ;  // 13:12     
} PE_M14A0_PE1_MP_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00354f4L pe1_mp_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 white_gain                         : 7 ;  //  6: 0     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 black_gain                         : 7 ;  // 14: 8     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 horizontal_gain                    : 8 ;  // 23:16     
	UINT32 vertical_gain                      : 8 ;  // 31:24     
} PE_M14A0_PE1_MP_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00354f8L pe1_mp_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 sobel_weight                       : 8 ;  //  7: 0     
	UINT32 laplacian_weight                   : 8 ;  // 15: 8     
	UINT32 sobel_manual_mode_en               : 1 ;  //    16     
	UINT32                                    : 7 ;  // 23:17     reserved
	UINT32 sobel_manual_gain                  : 8 ;  // 31:24     
} PE_M14A0_PE1_MP_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00354fcL pe1_mp_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_MP_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035500L pe1_mp_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 8 ;  //  7: 0     reserved
	UINT32 display_mode                       : 4 ;  // 11: 8     
	UINT32 gx_weight_manual_mode              : 1 ;  //    12     
	UINT32                                    : 3 ;  // 15:13     reserved
	UINT32 gx_weight_manual_gain              : 8 ;  // 23:16     
} PE_M14A0_PE1_MP_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035508L pe1_mp_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_MP_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc003550cL pe1_mp_ctrl_06 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lap_h_mode                         : 3 ;  //  2: 0     
	UINT32                                    : 1 ;  //     3     reserved
	UINT32 lap_v_mode                         : 3 ;  //  6: 4     
} PE_M14A0_PE1_MP_CTRL_06_T;

/*-----------------------------------------------------------------------------
		0xc0035510L pe1_mp_ctrl_07 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_en                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 gb_mode                            : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 gb_x1                              : 8 ;  // 15: 8     
	UINT32 gb_y1                              : 8 ;  // 23:16     
} PE_M14A0_PE1_MP_CTRL_07_T;

/*-----------------------------------------------------------------------------
		0xc0035514L pe1_mp_ctrl_08 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_x2                              : 8 ;  //  7: 0     
	UINT32 gb_y2                              : 8 ;  // 15: 8     
	UINT32 gb_y3                              : 8 ;  // 23:16     
} PE_M14A0_PE1_MP_CTRL_08_T;

/*-----------------------------------------------------------------------------
		0xc0035518L pe1_mp_ctrl_09 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_x_l0                          : 8 ;  //  7: 0     
	UINT32 lum1_x_l1                          : 8 ;  // 15: 8     
	UINT32 lum1_x_h0                          : 8 ;  // 23:16     
	UINT32 lum1_x_h1                          : 8 ;  // 31:24     
} PE_M14A0_PE1_MP_CTRL_09_T;

/*-----------------------------------------------------------------------------
		0xc003551cL pe1_mp_ctrl_0a ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_y0                            : 8 ;  //  7: 0     
	UINT32 lum1_y1                            : 8 ;  // 15: 8     
	UINT32 lum1_y2                            : 8 ;  // 23:16     
	UINT32 lum2_x_l0                          : 8 ;  // 31:24     
} PE_M14A0_PE1_MP_CTRL_0A_T;

/*-----------------------------------------------------------------------------
		0xc0035520L pe1_mp_ctrl_0b ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_x_l1                          : 8 ;  //  7: 0     
	UINT32 lum2_x_h0                          : 8 ;  // 15: 8     
	UINT32 lum2_x_h1                          : 8 ;  // 23:16     
	UINT32 lum2_y0                            : 8 ;  // 31:24     
} PE_M14A0_PE1_MP_CTRL_0B_T;

/*-----------------------------------------------------------------------------
		0xc0035524L pe1_mp_ctrl_0c ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_y1                            : 8 ;  //  7: 0     
	UINT32 lum2_y2                            : 8 ;  // 15: 8     
} PE_M14A0_PE1_MP_CTRL_0C_T;

/*-----------------------------------------------------------------------------
		0xc0035530L pe1_cti_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cti_en                             : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 filter_tap_size                    : 3 ;  //  6: 4     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 cti_gain                           : 8 ;  // 15: 8     
} PE_M14A0_PE1_CTI_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035534L pe1_cti_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 coring_th0                         : 8 ;  //  7: 0     
	UINT32 coring_th1                         : 8 ;  // 15: 8     
	UINT32 coring_map_filter                  : 3 ;  // 18:16     
	UINT32                                    : 1 ;  //    19     reserved
	UINT32 coring_tap_size                    : 3 ;  // 22:20     
	UINT32                                    : 1 ;  //    23     reserved
	UINT32 debug_mode                         : 2 ;  // 25:24     
} PE_M14A0_PE1_CTI_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035538L pe1_cti_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ycm_en0                            : 1 ;  //     0     
	UINT32 ycm_en1                            : 1 ;  //     1     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 ycm_band_sel                       : 3 ;  //  6: 4     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 ycm_diff_th                        : 8 ;  // 15: 8     
	UINT32 ycm_y_gain                         : 4 ;  // 19:16     
	UINT32 ycm_c_gain                         : 4 ;  // 23:20     
} PE_M14A0_PE1_CTI_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc0035540L pe1_ti_ctrl_0 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                             : 1 ;  //     0     
	UINT32 debug_coring                       : 1 ;  //     1     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 coring_step                        : 3 ;  //  6: 4     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 coring_th                          : 8 ;  // 15: 8     
	UINT32 y_gain                             : 8 ;  // 23:16     
	UINT32 c_gain                             : 8 ;  // 31:24     
} PE_M14A0_PE1_TI_CTRL_0_T;

/*-----------------------------------------------------------------------------
		0xc0035544L pe1_ti_ctrl_1 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gain0_en                           : 1 ;  //     0     
	UINT32 gain1_en                           : 1 ;  //     1     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 output_mux                         : 2 ;  //  5: 4     
	UINT32                                    : 10;  // 15: 6     reserved
	UINT32 gain0_th0                          : 8 ;  // 23:16     
	UINT32 gain1_th1                          : 8 ;  // 31:24     
} PE_M14A0_PE1_TI_CTRL_1_T;

/*-----------------------------------------------------------------------------
		0xc0035548L pe1_ti_ctrl_2 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gain1_div_mode                     : 2 ;  //  1: 0     
} PE_M14A0_PE1_TI_CTRL_2_T;

/*-----------------------------------------------------------------------------
		0xc0035550L pe1_blur_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                             : 1 ;  //     0     
	UINT32 coring_en                          : 1 ;  //     1     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 direction                          : 2 ;  //  5: 4     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 gain                               : 8 ;  // 15: 8     
	UINT32 coring_min                         : 8 ;  // 23:16     
	UINT32 coring_max                         : 8 ;  // 31:24     
} PE_M14A0_PE1_BLUR_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc0035554L pe1_dce_blur_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 avg_filter_tap                     : 2 ;  //  1: 0     
	UINT32 edge_map_tap                       : 2 ;  //  3: 2     
	UINT32 edge_median_en                     : 1 ;  //     4     
	UINT32 edge_to_weight_en                  : 1 ;  //     5     
	UINT32 edge_blend_mode                    : 2 ;  //  7: 6     
	UINT32 edge_gain                          : 5 ;  // 12: 8     
} PE_M14A0_PE1_DCE_BLUR_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035558L pe1_dce_blur_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 e_to_w_th_x0                       : 8 ;  //  7: 0
	UINT32 e_to_w_th_x1                       : 8 ;  // 15: 8     
	UINT32 e_to_w_th_y0                       : 8 ;  // 23:16     
	UINT32 e_to_w_th_y1                       : 8 ;  // 31:24     
} PE_M14A0_PE1_DCE_BLUR_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc003555cL pe1_dce_blur_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 chroma_blur_mode                   : 1 ;  //     0     
} PE_M14A0_PE1_DCE_BLUR_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc0035560L pe1_coring_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ga_max                             : 6 ;  //  5: 0     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 ga_th0                             : 8 ;  // 15: 8     
	UINT32 ga_th1                             : 8 ;  // 23:16     
	UINT32 amap1_sel                          : 2 ;  // 25:24     
	UINT32 amap2_sel                          : 2 ;  // 27:26     
	UINT32 edge_a_sel                         : 1 ;  //    28     
	UINT32 debug_a_sel                        : 1 ;  //    29     
} PE_M14A0_PE1_CORING_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035564L pe1_coring_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_sel                            : 3 ;  //  2: 0     
	UINT32                                    : 1 ;  //     3     reserved
	UINT32 avg_sel                            : 2 ;  //  5: 4     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 a2tw_min                           : 6 ;  // 13: 8     
	UINT32                                    : 2 ;  // 15:14     reserved
	UINT32 a2tw_th0                           : 8 ;  // 23:16     
	UINT32 a2tw_th1                           : 8 ;  // 31:24     
} PE_M14A0_PE1_CORING_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035568L pe1_coring_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 nrv_en                             : 1 ;  //     0     
	UINT32                                    : 7 ;  //  7: 1     reserved
	UINT32 nrv_th1                            : 6 ;  // 13: 8     
	UINT32                                    : 2 ;  // 15:14     reserved
	UINT32 nrv_th2                            : 6 ;  // 21:16     
} PE_M14A0_PE1_CORING_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003556cL pe1_coring_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 nrh_en                             : 1 ;  //     0     
	UINT32                                    : 7 ;  //  7: 1     reserved
	UINT32 nrh_th1                            : 6 ;  // 13: 8     
	UINT32                                    : 2 ;  // 15:14     reserved
	UINT32 nrh_th2                            : 6 ;  // 21:16     
} PE_M14A0_PE1_CORING_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035570L pe1_coring_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 dflt_sel                           : 2 ;  //  1: 0     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 var_th                             : 11;  // 14: 4     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 coring_mode1                       : 2 ;  // 17:16     
	UINT32 coring_mode2                       : 2 ;  // 19:18     
	UINT32 ac_direction                       : 1 ;  //    20     
	UINT32 tflt_en                            : 1 ;  //    21     
	UINT32                                    : 2 ;  // 23:22     reserved
	UINT32 exp_mode                           : 2 ;  // 25:24     
} PE_M14A0_PE1_CORING_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035574L pe1_coring_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gt_max                             : 6 ;  //  5: 0     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 gt_th0                             : 8 ;  // 15: 8     
	UINT32 gt_th1                             : 8 ;  // 23:16     
	UINT32 a2tw_en                            : 1 ;  //    24     
} PE_M14A0_PE1_CORING_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc0035578L pe1_coring_ctrl_06 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 gt_th0a                            : 8 ;  //  7: 0     
	UINT32 gt_th0b                            : 8 ;  // 15: 8     
	UINT32 gt_gain0a                          : 6 ;  // 21:16     
	UINT32                                    : 2 ;  // 23:22     reserved
	UINT32 gt_gain0b                          : 6 ;  // 29:24     
} PE_M14A0_PE1_CORING_CTRL_06_T;

/*-----------------------------------------------------------------------------
		0xc003557cL pe1_coring_ctrl_07 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 g_th0                              : 8 ;  //  7: 0     
	UINT32 g_th1                              : 8 ;  // 15: 8     
	UINT32 amap_gain                          : 7 ;  // 22:16     
	UINT32                                    : 1 ;  //    23     reserved
	UINT32 tmap_gain                          : 7 ;  // 30:24     
} PE_M14A0_PE1_CORING_CTRL_07_T;

/*-----------------------------------------------------------------------------
		0xc0035580L pe1_coring_ctrl_08 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 mp_coring_mode                     : 2 ;  //  1: 0     
	UINT32 sp_coring_mode                     : 2 ;  //  3: 2     
	UINT32 mp_coring_en                       : 1 ;  //     4     
	UINT32 sp_coring_en                       : 1 ;  //     5     
} PE_M14A0_PE1_CORING_CTRL_08_T;

/*-----------------------------------------------------------------------------
		0xc0035584L pe1_coring_ctrl_09 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_gain_b                        : 7 ;  //  6: 0     
	UINT32                                    : 1 ;  //     7     reserved
	UINT32 edge_gain_w                        : 7 ;  // 14: 8     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 texture_gain_b                     : 7 ;  // 22:16     
	UINT32                                    : 1 ;  //    23     reserved
	UINT32 texture_gain_w                     : 7 ;  // 30:24     
} PE_M14A0_PE1_CORING_CTRL_09_T;

/*-----------------------------------------------------------------------------
		0xc0035590L pe1_dj_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 edf_en                             : 1 ;  //     0     
	UINT32 hv_filter_en                       : 1 ;  //     1     
	UINT32 g0_feature_norm_en                 : 1 ;  //     2     
	UINT32 g0_f2g_mapping_en                  : 1 ;  //     3     
	UINT32 line_variation_mode                : 1 ;  //     4     
	UINT32 l_type_protection                  : 1 ;  //     5     
	UINT32 center_blur_en                     : 1 ;  //     6     
	UINT32 direction_type_mode                : 1 ;  //     7     
	UINT32 count_diff_th                      : 5 ;  // 12: 8     
	UINT32                                    : 3 ;  // 15:13     reserved
	UINT32 output_mux                         : 3 ;  // 18:16     
	UINT32                                    : 3 ;  // 21:19     reserved
	UINT32 n_avg_mode                         : 1 ;  //    22     
	UINT32                                    : 1 ;  //    23     reserved
	UINT32 line_variation_diff_threshold      : 8 ;  // 31:24     
} PE_M14A0_PE1_DJ_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035594L pe1_dj_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 level_th                           : 8 ;  //  7: 0     
	UINT32 protect_th                         : 8 ;  // 15: 8     
	UINT32 n_avg_gain                         : 8 ;  // 23:16     
} PE_M14A0_PE1_DJ_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035598L pe1_dj_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 edf_count_min                      : 5 ;  //  4: 0     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 edf_count_max                      : 5 ;  // 12: 8     
} PE_M14A0_PE1_DJ_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003559cL pe1_dj_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 dj_h_count_min                     : 5 ;  //  4: 0     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 dj_h_count_max                     : 5 ;  // 12: 8     
	UINT32                                    : 3 ;  // 15:13     reserved
	UINT32 dj_v_count_min                     : 5 ;  // 20:16     
	UINT32                                    : 3 ;  // 23:21     reserved
	UINT32 dj_v_count_max                     : 5 ;  // 28:24     
} PE_M14A0_PE1_DJ_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc00355a0L pe1_vspyc_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                             : 1 ;  //     0     
	UINT32 graycolor_enable                   : 1 ;  //     1     
	UINT32 color_only_enable                  : 1 ;  //     2     
	UINT32 cb_info                            : 1 ;  //     3     
	UINT32 cr_info                            : 1 ;  //     4     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 center_position                    : 8 ;  // 15: 8     
	UINT32 contrast                           : 10;  // 25:16     
} PE_M14A0_PE1_VSPYC_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00355a4L pe1_vspyc_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 8 ;  //  7: 0     reserved
	UINT32 saturation                         : 8 ;  // 15: 8     
	UINT32 brightness                         : 10;  // 25:16     
} PE_M14A0_PE1_VSPYC_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00355c0L pe1_xvy_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 outputcsc_en                       : 1 ;  //     0     
	UINT32 degamma_en                         : 1 ;  //     1     
	UINT32 pcc_en                             : 1 ;  //     2     
	UINT32 gamma_en                           : 1 ;  //     3     
	UINT32 scaler_en                          : 1 ;  //     4     
	UINT32 hsv_hsl_selection                  : 1 ;  //     5     
	UINT32 s_adpative_scaler_enable           : 1 ;  //     6     
} PE_M14A0_PE1_XVY_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00355c4L pe1_xvy_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef1                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_csc_coef0                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00355c8L pe1_xvy_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef3                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_csc_coef2                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00355ccL pe1_xvy_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef5                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_csc_coef4                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc00355d0L pe1_xvy_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef7                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_csc_coef6                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc00355d4L pe1_xvy_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst0                        : 11;  // 10: 0     
	UINT32                                    : 5 ;  // 15:11     reserved
	UINT32 r_csc_coef8                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc00355d8L pe1_xvy_ctrl_06 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst2                        : 11;  // 10: 0     
	UINT32                                    : 5 ;  // 15:11     reserved
	UINT32 r_csc_ofst1                        : 11;  // 26:16     
} PE_M14A0_PE1_XVY_CTRL_06_T;

/*-----------------------------------------------------------------------------
		0xc00355dcL pe1_xvy_ctrl_07 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst4                        : 14;  // 13: 0     
	UINT32                                    : 2 ;  // 15:14     reserved
	UINT32 r_csc_ofst3                        : 14;  // 29:16     
} PE_M14A0_PE1_XVY_CTRL_07_T;

/*-----------------------------------------------------------------------------
		0xc00355e0L pe1_xvy_ctrl_08 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef0                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_csc_ofst5                        : 14;  // 29:16     
} PE_M14A0_PE1_XVY_CTRL_08_T;

/*-----------------------------------------------------------------------------
		0xc00355e4L pe1_xvy_ctrl_09 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef2                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_pcc_coef1                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_09_T;

/*-----------------------------------------------------------------------------
		0xc00355e8L pe1_xvy_ctrl_0a ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef4                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_pcc_coef3                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_0A_T;

/*-----------------------------------------------------------------------------
		0xc00355ecL pe1_xvy_ctrl_0b ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef6                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_pcc_coef5                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_0B_T;

/*-----------------------------------------------------------------------------
		0xc00355f0L pe1_xvy_ctrl_0c ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef8                        : 15;  // 14: 0     
	UINT32                                    : 1 ;  //    15     reserved
	UINT32 r_pcc_coef7                        : 15;  // 30:16     
} PE_M14A0_PE1_XVY_CTRL_0C_T;

/*-----------------------------------------------------------------------------
		0xc00355f4L pe1_xvy_ctrl_0d ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 scaler                             : 8 ;  //  7: 0     
} PE_M14A0_PE1_XVY_CTRL_0D_T;

/*-----------------------------------------------------------------------------
		0xc0035600L pe1_cen_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cen_detour                         : 1 ;  //     0     
	UINT32                                    : 1 ;  //     1     reserved
	UINT32 select_hsv                         : 1 ;  //     2     
	UINT32 select_rgb                         : 1 ;  //     3     
	UINT32                                    : 1 ;  //     4     reserved
	UINT32 vsp_sel                            : 1 ;  //     5     
	UINT32 global_apl_sel                     : 1 ;  //     6     
	UINT32 reg_cen_bypass                     : 1 ;  //     7     
	UINT32 reg_cen_debug_mode                 : 1 ;  //     8     
	UINT32 debugging_mode_core                : 1 ;  //     9     
	UINT32 core_1st__gain_disable             : 1 ;  //    10     
	UINT32 core_2nd_gain_disable              : 1 ;  //    11     
	UINT32 v_scaler_en                        : 1 ;  //    12     
	UINT32                                    : 3 ;  // 15:13     reserved
	UINT32 demo_mode                          : 8 ;  // 23:16     
	UINT32                                    : 7 ;  // 30:24     reserved
	UINT32 win_control_mode                   : 1 ;  //    31     
} PE_M14A0_PE1_CEN_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035604L pe1_cen_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 show_color_region0                 : 8 ;  //  7: 0     
	UINT32 show_color_region1                 : 8 ;  // 15: 8     
	UINT32 color_region_en0                   : 8 ;  // 23:16     
	UINT32 color_region_en1                   : 8 ;  // 31:24     
} PE_M14A0_PE1_CEN_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035608L pe1_cen_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ihsv_sgain                         : 8 ;  //  7: 0     
	UINT32 ihsv_vgain                         : 8 ;  // 15: 8     
} PE_M14A0_PE1_CEN_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003560cL pe1_cen_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 ihsv_hoffset                       : 8 ;  //  7: 0     
	UINT32 ihsv_soffset                       : 8 ;  // 15: 8     
	UINT32 ihsv_voffset                       : 8 ;  // 23:16     
} PE_M14A0_PE1_CEN_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035610L pe1_cen_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_dark_enhancer_apl_limit_l      : 2 ;  //  1: 0     
	UINT32                                    : 5 ;  //  6: 2     reserved
	UINT32 reg_dark_enhancer_en               : 1 ;  //     7     
	UINT32 den_apl_limit_high                 : 8 ;  // 15: 8     
	UINT32 den_gain                           : 8 ;  // 23:16     
	UINT32 den_coring                         : 8 ;  // 31:24     
} PE_M14A0_PE1_CEN_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035614L pe1_cen_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_cen_address                    : 8 ;  //  7: 0     
	UINT32 hif_cen_ai_sel                     : 3 ;  // 10: 8     
	UINT32                                    : 1 ;  //    11     reserved
	UINT32 hif_cen_ai                         : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_cen_enable                     : 1 ;  //    15     
} PE_M14A0_PE1_CEN_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc0035618L pe1_cen_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_cen_y_wdata                    : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 hif_cen_x_wdata                    : 10;  // 25:16     
} PE_M14A0_PE1_CEN_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc0035620L pe1_conv_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 conv_3d_r_en                       : 1 ;  //     0     
	UINT32 fpacking_r_en                      : 1 ;  //     1     
	UINT32 ffmode_r_en                        : 1 ;  //     2     
	UINT32 load_parity_r                      : 1 ;  //     3     
	UINT32 conv_3d_l_en                       : 1 ;  //     4     
	UINT32 fpacking_l_en                      : 1 ;  //     5     
	UINT32 ffmode_l_en                        : 1 ;  //     6     
	UINT32 load_parity_l                      : 1 ;  //     7     
	UINT32                                    : 8 ;  // 15: 8     reserved
	UINT32 start_parity_r                     : 1 ;  //    16     
	UINT32 start_parity_l                     : 1 ;  //    17     
	UINT32 mv_1_count                         : 14;  // 31:18     
} PE_M14A0_PE1_CONV_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035624L pe1_conv_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 offset_r                           : 7 ;  //  6: 0     
	UINT32                                    : 9 ;  // 15: 7     reserved
	UINT32 offset_l                           : 7 ;  // 22:16     
} PE_M14A0_PE1_CONV_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035628L pe1_conv_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bg_color_grey                      : 8 ;  //  7: 0     
} PE_M14A0_PE1_CONV_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003562cL pe1_conv_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_xpos                       : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 pxl_rep_ypos                       : 12;  // 27:16     
	UINT32 pxl_rep_in                         : 1 ;  //    28     
	UINT32 pxl_rep_out                        : 1 ;  //    29     
} PE_M14A0_PE1_CONV_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035630L pe1_conv_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_width                      : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 pxl_rep_height                     : 12;  // 27:16     
} PE_M14A0_PE1_CONV_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035634L pe1_conv_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_value_g                    : 10;  //  9: 0     
	UINT32 pxl_rep_value_b                    : 10;  // 19:10     
	UINT32 pxl_rep_value_r                    : 10;  // 29:20     
} PE_M14A0_PE1_CONV_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc0035638L pe1_conv_ctrl_06 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_value_g                    : 10;  //  9: 0     
	UINT32 pxl_rep_value_b                    : 10;  // 19:10     
	UINT32 pxl_rep_value_r                    : 10;  // 29:20     
} PE_M14A0_PE1_CONV_CTRL_06_T;

/*-----------------------------------------------------------------------------
		0xc003563cL pe1_conv_ctrl_07 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_col_fil_g_valid                : 1 ;  //     0     
	UINT32 reg_col_fil_b_valid                : 1 ;  //     1     
	UINT32 reg_col_fil_r_valid                : 1 ;  //     2     
	UINT32 reg_col_fil_g_nvalid               : 1 ;  //     3     
	UINT32 reg_col_fil_b_nvalid               : 1 ;  //     4     
	UINT32 reg_col_fil_r_nvalid               : 1 ;  //     5     
} PE_M14A0_PE1_CONV_CTRL_07_T;

/*-----------------------------------------------------------------------------
		0xc0035640L pe1_conv_ctrl_08 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_xpos                       : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 pxl_rep_ypos                       : 12;  // 27:16     
	UINT32 pxl_rep_in                         : 1 ;  //    28     
	UINT32 pxl_rep_out                        : 1 ;  //    29     
} PE_M14A0_PE1_CONV_CTRL_08_T;

/*-----------------------------------------------------------------------------
		0xc0035644L pe1_conv_ctrl_09 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_width                      : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 pxl_rep_height                     : 12;  // 27:16     
} PE_M14A0_PE1_CONV_CTRL_09_T;

/*-----------------------------------------------------------------------------
		0xc0035648L pe1_conv_ctrl_0a ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_value_g                    : 10;  //  9: 0     
	UINT32 pxl_rep_value_b                    : 10;  // 19:10     
	UINT32 pxl_rep_value_r                    : 10;  // 29:20     
} PE_M14A0_PE1_CONV_CTRL_0A_T;

/*-----------------------------------------------------------------------------
		0xc003564cL pe1_conv_ctrl_0b ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_value_g                    : 10;  //  9: 0     
	UINT32 pxl_rep_value_b                    : 10;  // 19:10     
	UINT32 pxl_rep_value_r                    : 10;  // 29:20     
} PE_M14A0_PE1_CONV_CTRL_0B_T;

/*-----------------------------------------------------------------------------
		0xc0035650L pe1_conv_ctrl_0c ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_col_fil_g_valid                : 1 ;  //     0     
	UINT32 reg_col_fil_b_valid                : 1 ;  //     1     
	UINT32 reg_col_fil_r_valid                : 1 ;  //     2     
	UINT32 reg_col_fil_g_nvalid               : 1 ;  //     3     
	UINT32 reg_col_fil_b_nvalid               : 1 ;  //     4     
	UINT32 reg_col_fil_r_nvalid               : 1 ;  //     5     
} PE_M14A0_PE1_CONV_CTRL_0C_T;

/*-----------------------------------------------------------------------------
		0xc0035654L pe1_conv_ctrl_0d ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 mux3d_en                           : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 reg_out_mux                        : 2 ;  //  5: 4     
	UINT32 start_parity                       : 1 ;  //     6     
	UINT32 load_parity                        : 1 ;  //     7     
	UINT32                                    : 8 ;  // 15: 8     reserved
	UINT32 alpha1_gain                        : 8 ;  // 23:16     
	UINT32 alpha0_gain                        : 8 ;  // 31:24     
} PE_M14A0_PE1_CONV_CTRL_0D_T;

/*-----------------------------------------------------------------------------
		0xc0035658L pe1_conv_ctrl_0e ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                                 : 12;  // 11: 0     
	UINT32                                    : 3 ;  // 14:12     reserved
	UINT32 mux_l_window_h_en                  : 1 ;  //    15     
	UINT32 y0                                 : 12;  // 27:16     
	UINT32                                    : 3 ;  // 30:28     reserved
	UINT32 mux_l_window_v_en                  : 1 ;  //    31     
} PE_M14A0_PE1_CONV_CTRL_0E_T;

/*-----------------------------------------------------------------------------
		0xc003565cL pe1_conv_ctrl_0f ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                                 : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 y1                                 : 12;  // 27:16     
} PE_M14A0_PE1_CONV_CTRL_0F_T;

/*-----------------------------------------------------------------------------
		0xc0035660L pe1_conv_ctrl_10 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                                 : 12;  // 11: 0     
	UINT32                                    : 3 ;  // 14:12     reserved
	UINT32 mux_r_window_h_en                  : 1 ;  //    15     
	UINT32 y0                                 : 12;  // 27:16     
	UINT32                                    : 3 ;  // 30:28     reserved
	UINT32 mux_r_window_v_en                  : 1 ;  //    31     
} PE_M14A0_PE1_CONV_CTRL_10_T;

/*-----------------------------------------------------------------------------
		0xc0035664L pe1_conv_ctrl_11 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                                 : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 y1                                 : 12;  // 27:16     
} PE_M14A0_PE1_CONV_CTRL_11_T;

/*-----------------------------------------------------------------------------
		0xc0035668L pe1_conv_ctrl_12 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bg_color_r                         : 8 ;  //  7: 0     
	UINT32 bg_color_b                         : 8 ;  // 15: 8     
	UINT32 bg_color_g                         : 8 ;  // 23:16     
} PE_M14A0_PE1_CONV_CTRL_12_T;

/*-----------------------------------------------------------------------------
		0xc0035670L pe1_dce_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 dynamic_contrast_en                : 1 ;  //     0     
	UINT32 hist_bin_mode                      : 2 ;  //  2: 1     
	UINT32 hist_clear                         : 1 ;  //     3     
	UINT32 window01_enable                    : 1 ;  //     4     
	UINT32 window0_enable                     : 1 ;  //     5     
	UINT32 window1_enable                     : 1 ;  //     6     
	UINT32 window_acquire                     : 1 ;  //     7     
	UINT32 color_region0_sel                  : 1 ;  //     8     
	UINT32 color_region1_sel                  : 1 ;  //     9     
	UINT32 color_region2_sel                  : 1 ;  //    10     
	UINT32 color_region3_sel                  : 1 ;  //    11     
	UINT32 color_region4_sel                  : 1 ;  //    12     
	UINT32 color_region5_sel                  : 1 ;  //    13     
	UINT32 color_region6_sel                  : 1 ;  //    14     
	UINT32 color_region7_sel                  : 1 ;  //    15     
	UINT32 color_region8_sel                  : 1 ;  //    16     
	UINT32 color_region9_sel                  : 1 ;  //    17     
	UINT32 color_region10_sel                 : 1 ;  //    18     
	UINT32 color_region11_sel                 : 1 ;  //    19     
	UINT32 color_region12_sel                 : 1 ;  //    20     
	UINT32 color_region13_sel                 : 1 ;  //    21     
	UINT32 color_region14_sel                 : 1 ;  //    22     
	UINT32 color_region15_sel                 : 1 ;  //    23     
	UINT32 dce_domain_sel                     : 1 ;  //    24     
	UINT32 win_selection                      : 1 ;  //    25     
	UINT32 window_mode_enable                 : 1 ;  //    26     
	UINT32 window_inout_sel                   : 1 ;  //    27     
	UINT32 histogram_mode                     : 2 ;  // 29:28     
} PE_M14A0_PE1_DCE_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035674L pe1_dce_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hist_bin_min_position              : 8 ;  //  7: 0     
	UINT32 hist_bin_max_position              : 8 ;  // 15: 8     
	UINT32 color_region_gain                  : 8 ;  // 23:16     
	UINT32                                    : 4 ;  // 27:24     reserved
	UINT32 blur_v_gain                        : 4 ;  // 31:28     
} PE_M14A0_PE1_DCE_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035678L pe1_dce_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 color_region_en                    : 1 ;  //     0     
	UINT32 color_debug_en                     : 1 ;  //     1     
	UINT32                                    : 2 ;  //  3: 2     reserved
	UINT32 y_grad_gain                        : 2 ;  //  5: 4     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 cb_grad_gain                       : 2 ;  //  9: 8     
	UINT32                                    : 2 ;  // 11:10     reserved
	UINT32 cr_grad_gain                       : 2 ;  // 13:12     
} PE_M14A0_PE1_DCE_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003567cL pe1_dce_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 y_range_min                        : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 y_range_max                        : 10;  // 25:16     
} PE_M14A0_PE1_DCE_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035680L pe1_dce_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cb_range_min                       : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 cb_range_max                       : 10;  // 25:16     
} PE_M14A0_PE1_DCE_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035684L pe1_dce_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cr_range_min                       : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 cr_range_max                       : 10;  // 25:16     
} PE_M14A0_PE1_DCE_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc0035688L pe1_dce_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_address                    : 5 ;  //  4: 0     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 hif_dce_load                       : 1 ;  //     8     
	UINT32                                    : 3 ;  // 11: 9     reserved
	UINT32 hif_dce_ai                         : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_dce_enable                     : 1 ;  //    15     
} PE_M14A0_PE1_DCE_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc003568cL pe1_dce_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_wdata_y                    : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 hif_dyc_wdata_x                    : 10;  // 25:16     
} PE_M14A0_PE1_DCE_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc0035690L pe1_dce_ctrl_08 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_wdata_y_32nd               : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 hif_dyc_wdata_x_32nd               : 10;  // 25:16     
} PE_M14A0_PE1_DCE_CTRL_08_T;

/*-----------------------------------------------------------------------------
		0xc00356a0L pe1_dce_hist_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                   : 5 ;  //  4: 0     
	UINT32                                    : 7 ;  // 11: 5     reserved
	UINT32 hif_hist_ai                        : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_hist_enable                    : 1 ;  //    15     
	UINT32 hif_status_address                 : 3 ;  // 18:16     
	UINT32                                    : 9 ;  // 27:19     reserved
	UINT32 hif_status_ai                      : 1 ;  //    28     
	UINT32 hif_mask                           : 1 ;  //    29     
} PE_M14A0_PE1_DCE_HIST_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc00356a4L pe1_dce_hist_ia_data1 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_DCE_HIST_IA_DATA1_T;

/*-----------------------------------------------------------------------------
		0xc00356a8L pe1_dce_hist_ia_data2 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_DCE_HIST_IA_DATA2_T;

/*-----------------------------------------------------------------------------
		0xc00356acL pe1_dse_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 dynamic_saturation_en              : 1 ;  //     0     
	UINT32 window_mode_enable                 : 1 ;  //     1     
	UINT32 window_inout_sel                   : 1 ;  //     2     
	UINT32 win_selection                      : 1 ;  //     3     
	UINT32 window01_enable                    : 1 ;  //     4     
	UINT32 window0_enable                     : 1 ;  //     5     
	UINT32 window1_enable                     : 1 ;  //     6     
	UINT32 window_acquire                     : 1 ;  //     7     
	UINT32 color_region0_sel                  : 1 ;  //     8     
	UINT32 color_region1_sel                  : 1 ;  //     9     
	UINT32 color_region2_sel                  : 1 ;  //    10     
	UINT32 color_region3_sel                  : 1 ;  //    11     
	UINT32 color_region4_sel                  : 1 ;  //    12     
	UINT32 color_region5_sel                  : 1 ;  //    13     
	UINT32 color_region6_sel                  : 1 ;  //    14     
	UINT32 color_region7_sel                  : 1 ;  //    15     
	UINT32 color_region8_sel                  : 1 ;  //    16     
	UINT32 color_region9_sel                  : 1 ;  //    17     
	UINT32 color_region10_sel                 : 1 ;  //    18     
	UINT32 color_region11_sel                 : 1 ;  //    19     
	UINT32 color_region12_sel                 : 1 ;  //    20     
	UINT32 color_region13_sel                 : 1 ;  //    21     
	UINT32 color_region14_sel                 : 1 ;  //    22     
	UINT32 color_region15_sel                 : 1 ;  //    23     
} PE_M14A0_PE1_DSE_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00356b0L pe1_dse_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_s_status_0                     : 8 ;  //  7: 0     
	UINT32 reg_s_status_1                     : 8 ;  // 15: 8     
	UINT32 reg_fmd_en_0                       : 1 ;  //    16     
	UINT32 reg_fmd_en_1                       : 1 ;  //    17     
	UINT32 reg_tnr_auto_en                    : 1 ;  //    18     
	UINT32 reg_src_freeze                     : 1 ;  //    19     
	UINT32                                    : 4 ;  // 23:20     reserved
	UINT32 color_region_gain                  : 8 ;  // 31:24     
} PE_M14A0_PE1_DSE_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00356b4L pe1_dse_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_wdata_y_32nd               : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 hif_dse_wdata_x_32nd               : 10;  // 25:16     
} PE_M14A0_PE1_DSE_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00356b8L pe1_dse_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_address                    : 5 ;  //  4: 0     
	UINT32                                    : 3 ;  //  7: 5     reserved
	UINT32 hif_dse_load                       : 1 ;  //     8     
	UINT32                                    : 3 ;  // 11: 9     reserved
	UINT32 hif_dse_ai                         : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_dse_enable                     : 1 ;  //    15     
} PE_M14A0_PE1_DSE_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc00356bcL pe1_dse_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_wdata_y                    : 10;  //  9: 0     
	UINT32                                    : 6 ;  // 15:10     reserved
	UINT32 hif_dse_wdata_x                    : 10;  // 25:16     
} PE_M14A0_PE1_DSE_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc00356c0L pe1_wb_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 wb_en                              : 1 ;  //     0     
	UINT32 reg_s_apl_0                        : 8 ;  //  8: 1     
	UINT32 reg_src_info                       : 5 ;  // 13: 9     
	UINT32 mv_0_count                         : 14;  // 27:14     
	UINT32 reg_color_filter_status            : 2 ;  // 29:28     
	UINT32 gamma_en                           : 1 ;  //    30     
	UINT32 degamma_en                         : 1 ;  //    31     
} PE_M14A0_PE1_WB_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00356c4L pe1_wb_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 user_ctrl_g_gain                   : 8 ;  //  7: 0     
	UINT32 user_ctrl_b_gain                   : 8 ;  // 15: 8     
	UINT32 user_ctrl_r_gain                   : 8 ;  // 23:16     
	UINT32 mv_0_v_scalar                      : 6 ;  // 29:24     
	UINT32                                    : 1 ;  //    30     
	UINT32 reg_shp_fw_en                      : 1 ;  //    31     
} PE_M14A0_PE1_WB_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00356c8L pe1_wb_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 user_ctrl_g_offset                 : 8 ;  //  7: 0     
	UINT32 user_ctrl_b_offset                 : 8 ;  // 15: 8     
	UINT32 user_ctrl_r_offset                 : 8 ;  // 23:16     
	UINT32 mv_0_h_scalar                      : 7 ;  // 30:24     
} PE_M14A0_PE1_WB_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00356ccL pe1_cw_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 cw_en                              : 1 ;  //     0     
	UINT32                                    : 3 ;  //  3: 1     reserved
	UINT32 cw_gain_selection                  : 1 ;  //     4     
	UINT32                                    : 11;  // 15: 5     reserved
	UINT32 reg_cw_y4                          : 8 ;  // 23:16     
	UINT32 reg_cw_x4                          : 8 ;  // 31:24     
} PE_M14A0_PE1_CW_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00356d0L pe1_cw_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 user_ctrl_g_gain                   : 8 ;  //  7: 0     
	UINT32 user_ctrl_b_gain                   : 8 ;  // 15: 8     
	UINT32 user_ctrl_r_gain                   : 8 ;  // 23:16     
} PE_M14A0_PE1_CW_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00356d4L pe1_cw_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_cw_y2                          : 8 ;  //  7: 0     
	UINT32 reg_cw_x2                          : 8 ;  // 15: 8     
	UINT32 reg_cw_y3                          : 8 ;  // 23:16     
	UINT32 reg_cw_x3                          : 8 ;  // 31:24     
} PE_M14A0_PE1_CW_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00356d8L pe1_cw_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_cw_y0                          : 8 ;  //  7: 0     
	UINT32 reg_cw_x0                          : 8 ;  // 15: 8     
	UINT32 reg_cw_y1                          : 8 ;  // 23:16     
	UINT32 reg_cw_x1                          : 8 ;  // 31:24     
} PE_M14A0_PE1_CW_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc00356dcL pe1_cw_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 color_region0_sel                  : 1 ;  //     0     
	UINT32 color_region1_sel                  : 1 ;  //     1     
	UINT32 color_region2_sel                  : 1 ;  //     2     
	UINT32 color_region3_sel                  : 1 ;  //     3     
	UINT32 color_region4_sel                  : 1 ;  //     4     
	UINT32 color_region5_sel                  : 1 ;  //     5     
	UINT32 color_region6_sel                  : 1 ;  //     6     
	UINT32 color_region7_sel                  : 1 ;  //     7     
	UINT32 color_region8_sel                  : 1 ;  //     8     
	UINT32 color_region9_sel                  : 1 ;  //     9     
	UINT32 color_region10_sel                 : 1 ;  //    10     
	UINT32 color_region11_sel                 : 1 ;  //    11     
	UINT32 color_region12_sel                 : 1 ;  //    12     
	UINT32 color_region13_sel                 : 1 ;  //    13     
	UINT32 color_region14_sel                 : 1 ;  //    14     
	UINT32 color_region15_sel                 : 1 ;  //    15     
	UINT32 color_region_gain                  : 8 ;  // 23:16     
} PE_M14A0_PE1_CW_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc00356e0L pe1_cen_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_gain0                          : 5 ;  //  4: 0     
	UINT32                                    : 2 ;  //  6: 5     reserved
	UINT32 reg_hue0                           : 9 ;  // 15: 7     
	UINT32 reg_gain1                          : 5 ;  // 20:16     
	UINT32                                    : 2 ;  // 22:21     reserved
	UINT32 reg_hue1                           : 9 ;  // 31:23     
} PE_M14A0_PE1_CEN_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc00356e4L pe1_cen_ctrl_06 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_gain2                          : 5 ;  //  4: 0     
	UINT32                                    : 2 ;  //  6: 5     reserved
	UINT32 reg_hue2                           : 9 ;  // 15: 7     
	UINT32 reg_gain3                          : 5 ;  // 20:16     
	UINT32                                    : 2 ;  // 22:21     reserved
	UINT32 reg_hue3                           : 9 ;  // 31:23     
} PE_M14A0_PE1_CEN_CTRL_06_T;

/*-----------------------------------------------------------------------------
		0xc00356e8L pe1_cen_ctrl_07 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_gain4                          : 5 ;  //  4: 0     
	UINT32                                    : 2 ;  //  6: 5     reserved
	UINT32 reg_hue4                           : 9 ;  // 15: 7     
	UINT32 reg_gain5                          : 5 ;  // 20:16     
	UINT32                                    : 2 ;  // 22:21     reserved
	UINT32 reg_hue5                           : 9 ;  // 31:23     
} PE_M14A0_PE1_CEN_CTRL_07_T;

/*-----------------------------------------------------------------------------
		0xc00356ecL pe1_cen_ctrl_08 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_gain6                          : 5 ;  //  4: 0     
	UINT32                                    : 2 ;  //  6: 5     reserved
	UINT32 reg_hue6                           : 9 ;  // 15: 7     
	UINT32 reg_gain7                          : 5 ;  // 20:16     
	UINT32                                    : 2 ;  // 22:21     reserved
	UINT32 reg_hue7                           : 9 ;  // 31:23     
} PE_M14A0_PE1_CEN_CTRL_08_T;

/*-----------------------------------------------------------------------------
		0xc00356f0L pe1_gmc_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_xpos                       : 12;  // 11: 0     
	UINT32 lut_wmask_g                        : 1 ;  //    12     
	UINT32 lut_wmask_b                        : 1 ;  //    13     
	UINT32 lut_wmask_r                        : 1 ;  //    14     
	UINT32 pxl_rep_area                       : 1 ;  //    15     
	UINT32 pxl_rep_ypos                       : 12;  // 27:16     
	UINT32 pxl_rep_disable_g                  : 1 ;  //    28     
	UINT32 pxl_rep_disable_b                  : 1 ;  //    29     
	UINT32 pxl_rep_disable_r                  : 1 ;  //    30     
	UINT32 pxl_rep_enable                     : 1 ;  //    31     
} PE_M14A0_PE1_GMC_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00356f4L pe1_gmc_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_width                      : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 pxl_rep_height                     : 12;  // 27:16     
	UINT32                                    : 1 ;  //    28     reserved
	UINT32 gmc_disable                        : 1 ;  //    29     
	UINT32 gmc_lut_rd_sel                     : 1 ;  //    30     
	UINT32 gmc_lut_wr_done                    : 1 ;  //    31     
} PE_M14A0_PE1_GMC_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc00356f8L pe1_gmc_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_value_g                    : 10;  //  9: 0     
	UINT32 pxl_rep_value_b                    : 10;  // 19:10     
	UINT32 pxl_rep_value_r                    : 10;  // 29:20     
	UINT32 gmc_mode                           : 2 ;  // 31:30     
} PE_M14A0_PE1_GMC_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc00356fcL pe1_gmc_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 capture_addr                       : 10;  //  9: 0     
	UINT32                                    : 2 ;  // 11:10     reserved
	UINT32 capture_ai                         : 1 ;  //    12     
	UINT32                                    : 3 ;  // 15:13     reserved
	UINT32 capture_num                        : 11;  // 26:16     
} PE_M14A0_PE1_GMC_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc0035700L pe1_gmc_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 lut_data_g                         : 10;  //  9: 0     
	UINT32 lut_data_b                         : 10;  // 19:10     
	UINT32 lut_data_r                         : 10;  // 29:20     
	UINT32 capture_stat_started               : 1 ;  //    30     
	UINT32 capture_stat_ended                 : 1 ;  //    31     
} PE_M14A0_PE1_GMC_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc0035704L pe1_gmc_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 dither_en                          : 1 ;  //     0     
	UINT32 decontour_en                       : 1 ;  //     1     
	UINT32 dither_random_freeze_en            : 1 ;  //     2     
	UINT32 demo_pattern_enable                : 1 ;  //     3     
	UINT32 bit_mode                           : 2 ;  //  5: 4     
	UINT32                                    : 2 ;  //  7: 6     reserved
	UINT32 decontour_gain_r                   : 8 ;  // 15: 8     
	UINT32 decontour_gain_g                   : 8 ;  // 23:16     
	UINT32 decontour_gain_b                   : 8 ;  // 31:24     
} PE_M14A0_PE1_GMC_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035720L pe1_sqm_ctrl_0 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 outmux_debugmap                    : 4 ;  //  3: 0     
	UINT32 iir                                : 4 ;  //  7: 4     
	UINT32 i_score                            : 8 ;  // 15: 8     
	UINT32 v_score                            : 8 ;  // 23:16     
	UINT32 l_score                            : 8 ;  // 31:24     
} PE_M14A0_PE1_SQM_CTRL_0_T;

/*-----------------------------------------------------------------------------
		0xc0035724L pe1_sqm_ctrl_1 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 v_limit                            : 8 ;  //  7: 0     
	UINT32 l_limit                            : 8 ;  // 15: 8     
	UINT32 score_threshold                    : 8 ;  // 23:16     
	UINT32 flat_threshold                     : 8 ;  // 31:24     
} PE_M14A0_PE1_SQM_CTRL_1_T;

/*-----------------------------------------------------------------------------
		0xc0035728L pe1_sqm_ctrl_2 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_x0                             : 11;  // 10: 0     
	UINT32                                    : 5 ;  // 15:11     reserved
	UINT32 win_y0                             : 11;  // 26:16     
} PE_M14A0_PE1_SQM_CTRL_2_T;

/*-----------------------------------------------------------------------------
		0xc003572cL pe1_sqm_ctrl_3 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_x1                             : 11;  // 10: 0     
	UINT32                                    : 5 ;  // 15:11     reserved
	UINT32 win_y1                             : 11;  // 26:16     
} PE_M14A0_PE1_SQM_CTRL_3_T;

/*-----------------------------------------------------------------------------
		0xc0035730L pe1_sqm_ctrl_4 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 charcter_delta_limit               : 8 ;  //  7: 0     
	UINT32 boundary_width                     : 8 ;  // 15: 8     
	UINT32 video_height                       : 8 ;  // 23:16     
} PE_M14A0_PE1_SQM_CTRL_4_T;

/*-----------------------------------------------------------------------------
		0xc0035734L pe1_sqm_ctrl_5 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 pc_threshold                       : 8 ;  //  7: 0     
	UINT32 pc_delta_limit                     : 8 ;  // 15: 8     
	UINT32 pc_pixel_minimal_limit             : 8 ;  // 23:16     
} PE_M14A0_PE1_SQM_CTRL_5_T;

/*-----------------------------------------------------------------------------
		0xc0035738L pe1_sqm_stat ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 blur_pixel                         : 10;  //  9: 0     
	UINT32 sharp_pixel                        : 10;  // 19:10     
	UINT32 sqm_output                         : 10;  // 29:20     
	UINT32 pc_detect                          : 1 ;  //    30     
} PE_M14A0_PE1_SQM_STAT_T;

/*-----------------------------------------------------------------------------
		0xc0035750L pe1_bbd2d_ctrl_0 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 black_boundary_detection_enable    : 1 ;  //     0     
	UINT32 hysterisis_mode                    : 3 ;  //  3: 1     
	UINT32                                    : 3 ;  //  6: 4     reserved
	UINT32 mode_selection                     : 1 ;  //     7     
	UINT32 cnt_th                             : 8 ;  // 15: 8     
	UINT32 diff_th                            : 8 ;  // 23:16     
	UINT32 vcnt                               : 8 ;  // 31:24     
} PE_M14A0_PE1_BBD2D_CTRL_0_T;

/*-----------------------------------------------------------------------------
		0xc0035754L pe1_bbd2d_ctrl_1 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x0                             : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 bbd_y0                             : 12;  // 27:16     
} PE_M14A0_PE1_BBD2D_CTRL_1_T;

/*-----------------------------------------------------------------------------
		0xc0035758L pe1_bbd2d_ctrl_2 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x1                             : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 bbd_y1                             : 12;  // 27:16     
} PE_M14A0_PE1_BBD2D_CTRL_2_T;

/*-----------------------------------------------------------------------------
		0xc003575cL pe1_bbd2d_stat_0 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                                 : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 y0                                 : 12;  // 27:16     
} PE_M14A0_PE1_BBD2D_STAT_0_T;

/*-----------------------------------------------------------------------------
		0xc0035760L pe1_bbd2d_stat_1 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                                 : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 y1                                 : 12;  // 27:16     
} PE_M14A0_PE1_BBD2D_STAT_1_T;

/*-----------------------------------------------------------------------------
		0xc0035770L pe1_bbd3d_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 black_boundary_detection_enable    : 1 ;  //     0     
	UINT32 hysterisis_mode                    : 3 ;  //  3: 1     
	UINT32 type_3d                            : 3 ;  //  6: 4     
	UINT32 mode_selection                     : 1 ;  //     7     
	UINT32 cnt_th                             : 8 ;  // 15: 8     
	UINT32 diff_th                            : 8 ;  // 23:16     
	UINT32 vcnt                               : 8 ;  // 31:24     
} PE_M14A0_PE1_BBD3D_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035774L pe1_bbd3d_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x0                             : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 bbd_y0                             : 12;  // 27:16     
	UINT32 bbd_read_control                   : 2 ;  // 29:28     
} PE_M14A0_PE1_BBD3D_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035778L pe1_bbd3d_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x1                             : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 bbd_y1                             : 12;  // 27:16     
} PE_M14A0_PE1_BBD3D_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003577cL pe1_bbd3d_stat_0 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x                                  : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 y                                  : 12;  // 27:16     
} PE_M14A0_PE1_BBD3D_STAT_0_T;

/*-----------------------------------------------------------------------------
		0xc0035780L pe1_lrcr_ctrl_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                             : 1 ;  //     0     
	UINT32 adjust_en                          : 1 ;  //     1     
	UINT32 protection_en                      : 1 ;  //     2     
	UINT32 adjust_en2                         : 1 ;  //     3     
	UINT32                                    : 4 ;  //  7: 4     reserved
	UINT32 ff_mode_en                         : 1 ;  //     8     
	UINT32 ff_mode_parity                     : 1 ;  //     9     
	UINT32 ll_mode_enable                     : 1 ;  //    10     
	UINT32 line_parity_select                 : 1 ;  //    11     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 reg_lrcr_gain                      : 4 ;  // 19:16     
	UINT32 hist_rd_en                         : 1 ;  //    20     
	UINT32                                    : 1 ;  //    21     reserved
	UINT32 hist_mode                          : 2 ;  // 23:22     
} PE_M14A0_PE1_LRCR_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc0035784L pe1_lrcr_ctrl_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 th_max_hist                        : 8 ;  //  7: 0     
	UINT32 th_valid_bins                      : 8 ;  // 15: 8     
	UINT32 th1                                : 8 ;  // 23:16     
	UINT32 th0                                : 8 ;  // 31:24     
} PE_M14A0_PE1_LRCR_CTRL_01_T;

/*-----------------------------------------------------------------------------
		0xc0035788L pe1_lrcr_ctrl_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                                 : 12;  // 11: 0     
	UINT32                                    : 2 ;  // 13:12     reserved
	UINT32 hist_l_window_h_bbd                : 1 ;  //    14     
	UINT32 hist_l_window_h_en                 : 1 ;  //    15     
	UINT32 y0                                 : 12;  // 27:16     
	UINT32                                    : 2 ;  // 29:28     reserved
	UINT32 hist_l_window_v_bbd                : 1 ;  //    30     
	UINT32 hist_l_window_v_en                 : 1 ;  //    31     
} PE_M14A0_PE1_LRCR_CTRL_02_T;

/*-----------------------------------------------------------------------------
		0xc003578cL pe1_lrcr_ctrl_03 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                                 : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 y1                                 : 12;  // 27:16     
} PE_M14A0_PE1_LRCR_CTRL_03_T;

/*-----------------------------------------------------------------------------
		0xc0035790L pe1_lrcr_ctrl_04 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                                 : 12;  // 11: 0     
	UINT32                                    : 2 ;  // 13:12     reserved
	UINT32 hist_r_window_h_bbd                : 1 ;  //    14     
	UINT32 hist_r_window_h_en                 : 1 ;  //    15     
	UINT32 y0                                 : 12;  // 27:16     
	UINT32                                    : 2 ;  // 29:28     reserved
	UINT32 hist_r_window_v_bbd                : 1 ;  //    30     
	UINT32 hist_r_window_v_en                 : 1 ;  //    31     
} PE_M14A0_PE1_LRCR_CTRL_04_T;

/*-----------------------------------------------------------------------------
		0xc0035794L pe1_lrcr_ctrl_05 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                                 : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 y1                                 : 12;  // 27:16     
} PE_M14A0_PE1_LRCR_CTRL_05_T;

/*-----------------------------------------------------------------------------
		0xc0035798L pe1_lrcr_ctrl_06 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                                 : 12;  // 11: 0     
	UINT32                                    : 2 ;  // 13:12     reserved
	UINT32 active_window_h_bbd                : 1 ;  //    14     
	UINT32 active_window_h_en                 : 1 ;  //    15     
	UINT32 y0                                 : 12;  // 27:16     
	UINT32                                    : 2 ;  // 29:28     reserved
	UINT32 active_window_v_bbd                : 1 ;  //    30     
	UINT32 active_window_v_en                 : 1 ;  //    31     
} PE_M14A0_PE1_LRCR_CTRL_06_T;

/*-----------------------------------------------------------------------------
		0xc003579cL pe1_lrcr_ctrl_07 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                                 : 12;  // 11: 0     
	UINT32                                    : 4 ;  // 15:12     reserved
	UINT32 y1                                 : 12;  // 27:16     
} PE_M14A0_PE1_LRCR_CTRL_07_T;

/*-----------------------------------------------------------------------------
		0xc00357a0L pe1_lrcr_stat_00 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                           : 8 ;  //  7: 0     
	UINT32 n_valid_bins                       : 8 ;  // 15: 8     
	UINT32 cdf_x1                             : 8 ;  // 23:16     
	UINT32 cdf_x0                             : 8 ;  // 31:24     
} PE_M14A0_PE1_LRCR_STAT_00_T;

/*-----------------------------------------------------------------------------
		0xc00357a4L pe1_lrcr_stat_01 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                           : 8 ;  //  7: 0     
	UINT32 n_valid_bins                       : 8 ;  // 15: 8     
	UINT32 cdf_x1                             : 8 ;  // 23:16     
	UINT32 cdf_x0                             : 8 ;  // 31:24     
} PE_M14A0_PE1_LRCR_STAT_01_T;

/*-----------------------------------------------------------------------------
		0xc00357a8L pe1_lrcr_stat_02 ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                           : 8 ;  //  7: 0     
	UINT32 n_valid_bins                       : 8 ;  // 15: 8     
	UINT32 cdf_x1                             : 8 ;  // 23:16     
	UINT32 cdf_x0                             : 8 ;  // 31:24     
} PE_M14A0_PE1_LRCR_STAT_02_T;

/*-----------------------------------------------------------------------------
		0xc00357b0L pe1_l_g_hist_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                   : 8 ;  //  7: 0     
	UINT32                                    : 4 ;  // 11: 8     reserved
	UINT32 hif_hist_ai                        : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_hist_enable                    : 1 ;  //    15     
	UINT32                                    : 12;  // 27:16     reserved
	UINT32 hist_rd_g_available                : 1 ;  //    28     
} PE_M14A0_PE1_L_G_HIST_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc00357b4L pe1_l_g_hist_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_L_G_HIST_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc00357b8L pe1_l_b_hist_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                   : 8 ;  //  7: 0     
	UINT32                                    : 4 ;  // 11: 8     reserved
	UINT32 hif_hist_ai                        : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_hist_enable                    : 1 ;  //    15     
	UINT32                                    : 12;  // 27:16     reserved
	UINT32 hist_rd_b_available                : 1 ;  //    28     
} PE_M14A0_PE1_L_B_HIST_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc00357bcL pe1_l_b_hist_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_L_B_HIST_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc00357c0L pe1_l_r_hist_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                   : 8 ;  //  7: 0     
	UINT32                                    : 4 ;  // 11: 8     reserved
	UINT32 hif_hist_ai                        : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_hist_enable                    : 1 ;  //    15     
	UINT32                                    : 12;  // 27:16     reserved
	UINT32 hist_rd_r_available                : 1 ;  //    28     
} PE_M14A0_PE1_L_R_HIST_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc00357c4L pe1_l_r_hist_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_L_R_HIST_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc00357c8L pe1_r_g_hist_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                   : 8 ;  //  7: 0     
	UINT32                                    : 4 ;  // 11: 8     reserved
	UINT32 hif_hist_ai                        : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_hist_enable                    : 1 ;  //    15     
	UINT32                                    : 12;  // 27:16     reserved
	UINT32 hist_rd_g_available                : 1 ;  //    28     
} PE_M14A0_PE1_R_G_HIST_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc00357ccL pe1_r_g_hist_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_R_G_HIST_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc00357d0L pe1_r_b_hist_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                   : 8 ;  //  7: 0     
	UINT32                                    : 4 ;  // 11: 8     reserved
	UINT32 hif_hist_ai                        : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_hist_enable                    : 1 ;  //    15     
	UINT32                                    : 12;  // 27:16     reserved
	UINT32 hist_rd_b_available                : 1 ;  //    28     
} PE_M14A0_PE1_R_B_HIST_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc00357d4L pe1_r_b_hist_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_R_B_HIST_IA_DATA_T;

/*-----------------------------------------------------------------------------
		0xc00357d8L pe1_r_r_hist_ia_ctrl ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                   : 8 ;  //  7: 0     
	UINT32                                    : 4 ;  // 11: 8     reserved
	UINT32 hif_hist_ai                        : 1 ;  //    12     
	UINT32                                    : 2 ;  // 14:13     reserved
	UINT32 hif_hist_enable                    : 1 ;  //    15     
	UINT32                                    : 12;  // 27:16     reserved
	UINT32 hist_rd_r_available                : 1 ;  //    28     
	UINT32                                    : 2 ;  // 30:29     reserved
	UINT32 hist_rd_done                       : 1 ;  //    31     
} PE_M14A0_PE1_R_R_HIST_IA_CTRL_T;

/*-----------------------------------------------------------------------------
		0xc00357dcL pe1_r_r_hist_ia_data ''
-----------------------------------------------------------------------------*/
typedef struct {
	UINT32                                    : 32;  // 31: 0     reserved
} PE_M14A0_PE1_R_R_HIST_IA_DATA_T;
typedef struct {
	PE_M14A0_PE1_TOP_CTRL_00_T         	pe1_top_ctrl_00;              //0xc0035300L
	PE_M14A0_PE1_TOP_CTRL_01_T         	pe1_top_ctrl_01;              //0xc0035304L
	PE_M14A0_PE1_TOP_CTRL_02_T         	pe1_top_ctrl_02;              //0xc0035308L
	PE_M14A0_PE1_TOP_CTRL_03_T         	pe1_top_ctrl_03;              //0xc003530cL
	UINT32                             	reserved00[4];                //0xc0035310L~0xc003531cL
	PE_M14A0_PE1_WIN1_CTRL_00_T        	pe1_win1_ctrl_00;             //0xc0035320L
