/*
 * SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 * Copyright(c) 2013 by LG Electronics Inc.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 */

/** @file
 *
 *  VDOGDI register details. ( used only within kdriver )
 *
 *  author     user name (user_name@lge.com)
 *  version    1.0
 *  date       2010.xx.xx
 *
 */

#ifndef _VDOGDI_REG_H_
#define _VDOGDI_REG_H_

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/
// Control Flag
#define VDO_GDI_CBCR_INTLV			(0x1<<16)
#define VDO_GDI_COLOR_MODE_420		(0x0<<17)
#define VDO_GDI_COLOR_MODE_422		(0x1<<17)
#define VDO_GDI_COLOR_MODE_224		(0x2<<17)
#define VDO_GDI_COLOR_MODE_444		(0x3<<17)
#define VDO_GDI_COLOR_MODE_400		(0x4<<17)
#define VDO_GDI_MAP_RASTER			(0<<20)
#define VDO_GDI_MAP_MIXED			(2<<20)
#define VDO_GDI_MAP_TILED_MB_RASTER	(3<<20)


#define VDEC_VDO_GDI_BASE	(VDEC_BASE + 0x60000)

// VDO GDI Register
/////////////////////////////////////////////////////////

#define VDO_GDI_CH1_XY2_AXI_CHR_08                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAA0))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_09                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAA4))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_0A                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAA8))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_0B                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAAC))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_0C                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAB0))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_0D                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAB4))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_0E                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAB8))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_0F                (*(volatile UINT32 *)(stpVdoGdiReg + 0xABC))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_10                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAC0))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_11                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAC4))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_12                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAC8))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_13                (*(volatile UINT32 *)(stpVdoGdiReg + 0xACC))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_14                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAD0))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_15                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAD4))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_16                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAD8))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_17                (*(volatile UINT32 *)(stpVdoGdiReg + 0xADC))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_18                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAE0))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_19                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAE4))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_1A                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAE8))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_1B                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAEC))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_1C                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAF0))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_1D                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAF4))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_1E                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAF8))  //A00
#define VDO_GDI_CH1_XY2_AXI_CHR_1F                (*(volatile UINT32 *)(stpVdoGdiReg + 0xAFC))  //A00

#define VDO_GDI_CH1_XY2_AXI_CONFIG           	  (*(volatile UINT32 *)(stpVdoGdiReg + 0xB00))  //B00


/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/


#ifdef __cplusplus
extern "C" {
#endif
#if 0
/*-----------------------------------------------------------------------------
	0x0000 vdo_gdi_pri_rd_prio_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pri_rd_prio_l                   ;   	// 31: 0
} VDO_GDI_PRI_RD_PRIO_L;

/*-----------------------------------------------------------------------------
	0x0004 vdo_gdi_pri_rd_prio_h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pri_rd_prio_h                   ;   	// 31: 0
} VDO_GDI_PRI_RD_PRIO_H;

/*-----------------------------------------------------------------------------
	0x0010 vdo_gdi_pri_rd_lock_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pri_rd_lock_cnt                 ;   	// 31: 0
} VDO_GDI_PRI_RD_LOCK_CNT;

/*-----------------------------------------------------------------------------
	0x0038 vdo_gdi_pic_init_host ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init                        : 1;	//     0
} VDO_GDI_PIC_INIT_HOST;

/*-----------------------------------------------------------------------------
	0x0040 vdo_gdi_config_report_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	product_name                    ;   	// 31: 0
} VDO_GDI_CONFIG_REPORT_0;

/*-----------------------------------------------------------------------------
	0x0044 vdo_gdi_config_report_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	product_version                 ;   	// 31: 0
} VDO_GDI_CONFIG_REPORT_1;

/*-----------------------------------------------------------------------------
	0x0048 vdo_gdi_config_report_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 7,	//  0: 6 reserved
	axi1k                           : 1,	//     7
	axi2axi_async                   : 1,	//     8
	axi64bit                        : 1,	//     9
	dcu_if                          : 1,	//    10
	axi_2nd                         : 1,	//    11
	ref_clk                         : 1,	//    12
	                                : 1,	//    13  reserved
	map_linear                      : 1,	//    14
	map_tiled                       : 1,	//    15
	                                : 8;	// 16:23 reserved
} VDO_GDI_CONFIG_REPORT_2;

/*-----------------------------------------------------------------------------
	0x004c vdo_gdi_config_report_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mp2_mp                          : 1,	//     0
	mp4_sp                          : 1,	//     1
	mp4_asp                         : 1,	//     2
	mp4_263                         : 1,	//     3
	mp4_dvx                         : 1,	//     4
	mp4_xvid                        : 1,	//     5
	mp4_spk                         : 1,	//     6
	rv8                             : 1,	//     7
	rv9                             : 1,	//     8
	rv10                            : 1,	//     9
	jpg_bp                          : 1,	//    10
	std_h264                        : 1,	//    11
	std_vc1                         : 1,	//    12
	std_mp2                         : 1,	//    13
	std_mp4                         : 1,	//    14
	std_rvx                         : 1,	//    15
	std_avs                         : 1,	//    16
	std_jpg                         : 1,	//    17
	x264_bp                         : 1,	//    18
	x264_mp                         : 1,	//    19
	x264_hp                         : 1,	//    20
	vc1_sp                          : 1,	//    21
	vc1_mp                          : 1,	//    22
	vc1_ap                          : 1,	//    23
	vc1_wmv                         : 1;	//    24
} VDO_GDI_CONFIG_REPORT_3;

/*-----------------------------------------------------------------------------
	0x0050 vdo_gdi_config_report_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	release_ver                     ;   	// 31: 0
} VDO_GDI_CONFIG_REPORT_4;

/*-----------------------------------------------------------------------------
	0x0054 vdo_gdi_config_report_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config_data                     ;   	// 31: 0
} VDO_GDI_CONFIG_REPORT_5;

/*-----------------------------------------------------------------------------
	0x0058 vdo_gdi_config_report_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config_rev                      ;   	// 31: 0
} VDO_GDI_CONFIG_REPORT_6;

/*-----------------------------------------------------------------------------
	0x005c vdo_gdi_config_report_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	config_type                     ;   	// 31: 0
} VDO_GDI_CONFIG_REPORT_7;

/*-----------------------------------------------------------------------------
	0x0060 vdo_gdi_pinfo_req ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pinfo_req                       : 1;	//     0
} VDO_GDI_PINFO_REQ;

/*-----------------------------------------------------------------------------
	0x0064 vdo_gdi_pinfo_ack ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pinfo_ack                       : 1;	//     0
} VDO_GDI_PINFO_ACK;

/*-----------------------------------------------------------------------------
	0x0068 vdo_gdi_pinfo_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 2,	//  0: 1 reserved
	pinfo_addr                      : 8;	//  2: 9
} VDO_GDI_PINFO_ADDR;

/*-----------------------------------------------------------------------------
	0x006c vdo_gdi_pinfo_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pinfo_rdata                     ;   	// 31: 0
} VDO_GDI_PINFO_DATA;

/*-----------------------------------------------------------------------------
	0x0400 vdo_gdi_info_control ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stride                          :16,	//  0:15
	cbcrinterleaved                 : 1,	//    16
	colormode                       : 3,	// 17:19
	framemap                        : 2;	// 20:21
} VDO_GDI_INFO_CONTROL;

/*-----------------------------------------------------------------------------
	0x0404 vdo_gdi_info_pic_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	picversizeluma                  :16,	//  0:15
	pichorsizeluma                  :16;	// 16:31
} VDO_GDI_INFO_PIC_SIZE;

/*-----------------------------------------------------------------------------
	0x0408 vdo_gdi_info_base_y ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lumabaseaddr                    ;   	// 31: 0
} VDO_GDI_INFO_BASE_Y;

/*-----------------------------------------------------------------------------
	0x040c vdo_gdi_info_base_cb ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cbbaseaddr                      ;   	// 31: 0
} VDO_GDI_INFO_BASE_CB;

/*-----------------------------------------------------------------------------
	0x0410 vdo_gdi_info_base_cr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	crbaseaddr                      ;   	// 31: 0
} VDO_GDI_INFO_BASE_CR;

/*-----------------------------------------------------------------------------
	0x0800~0x083c vdo_gdi_ch_xy2_cas_n (n<16) ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bitselcr                        : 4,	//  0: 3
	xyselcr                         : 1,	//     4
	topbotcr                        : 1,	//     5
	zerocr                          : 1,	//     6
	invertcr                        : 1,	//     7
	xysellu                         : 4,	//  8:11
	bitsellu                        : 1,	//    12
	topbotlu                        : 1,	//    13
	zerolu                          : 1,	//    14
	invertlu                        : 1;	//    15
} VDO_GDI_CH_XY2_CAS;

/*-----------------------------------------------------------------------------
	0x0840~0x084c vdo_gdi_ch_xy2_ba_n (n<4) ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bitselcr                        : 4,	//  0: 3
	xyselcr                         : 1,	//     4
	topbotcr                        : 1,	//     5
	zerocr                          : 1,	//     6
	invertcr                        : 1,	//     7
	xysellu                         : 4,	//  8:11
	bitsellu                        : 1,	//    12
	topbotlu                        : 1,	//    13
	zerolu                          : 1,	//    14
	invertlu                        : 1;	//    15
} VDO_GDI_CH_XY2_BA;

/*-----------------------------------------------------------------------------
	0x0850~0x088c vdo_gdi_ch_xy2_ras_n (n<16) ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bitselcr                        : 4,	//  0: 3
	xyselcr                         : 1,	//     4
	topbotcr                        : 1,	//     5
	zerocr                          : 1,	//     6
	invertcr                        : 1,	//     7
	xysellu                         : 4,	//  8:11
	bitsellu                        : 1,	//    12
	topbotlu                        : 1,	//    13
	zerolu                          : 1,	//    14
	invertlu                        : 1;	//    15
} VDO_GDI_CH_XY2_RAS;

/*-----------------------------------------------------------------------------
	0x0890 vdo_gdi_ch_xy2_rbc_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	burstlenfieldcr                 : 4,	//  0: 3
	burstlenframecr                 : 4,	//  4: 7
	burstlenfieldlu                 : 4,	//  8:11
	burstlenframelu                 : 4,	// 12:15
	addrincdir                      : 1,	//    16
	tiledmap                        : 1,	//    17
	topbotsplit                     : 1,	//    18
	fieldmemmap                     : 1,	//    19
	maxburstlinear                  : 4;	// 20:23
} VDO_GDI_CH_XY2_RBC_CONFIG;

/*-----------------------------------------------------------------------------
	0x08a0~0x091c vdo_gdi_ch_rbc2_axi_n (n<32) ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bitsel                          : 4,	//  0: 3
	rbcsel                          : 2;	//  4: 5
} VDO_GDI_CH_RBC2_AXI;

/*-----------------------------------------------------------------------------
	0x0920 vdo_gdi_ch_tiledbuf_base ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tiledbaseaddr                   ;   	// 31: 0
} VDO_GDI_CH_TILEDBUF_BASE;

typedef struct {
	VDO_GDI_PRI_RD_PRIO_L           	vdo_gdi_pri_rd_prio_l           ;	// 0x0000 : ''
	VDO_GDI_PRI_RD_PRIO_H           	vdo_gdi_pri_rd_prio_h           ;	// 0x0004 : ''
	UINT32                          	                 __rsvd_00[   2];	// 0x0008 ~ 0x000c
	VDO_GDI_PRI_RD_LOCK_CNT         	vdo_gdi_pri_rd_lock_cnt         ;	// 0x0010 : ''
	UINT32                          	                 __rsvd_01[   9];	// 0x0014 ~ 0x0034
	VDO_GDI_PIC_INIT_HOST           	vdo_gdi_pic_init_host           ;	// 0x0038 : ''
	UINT32                          	                 __rsvd_02[   1];	// 0x003c
	VDO_GDI_CONFIG_REPORT_0         	vdo_gdi_config_report_0         ;	// 0x0040 : ''
	VDO_GDI_CONFIG_REPORT_1         	vdo_gdi_config_report_1         ;	// 0x0044 : ''
	VDO_GDI_CONFIG_REPORT_2         	vdo_gdi_config_report_2         ;	// 0x0048 : ''
	VDO_GDI_CONFIG_REPORT_3         	vdo_gdi_config_report_3         ;	// 0x004c : ''
	VDO_GDI_CONFIG_REPORT_4         	vdo_gdi_config_report_4         ;	// 0x0050 : ''
	VDO_GDI_CONFIG_REPORT_5         	vdo_gdi_config_report_5         ;	// 0x0054 : ''
	VDO_GDI_CONFIG_REPORT_6         	vdo_gdi_config_report_6         ;	// 0x0058 : ''
	VDO_GDI_CONFIG_REPORT_7         	vdo_gdi_config_report_7         ;	// 0x005c : ''
	VDO_GDI_PINFO_REQ               	vdo_gdi_pinfo_req               ;	// 0x0060 : ''
	VDO_GDI_PINFO_ACK               	vdo_gdi_pinfo_ack               ;	// 0x0064 : ''
	VDO_GDI_PINFO_ADDR              	vdo_gdi_pinfo_addr              ;	// 0x0068 : ''
	VDO_GDI_PINFO_DATA              	vdo_gdi_pinfo_data              ;	// 0x006c : ''
	UINT32                          	                 __rsvd_03[ 228];	// 0x0070 ~ 0x03fc
	VDO_GDI_INFO_CONTROL            	vdo_gdi_info_control            ;	// 0x0400 : ''
	VDO_GDI_INFO_PIC_SIZE           	vdo_gdi_info_pic_size           ;	// 0x0404 : ''
	VDO_GDI_INFO_BASE_Y             	vdo_gdi_info_base_y             ;	// 0x0408 : ''
	VDO_GDI_INFO_BASE_CB            	vdo_gdi_info_base_cb            ;	// 0x040c : ''
	VDO_GDI_INFO_BASE_CR            	vdo_gdi_info_base_cr            ;	// 0x0410 : ''
	UINT32                          	                 __rsvd_04[ 251];	// 0x0414 ~ 0x07fc
	struct {
	VDO_GDI_CH_XY2_CAS              	vdo_gdi_ch_xy2_cas[16]          ;	// 0x0800 ~ 0x083c
	VDO_GDI_CH_XY2_BA               	vdo_gdi_ch_xy2_ba[4]            ;	// 0x0840 ~ 0x084c
	VDO_GDI_CH_XY2_RAS              	vdo_gdi_ch_xy2_ras[16]          ;	// 0x0850 ~ 0x088c
	VDO_GDI_CH_XY2_RBC_CONFIG       	vdo_gdi_ch_xy2_rbc_config       ;	// 0x0890 : ''
	VDO_GDI_CH_RBC2_AXI             	vdo_gdi_ch_rbc2_axi[32]         ;	// 0x08a0 ~ 0x0891
	VDO_GDI_CH_TILEDBUF_BASE        	vdo_gdi_ch_tiledbuf_base        ;	// 0x0920 : ''
	UINT32                          	                 __rsvd_05[  55];	// 0x0924 ~ 0x09fc
	} vdo_gdi_ch_tiledmap[2];
} VDOGDI_REG_T;
/* 58 regs, 58 types */

/* 59 regs, 59 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegVDOGDI : real register of VDOGDI.
 * gpRegVDOGDI     : shadow register.
 *
 * @def VDOGDI_RdFL: Read  FLushing : Shadow <- Real.
 * @def VDOGDI_WrFL: Write FLushing : Shadow -> Real.
 * @def VDOGDI_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def VDOGDI_Wr  : Write whole register(UINT32) from Shadow register.
 * @def VDOGDI_Rd01 ~ VDOGDI_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def VDOGDI_Wr01 ~ VDOGDI_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define VDOGDI_RdFL(_r)			((gpRegVDOGDI->_r)=(gpRealRegVDOGDI->_r))
#define VDOGDI_WrFL(_r)			((gpRealRegVDOGDI->_r)=(gpRegVDOGDI->_r))

#define VDOGDI_Rd(_r)			*((UINT32*)(&(gpRegVDOGDI->_r)))
#define VDOGDI_Wr(_r,_v)			((VDOGDI_Rd(_r))=((UINT32)(_v)))

