/*
 * SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 * Copyright(c) 2013 by LG Electronics Inc.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 */


/** @file
 *
 *  sdec driver
 *
 *  @author	Jihoon Lee ( gaius.lee@lge.com)
 *  @author	Jinhwan Bae ( jinhwan.bae@lge.com) - modifier
 *  @version	1.0
 *  @date		2010-03-30
 *  @note		Additional information.
 */


#ifndef _SDEC_REG_H_
#define _SDEC_REG_H_

#include "sys_reg_base.h"
#include "sdec_cfg.h"

#ifdef __cplusplus
extern "C" {
#endif


/*-----------------------------------------------------------------------------
	0x0000 vid_out_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vid0_sel                        : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	vid1_sel                        : 2,	//  4: 5
	                                : 2,	//  6: 7 reserved
	vid2_sel                        : 2;	//  8: 9
} VID_OUT_SEL;

/*-----------------------------------------------------------------------------
	0x0004 dl_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dl0_sel                         : 2,	//    0: 1
	                                : 2,	//    2: 3 reserved
	dl1_sel                         : 2;	//    4: 5
} DL_SEL;


/*-----------------------------------------------------------------------------
	0x0008 aud_out_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud0_sel                        : 1,	//  0
	                                : 3,	//  1: 3 reserved
	aud1_sel                        : 1;	//  4
} AUD_OUT_SEL;

/*-----------------------------------------------------------------------------
	0x000C up_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	up0_sel                         : 1,	//     0
	                                : 3,	//  1: 3 reserved
	up1_sel                         : 1;	//     4
} UP_SEL;

/*-----------------------------------------------------------------------------
	0x0010 stpo_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stpo_sel                        : 2;	//  0: 1
} STPO_SEL;

/*-----------------------------------------------------------------------------
	0x001C axi_flush_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sdec0_flush_en                  : 1,	//     0
	dvr_flush_en  	                : 1,	//     1
	sdec1_flush_en 	                : 1;	//     2
} AXI_FLUSH_CONF;

/*-----------------------------------------------------------------------------
	0x0020 axi_user_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dvr_aruser		                : 2,	//  0: 1
									: 2,	// 	2: 3
	dvr_awuser						: 2,	//	4: 5
									: 2,	// 	6: 7
	sdec0_aruser	                : 2,	//  8: 9
									: 2,	// 	10: 11
	sdec0_awuser	                : 2,	//  12: 13
									: 2,	// 	14: 15
	sdec1_aruser	                : 2,	//  16: 17
									: 2,	// 	18: 19
	sdec1_awuser	                : 2;	//  20: 21
} AXI_USER_CONF;


/*-----------------------------------------------------------------------------
	0x0080 ~ 0x009c ts_src_sel0~7 from H15
------------------------------------------------------------------------------*/
typedef struct {
    UINT32
    src_sel                         : 1,    //     0
                                    : 3,    //  1: 3 reserved
    demod_sel                       : 3,    //  4: 6
                                    : 1,    //     7 reserved
    ci_sel                          : 2;    //  8: 9
} TS_SRC_SEL;

/*-----------------------------------------------------------------------------
	0x00a0 stcc0_ref1 from H15
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc0_ref1                      : 1;	//     0
} STCC0_REF1;

/*-----------------------------------------------------------------------------
	0x00a4 stcc0_ref32 from H15
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc0_ref32                     :32;	//  31: 0
} STCC0_REF32;

/*-----------------------------------------------------------------------------
	0x00a8 stcc0_real1 from H15
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc0_real1                     : 1;	//     0
} STCC0_REAL1;

/*-----------------------------------------------------------------------------
	0x00ac stcc0_real32 from H15
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc0_real32                    :32;	//  31: 0
} STCC0_REAL32;

/*-----------------------------------------------------------------------------
	0x00c0 dco_fcw_ctrl from H15
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dco_fcw_ctrl                    :22;	//  21: 0
} DCO_FCW_CTRL;


/*-----------------------------------------------------------------------------
	0x0000~0x000c cdip0 ~ cdip3 ''
------------------------------------------------------------------------------*/
typedef struct{
	UINT32
	dtype           :  4,
	sync_type       :  2,
	                       : 2,
	clk_div         :  7,
	                    :  1,
	pconf           :  2,
	                :  2,
	req_en          :  1,
	val_en          :  1,
	                :  1,
	err_en          :  1,
	req_act_lo      :  1,
	val_act_lo      :  1,
	clk_act_lo      :  1,
	err_act_hi      :  1,
	                :  2,
	test_en         :  1,
	en              :  1;
}CDIP;
/*-----------------------------------------------------------------------------
	0x0010~0x0014 cdiop0 ~ cdiop1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dtype                           : 4,	//  0: 3
	sync_type                       : 2,	//  4: 5
	                                : 2,	//  6: 7 reserved
	clk_div                         : 7,	//  8:14
	                                : 1,	//    15 reserved
	pconf                           : 1,	// 16
	cdinout							: 1,	// 17
	val_sel                         : 2,	// 18:19
	req_en                          : 1,	//    20
	val_en                          : 1,	//    21
	err_en                          : 1,	//    22
	                                : 1,	//    23 reserved
	req_act_lo                      : 1,	//    24
	val_act_lo                      : 1,	//    25
	clk_act_lo                      : 1,	//    26
	err_act_hi                      : 1,	//    27
	                                : 2,	// 28:29 reserved
	test_en                         : 1,	//    30
	en                              : 1;	//    31
} CDIOP, CDOP;

/*-----------------------------------------------------------------------------
	0x0018 cdin_parallel_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p_sel                           : 1;	//     0
} CDIN_PARALLEL_SEL;

/*-----------------------------------------------------------------------------
	0x001C cdic3_dl_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dl0_sel                         : 1,	//    0
	dl1_sel 		 			 	: 1,	//	1
									: 2,	// 	2: 3 reserved
	dl0_ext_sel						: 1,	//	4
	dl1_ext_sel						: 1,	//	5
									: 2,	//	6: 7 reserved
	pidf0_en						: 1,	//	8
	pidf1_en						: 1,	// 	9
	pidf2_en						: 1,	//	10
	pidf3_en						: 1,	//	11
	pidf_addr						: 2,	//	12: 13
									: 2, 	// 	14: 15 reserved
	pidf_val						: 13,	//	16: 28
									: 2,	//	29: 30 reserved
	pid_wr_en						: 1;	//	31
} CDIC3_DL_CONF;

/*-----------------------------------------------------------------------------
	0x0020~0x0024 cdic0 ~ cdic1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dtype                           : 4,	//  0: 3
	cdif_rpage                      : 1,	//     4
	cdif_wpage                      : 1,	//     5
	cdif_ovflow                     : 1,	//     6
	                                : 1,	//     7 reserved
	pd_wait                         : 1,	//     8
	cdif_full                       : 1,	//     9
	cdif_empty                      : 1,	//    10
	                                : 1,	//    11 reserved
	sb_dropped                      : 1,	//    12
	sync_lost                       : 1,	//    13
	no_wdata                        : 1,	//    14
	                                : 1,	//    15 reserved
	av_dec_id                       : 4,	// 16:19
	src                             : 4,	// 20:23
	max_sb_drp                      : 2,	// 24:25
	min_sb_det                      : 2,	// 26:27
	rst                             : 1;	//    28
} CDIC;

/*-----------------------------------------------------------------------------
	0x0028~0x002c cdic_dsc0 ~ cdic_dsc1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cas_type                        : 3,	//  0: 2
	                                : 1,	//     3 reserved
	blk_mode                        : 4,	//  4: 7
	res_mode                        : 4,	//  8:11
	key_size                        : 2,	// 12:13
	                                : 2,	// 14:15 reserved
	even_mode                       : 2,	// 16:17
	                                : 2,	// 18:19 reserved
	odd_mode                        : 2,	// 20:21
	                                : 2,	// 22:23 reserved
	psc_en                          : 1;	//    24
} CDIC_DSC;

/*-----------------------------------------------------------------------------
	0x0030~0x0034 cdoc0 ~ cdoc1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
//	buf_e_lev                       :28,	//  0:27
//	dtype                           : 4,	//  0: 3
	id_value                        : 3,	//  0: 2
	id_msb                          : 1,	//     3
//	q_len                           : 4,	//  4: 7
	id_mask                         : 3,	//  4: 6
	                                : 1,	//     7 reserved
//	gpb_idx                         : 6,	//  8:13
	tso_src                         : 1,	//     8
	                                : 7,	//  9:13 reserved
//	gpb_chan                        : 1,	//    14
//	wptr_auto                       : 1,	//    15
	src                             : 2,	// 16:17
	                                : 10,	// 18:23 reserved
//	wptr_upd                        : 1,	//    24
//	                                : 3;	// 25:27 reserved
//	rst                             : 1,	//    28
	rst                             : 1,	//    28
	                                : 3;	// 29:30 reserved
//	en                              : 1;	//    31
} CDOC;

/* added at L8 B0
 * Start */
typedef struct {
   	UINT32
	VAL_POL        			:  1,
	TPIF_EN          		:  1,
	EN         				:  1,
	SW_RESET                :  1,
	SYNC_DROP         		:  2,
	                		:  2,
	SYNC_FOUND              :  2,
	                		:  2,
	SYNC_TYPE             	:  2,
	                		:  6,
	BUF_IDX                 :  1,
	                		:  3,
	SYNC_STATE             	:  2,
	                		:  2,
	NO_SYNC                 :  1,
	                		:  3;
} CDIP_2ND, CDIP0_2ND, CDIP3_2ND, CDIP4_2ND;


typedef struct {
	UINT32
	dtype        			:  4,
	q_len 	         		:  4,
	gpb_idx         		:  6,
	gpb_chan                :  1,
	wptr_auto         		:  1,
	                		:  8,
	wptr_upd              	:  1,
	                		:  3,
	rst             		:  1,
	                		:  2,
	en                 		:  1;
} BDRC0_3;

typedef struct {
	UINT32
	buf_e_lev        		:  28,
			         		:  4;
} BDRC_LEV0_3;

/* added at L8 B0
 * End */

/*-----------------------------------------------------------------------------
	0x0070 mrq_pri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bdrc0                           : 4,	//  0: 3
	bdrc1                           : 4,	//  4: 7
	bdrc2                           : 4,	//  8:11
	bdrc3                           : 4,	// 12:15
	sdmwc                           : 4;	// 16:19
} MRQ_PRI;

/*-----------------------------------------------------------------------------
	0x0080~0x009c stcc0 ~ stcc7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	latch_en						: 1,	//	   0
	copy_en 						: 1,	//	   1
									: 2,	//	2: 3 reserved
	rate_ctrl						: 1,	//	   4
									: 3,	//	5: 7 reserved
	rd_mode 						: 1,	//	   8
									: 7,	//  9:15 reserved
	pcr_pid                         :13,	// 16:28
	chan                            : 1,	//    29
	rst                             : 1,	//    30
	en                              : 1;	//    31

	UINT32
	stcc_41_10						;		// 31: 0

	UINT32
	pcr_41_10                      ;   	// 31: 0

	UINT32
	pcr_9_0                         :10,	//  0: 9
	                                : 6,	//  9:15 reserved
	stcc_9_0                        :10,	// 16:25
									: 6;	// 26:31 reserved
} STCC;

/*-----------------------------------------------------------------------------
	0x00a0 sub_stcc_rate ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ctrl_step                       :22,	//  0:21
	                                : 2,	// 22:23 reserved
	high                            : 1,	//    24
	mismatch                        : 1,	//    25
	                                : 2,	// 26:27 reserved
	stcc_num                        : 1;	//    28
} SUB_STCC_RATE;

/*-----------------------------------------------------------------------------
	0x00a8~0x00ac stcc_err_ctrl0 ~ stcc_err_ctrl1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	err_max                         :28,	//  0:27
	                                : 3,	// 28:30 reserved
	en                              : 1;	//    31
} STCC_ERR_CTRL;

/*-----------------------------------------------------------------------------
	0x00b0 stcc_asg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	main                            : 1,	//     0
	                                :15,	//  1:15 reserved
	vid0                            : 1,	//    16
	vid1                            : 1,	//    17
	aud0                            : 1,	//    18
	aud1                            : 1;	//    19
} STCC_ASG;

/*-----------------------------------------------------------------------------
	0x00b4~0x00b8 byte_cnt0 ~ byte_cnt1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	byte_cnt                        ;   	// 31: 0
} BYTE_CNT;

/*-----------------------------------------------------------------------------
	0x00c0 stcc_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc_41_10                      ,   	// 31: 0
	rst                             : 1,	//    31
									: 21,	//	30: 10 reserved
	stcc_9_0                        : 10;   // 9: 0
} STCC_G;

/*-----------------------------------------------------------------------------
	0x00c0 gstcc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_unit						:12,	// 0:11
									:4, 	// 12:15
	ext_inc 						:2, 	// 16:17
									:12,	// 18:29
	rst 							:1, 	// 30
	en								:1, 	// 31

	stcc_bs_32_1					,		// 0:31

	stcc_ext_11_0					:12,	// 0:11
	stcc_bs_0						:1, 	// 12
									:19;	// 13:31
} GSTCC;

/*-----------------------------------------------------------------------------
	0x00D0~0x00D4 stcc_g_timer0~1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc_g_timer_44_13				,		// 0:31

	stcc_g_timer_12_0				:13,	// 0:12
									:18,	// 13:30
	en								:1; 	// 31
} STCC_G_TIMER;

/*-----------------------------------------------------------------------------
	0x0100 intr_en ''
	0x0104 intr_stat ''
	0x0108 intr_rstat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pcr                             : 1,	//     0
	tb_dcont                        : 1,	//     1
	                                : 2,	//  2: 3 reserved
	bdrc                            : 4,	//  4: 7
	                                : 4,	//  8:11 reserved
	err_rpt                         : 1,	//    12
	                                : 3,	// 13:15 reserved
	gpb_data                        : 4,	// 16:19
	gpb_full                        : 4,	// 20:23
	tp_info                         : 2,	// 24:25
	sec_err                         : 2;	// 26:27
} INTR_EN;

typedef struct {
	UINT32
	pcr                             : 1,	//     0
	tb_dcont                        : 1,	//     1
	                                : 2,	//  2: 3 reserved
	bdrc                            : 4,	//  4: 7
	                                : 4,	//  8:11 reserved
	err_rpt                         : 1,	//    12
	                                : 3,	// 13:15 reserved
	gpb_data                        : 4,	// 16:19
	gpb_full                        : 4,	// 20:23
	tp_info                         : 2,	// 24:25
	sec_err                         : 2;	// 26:27
} INTR_STAT;

typedef struct {
	UINT32
	pcr                             : 1,	//     0
	tb_dcont                        : 1,	//     1
	                                : 2,	//  2: 3 reserved
	bdrc                            : 4,	//  4: 7
	                                : 4,	//  8:11 reserved
	err_rpt                         : 1,	//    12
	                                : 3,	// 13:15 reserved
	gpb_data                        : 4,	// 16:19
	gpb_full                        : 4,	// 20:23
	tp_info                         : 2,	// 24:25
	sec_err                         : 2;	// 26:27
} INTR_RSTAT;



/*-----------------------------------------------------------------------------
	0x0110 err_intr_en ''
	0x0114 err_intr_stat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	test_dcont                      : 1,	//     0
	                                : 3,	//  1: 3 reserved
	sync_lost                       : 2,	//  4: 5
	sb_dropped                      : 2,	//  6: 7
	cdif_ovflow                     : 2,	//  8: 9
	cdif_wpage                      : 2,	// 10:11
	cdif_rpage                      : 2,	// 12:13
	stcc_dcont                      : 2,	// 14:15
	mpg_pd                          : 2,	// 16:17
	mpg_ts                          : 2,	// 18:19
	mpg_dup                         : 2,	// 20:21
	mpg_cc                          : 2,	// 22:23
	mpg_sd                          : 2;	// 24:25
} ERR_INTR_EN;

typedef struct {
	UINT32
	test_dcont                      : 1,	//     0
	                                : 3,	//  1: 3 reserved
	sync_lost                       : 2,	//  4: 5
	sb_dropped                      : 2,	//  6: 7
	cdif_ovflow                     : 2,	//  8: 9
	cdif_wpage                      : 2,	// 10:11
	cdif_rpage                      : 2,	// 12:13
	stcc_dcont                      : 2,	// 14:15
	mpg_pd                          : 2,	// 16:17
	mpg_ts                          : 2,	// 18:19
	mpg_dup                         : 2,	// 20:21
	mpg_cc                          : 2,	// 22:23
	mpg_sd                          : 2;	// 24:25
} ERR_INTR_STAT;

/*-----------------------------------------------------------------------------
	0x0118 test ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vid0_rdy_en                     : 1,	//     0
	vid1_rdy_en                     : 1,	//     1
	                                : 2,	//  2: 3 reserved
	aud0_rdy_en                     : 1,	//     4
	aud1_rdy_en                     : 1,	//     5
	                                : 2,	//  6: 7 reserved
	test_port                       : 2,	//  8: 9
	                                : 2,	// 10:11 reserved
	auto_incr                       : 1,	//    12
	                                : 3,	// 13:15 reserved
	rst_pd                          : 2,	// 16:17
	rst_dsc                         : 2,	// 18:19
	rst_sys                         : 2,	// 20:21
	                                : 2,	// 22:23 reserved
	last_bval                       : 1;	//    24
} TEST;

/*-----------------------------------------------------------------------------
	0x011c version ''
------------------------------------------------------------------------------*/
/* gaius.lee - VERSION -> VERSION_ collision with ctop_regs.h */
typedef struct {
	UINT32
	version                         ;   	// 31: 0
} VERSION_;

/*-----------------------------------------------------------------------------
	0x0120 gpb_base_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                :28,	//  0:27 reserved
	gpb_base                        : 4;	// 28:31
} GPB_BASE_ADDR;


typedef struct{
	UINT32
	DTYPE				:4,
	CDIF_RPAGE			:1,
	CDIF_WPAGE			:1,
	CDIF_OVFLOW			:1,
						:1,
	PD_WAIT				:1,
	CDIF_FULL			:1,
	CDIF_EMPTY			:1,
						:1,
	SB_DROPPED			:1,
	SYNC_LOST			:1,
	NO_WDATA			:1,
						:1,
	AV_DEC_ID			:4,
	SRC					:4,
	MAX_SB_DRP			:2,
	MIN_SB_DET			:2,
	RST					:1,
						:3;
}CDIC2;

typedef struct{
	UINT32
	PID					:13,
						:3,
	ES_DATA				:8,
						:4,
	ES_VALID			:1,
						:3;
}CDIC2_TS2PES;

/*-----------------------------------------------------------------------------
	0x0158 sysclk_sel ''
------------------------------------------------------------------------------*/
typedef struct{
	UINT32
	tmstamp_src_sel_a	:1,
	tmstamp_src_sel_b	:1,
	tmstamp_src_sel_c	:1,
	tmstamp_src_sel_d	:1,
	gstcc_src_sel		:1,
	gstcc1_src_sel		:1,
	gstcc_mode			:1,
	gstcc1_mode			:1,
						:24;
}SYSCLK_SEL;


/* added at L8 B0
 * End */


/*-----------------------------------------------------------------------------
	0x0000 conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	word_align                      : 1,	//     0
	                                : 3,	//  1: 3 reserved
	save_on_err                     : 1,	//     4
	chksum_type                     : 1,	//     5
	pes_rdy_chk_a                   : 1,	//     6
	pes_rdy_chk_b                   : 1,	//     7
	dbg_cnt                         : 4;	//  8:11
} CONF;

/*-----------------------------------------------------------------------------
	0x0008 splice_cntdn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                :16,	//  0:15 reserved
	splice_cntdn1                   : 8,	// 16:23
	splice_cntdn0                   : 8;	// 24:31
} SPLICE_CNTDN;

/*-----------------------------------------------------------------------------
	0x0010 ext_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpb_f_lev                       :20,	//  0:19
	gpb_ow                          : 1,	//    20
	                                : 3,	// 21:23 reserved
	dpkt_vid                        : 1,	//    24
	dpkt_dcont                      : 1,	//    25
	seci_cce                        : 1,	//    26
	seci_dcont                      : 1;	//    27
} EXT_CONF;

/*-----------------------------------------------------------------------------
	0x0014 all_pass_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dscrm_en                        : 1,	//     0
	null_pkt_pass                   : 1,	//     1
	all_pass_out                    : 1,	//     2
	all_pass_rec                    : 1,	//     3
	rec_irq_cnt                     : 4,	//  4: 7
	                                :23,	//  8:30 reserved
	all_pass_en                     : 1;	//    31
} ALL_PASS_CONF;

/*-----------------------------------------------------------------------------
	0x0018 chan_stat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pkt_cnt                         : 8,	//  0: 7
	sm_info                         : 3,	//  8:10
	                                : 1,	//    11 reserved
	vo0                             : 1,	//    12
	vo1                             : 1,	//    13
	ao0                             : 1,	//    14
	ao1                             : 1,	//    15
	cc_err                          : 1,	//    16
	seci                            : 1,	//    17
	dup_pkt                         : 1,	//    18
	                                : 1,	//    19 reserved
	tpi_q_ovf                       : 1,	//    20
	se_q_ovf                        : 1,	//    21
	mwf_ovf                         : 1,	//    22
	                                : 1,	//    23 reserved
	zlen_pes                        : 1,	//    24
	rf_acc                          : 1,	//    25
	                                : 2,	// 26:27 reserved
	pes_rdy                         : 1,	//    28
	                                : 2,	// 29:30 reserved
	pload_pattern                   : 1;	//    31
} CHAN_STAT;

/*-----------------------------------------------------------------------------
	0x0020 cc_chk_en_l ''
	0x0024 h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cc_chk_en                       ;   	// 31: 0
} CC_CHK_EN;

/*-----------------------------------------------------------------------------
	0x0028 sec_crc_en_l ''
	0x002c h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	crc_en                          ;   	// 31: 0
} SEC_CRC_EN;

/*-----------------------------------------------------------------------------
	0x0030 sec_chksum_en_l ''
	0x0034 h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	chksum_en                       ;   	// 31: 0
} SEC_CHKSUM_EN;

/*-----------------------------------------------------------------------------
	0x0038 pes_crc_en_l ''
	0x003c h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	crc16_en                        ;   	// 31: 0
} PES_CRC_EN;

/*-----------------------------------------------------------------------------
	0x0040 tpi_iconf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	afef                            : 1,	//     0
	tpdf                            : 1,	//     1
	spf                             : 1,	//     2
	espi                            : 1,	//     3
	rai                             : 1,	//     4
	di                              : 1,	//     5
	tsc                             : 2,	//  6: 7
	tpri                            : 1,	//     8
	pusi                            : 1,	//     9
	                                : 1,	//    10 reserved
	tei                             : 1,	//    11
	                                : 4,	// 12:15 reserved
	not_tsc                         : 2,	// 16:17
	auto_sc_chk                     : 1;	//    18
} TPI_ICONF;

/*-----------------------------------------------------------------------------
	0x0044 tpi_istat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	afef                            : 1,	//     0
	tpdf                            : 1,	//     1
	spf                             : 1,	//     2
	espi                            : 1,	//     3
	rai                             : 1,	//     4
	di                              : 1,	//     5
	tsc                             : 2,	//  6: 7
	tpri                            : 1,	//     8
	pusi                            : 1,	//     9
	tei                             : 1,	//    10
	                                : 1,	//    11 reserved
	tsc_chg                         : 1,	//    12
	auto_sc_chk                     : 1,	//    13
	                                : 2,	// 14:15 reserved
	pidf_idx                        : 6;	// 16:21
} TPI_ISTAT;

/*-----------------------------------------------------------------------------
	0x004c se_istat ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filter_idx                      : 6,	//  0: 5
	err_type                        : 1,	//     6
	valid                           : 1;	//     7
} SE_ISTAT;

/*-----------------------------------------------------------------------------
	0x0050 gpb_f_iconf_l ''
	0x0054 h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpb_f_iconf                     ;   	// 31: 0
} GPB_F_ICONF;

/*-----------------------------------------------------------------------------
	0x0058 gpb_f_istat_l ''
	0x005c h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpb_f_istat                     ;   	// 31: 0
} GPB_F_ISTAT;

/*-----------------------------------------------------------------------------
	0x0060 gpb_d_istat_l ''
	0x0064 h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpb_d_istat                     ;   	// 31: 0
} GPB_D_ISTAT;

/*-----------------------------------------------------------------------------
	0x0070 tpdb_en_l ''
	0x0074 h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpdb_en                         ;   	// 31: 0
} TPDB_EN;

/*-----------------------------------------------------------------------------
	0x0078 tpdb_id ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpb_id                          : 7;	//  0: 6
} TPDB_ID;

/*-----------------------------------------------------------------------------
	0x007c v_seq_err_code ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_seq_err_code                  ;   	// 31: 0
} V_SEQ_ERR_CODE;

/*-----------------------------------------------------------------------------
	0x0080 afedb_en_l ''
	0x0084 h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	afedb_en                        ;   	// 31: 0
} AFEDB_EN;

/*-----------------------------------------------------------------------------
	0x0088 afedb_id ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpb_id                          : 7;	//  0: 6
} AFEDB_ID;

/*-----------------------------------------------------------------------------
	0x008c pidf_map ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pidf_u_bnd                      : 6,	//  0: 5
	                                :10,	//  6:15 reserved
	pidf_l_bnd                      : 6,	// 16:21
	                                : 9,	// 22:30 reserved
	map_en                          : 1;	//    31
} PIDF_MAP;

/*-----------------------------------------------------------------------------
	0x0090 pidf_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pidf_idx                        : 6;	//  0: 5
} PIDF_ADDR;

/*-----------------------------------------------------------------------------
	0x0094 pidf_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pidf_data                     ;   	// 31: 0
} PIDF_DATA;

/*-----------------------------------------------------------------------------
	0x0098 kmem_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 2,	//  0: 1 reserved
	word_idx                        : 3,	//  2: 4
	odd_key                         : 1,	//     5
	pid_idx                         : 6,	//  6:11
	key_type                        : 2;	// 12:13
} KMEM_ADDR;

/*-----------------------------------------------------------------------------
	0x009c kmem_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	kmem_data                       ;   	// 31: 0
} KMEM_DATA;

/*-----------------------------------------------------------------------------
	0x00a0 secf_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	word_idx                        : 4,	//  0: 3
	secf_idx                        : 6;	//  4: 9
} SECF_ADDR;

/*-----------------------------------------------------------------------------
	0x00a4 secf_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	secf_data                       ;   	// 31: 0
} SECF_DATA;

/*-----------------------------------------------------------------------------
	0x00b0 secf_en_l ''
	0x00b4 h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	secf_en                         ;   	// 31: 0
} SECF_EN;

/*-----------------------------------------------------------------------------
	0x00b8 secf_mtype_l ''
	0x00bc h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	secf_mtype                      ;   	// 31: 0
} SECF_MTYPE;

/*-----------------------------------------------------------------------------
	0x00c0 secfb_valid_l ''
	0x00c4 h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	secfb_valid                     ;   	// 31: 0
} SECFB_VALID;

/*-----------------------------------------------------------------------------
	0x0100~0x01fc gpb_bnd0 ~ gpb_bnd63 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	u_bnd                           :16,	//  0:15
	l_bnd                           :16;	// 16:31
} GPB_BND;

/*-----------------------------------------------------------------------------
	0x0200~0x02fc gpb_w_ptr0 ~ gpb_w_ptr63 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpb_w_ptr                       :28;	//  0:27
} GPB_W_PTR;

/*-----------------------------------------------------------------------------
	0x0300~0x03fc gpb_r_ptr0 ~ gpb_r_ptr63 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpb_r_ptr                       :28;	//  0:27
} GPB_R_PTR;

/*-----------------------------------------------------------------------------
	0x0400~0x05fc secf_map0 ~ secf_map127 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	secf_map                        ;   	// 31: 0
} SECF_MAP;



/*----------------------------------------------------------------------------*/


typedef struct {
	VID_OUT_SEL                     	vid_out_sel                     ;	// 0x0000
	DL_SEL                          	dl_sel                          ;	// 0x0004
	AUD_OUT_SEL							aud_out_sel						;	// 0x0008
	UP_SEL                          	up_sel                          ;	// 0x000c
	STPO_SEL							stpo_sel						;	// 0x0010
	UINT32	                         	                 __rsvd_01[   2];	// 0x0014 ~ 0x0018
	AXI_FLUSH_CONF                     	axi_flush_conf                  ;	// 0x001c
	AXI_USER_CONF                      	axi_user_conf                   ;	// 0x0020
	UINT32											     __rsvd_02[	  3];	// 0x0024 ~ 0x002c
	UINT32                              te_version                      ;	// 0x0030
	UINT32											     __rsvd_03[	 19];	// 0x0034 ~ 0x007c
	TS_SRC_SEL							ts_src_sel[ 8]					;	// 0x0080 ~ 0x009c
	STCC0_REF1							stcc0_ref1						;	// 0x00A0
	STCC0_REF32							stcc0_ref32						;	// 0x00A4
	STCC0_REAL1							stcc0_real1						;	// 0x00A8
	STCC0_REAL32						stcc0_real32					;	// 0x00AC
	UINT32											     __rsvd_04[	  4];	// 0x00B0 ~ 0x00BC
	DCO_FCW_CTRL						dco_fcw_ctrl					;	// 0x00C0
} SDTOP_REG_T;



typedef struct {
	CDIP                          		cdip[ 4]                        ;	// 0x0000
	                                	                                 	// 0x0004
	                                	                                 	// 0x0008
	                                	                                 	// 0x000c
	CDIOP                           	cdiop[ 2]                       ;	// 0x0010
	                                	                                 	// 0x0014
	CDIC								cdic3							;	// 0x0018
	CDIC3_DL_CONF						cdic3_dl_conf					;	// 0x001c
	CDIC                            	cdic[ 2]                        ;	// 0x0020
	                                	                                 	// 0x0024
	CDIC_DSC                        	cdic_dsc[ 2]                    ;	// 0x0028
	                                	                                 	// 0x002c
	CDOC                            	cdoc[ 2]                        ;	// 0x0030
	                                	                                 	// 0x0034
    CDIP3_2ND							cdip3_2nd						;   // 0x0038
    CDIP4_2ND							cdip4_2nd						;	// 0x003C
    BDRC0_3								bdrc0							;	// 0x0040
    BDRC_LEV0_3							bdrc_lev0						;	// 0x0044
    BDRC0_3								bdrc1							;	// 0x0048
    BDRC_LEV0_3							bdrc_lev1						;	// 0x004C
    BDRC0_3								bdrc2							;	// 0x0050
    BDRC_LEV0_3							bdrc_lev2						;	// 0x0054
    BDRC0_3								bdrc3							;	// 0x0058
	BDRC_LEV0_3							bdrc_lev3						;	// 0x005C
	UINT32								sdmwc_sw_reset					;	// 0x0060 TBD CHECK NEEDED!
	UINT32								sdmwc_stat						;	// 0x0064 TBD CHECK NEEDED!
	UINT32                          	                 __rsvd_03[   2];	// 0x0068
																			// 0x006c
	MRQ_PRI                         	mrq_pri                         ;	// 0x0070
	UINT32                          	                 __rsvd_04[   3];	// 0x0074
																			// 0x0078
																			// 0x007c
	UINT32                            	stcc[ 8]                        ;	// 0x0080
	                                	                                 	// 0x0084
	                                	                                 	// 0x0088
	                                	                                 	// 0x008c
	                                	                                 	// 0x0090
	                                	                                 	// 0x0094
	                                	                                 	// 0x0098
	                                	                                 	// 0x009c
	SUB_STCC_RATE                   	sub_stcc_rate                   ;	// 0x00a0
	UINT32                          	                 __rsvd_05[   1];	// 0x00a4
	STCC_ERR_CTRL                   	stcc_err_ctrl[ 2]               ;	// 0x00a8
	                                	                                 	// 0x00ac
	STCC_ASG                        	stcc_asg                        ;	// 0x00b0
	BYTE_CNT                        	byte_cnt[ 2]                    ;	// 0x00b4
	                                	                                 	// 0x00b8
	UINT32                          	                 __rsvd_06[   1];	// 0x00bc
	UINT32                         		gstc0[ 3]                       ;	// 0x00c0
																			// 0x00c4
																			// 0x00c8
	UINT32                          	                 __rsvd_07[   1];	// 0x00cc
	STCC_G_TIMER						stcc_g_timer[2]                 ;	// 0x00d0
																			// 0x00d4
																			// 0x00d8
																			// 0x00dc
	UINT32                         		gstc1[ 3]                       ;	// 0x00e0
																			// 0x00e4
																			// 0x00e8
	UINT32                          	                 __rsvd_08[   5];	// 0x00ec
																			// 0x00f0
																			// 0x00f4
																			// 0x00f8
																			// 0x00fc
	INTR_EN                         	intr_en                         ;	// 0x0100
	UINT32                       		intr_stat                       ;	// 0x0104
	INTR_RSTAT                      	intr_rstat                      ;	// 0x0108
	UINT32                          	                 __rsvd_09[   1];	// 0x010c
	ERR_INTR_EN                     	err_intr_en                     ;	// 0x0110
	ERR_INTR_STAT                   	err_intr_stat                   ;	// 0x0114
	TEST                            	test                            ;	// 0x0118
	VERSION_                         	version                         ;	// 0x011c
	GPB_BASE_ADDR                   	gpb_base_addr                   ;	// 0x0120
	CDIP0_2ND							cdip0_2nd;						;	// 0x0124
   	CDIC								cdic2;							;	// 0x0128
   	CDIC2_TS2PES						cdic2_ts2pes;					;	// 0x012c
	CDIP								cdipa[3]						;	// 0x0130
																			// 0x0134
																			// 0x0138
	CDIP0_2ND							cdipa_2nd;						;	// 0x013c
	UINT32												 __rsvd_17[   6];	// 0x0140
																			// 0x0144
																			// 0x0148
																			// 0x014C
																			// 0x0150
																			// 0x0154
	SYSCLK_SEL							sysclk_sel						;	// 0x158

} SDIO_REG_T;

typedef struct {
	CONF                            	conf                            ;	// 0x0000
	UINT32                          	                 __rsvd_10[   1];	// 0x0004
	SPLICE_CNTDN                    	splice_cntdn                    ;	// 0x0008
	UINT32                          	                 __rsvd_11[   1];	// 0x000c
	EXT_CONF                        	ext_conf                        ;	// 0x0010
	ALL_PASS_CONF                   	all_pass_conf                   ;	// 0x0014
	CHAN_STAT                       	chan_stat                       ;	// 0x0018
	UINT32                          	                 __rsvd_12[   1];	// 0x001c
	CC_CHK_EN                     		cc_chk_en[2]                   	;	// 0x0020
																			// 0x0024
	SEC_CRC_EN                    		sec_crc_en[2]                  	;	// 0x0028
																			// 0x002c
	SEC_CHKSUM_EN                 		sec_chksum_en[2]                ;	// 0x0030
																			// 0x0034
	PES_CRC_EN                    		pes_crc_en[2]                   ;	// 0x0038
																			// 0x003c
	TPI_ICONF                       	tpi_iconf                       ;	// 0x0040
	TPI_ISTAT                       	tpi_istat                       ;	// 0x0044
	UINT32                          	                 __rsvd_13[   1];	// 0x0048
	SE_ISTAT                        	se_istat                        ;	// 0x004c
	GPB_F_ICONF                   		gpb_f_iconf[2]                  ;	// 0x0050
																			// 0x0054
	GPB_F_ISTAT                   		gpb_f_istat[2]                  ;	// 0x0058
																			// 0x005c
	GPB_D_ISTAT                   		gpb_d_istat[2]                  ;	// 0x0060
																			// 0x0064
	UINT32                          	                 __rsvd_14[   2];	// 0x0068
																			// 0x006c
	TPDB_EN                       		tpdb_en[2]                      ;	// 0x0070
																			// 0x0074
	TPDB_ID                         	tpdb_id                         ;	// 0x0078
	V_SEQ_ERR_CODE                  	v_seq_err_code                  ;	// 0x007c
	AFEDB_EN                      		afedb_en[2]                     ;	// 0x0080
																			// 0x0084
	AFEDB_ID                        	afedb_id                        ;	// 0x0088
	PIDF_MAP                        	pidf_map                        ;	// 0x008c
	PIDF_ADDR                       	pidf_addr                       ;	// 0x0090
	PIDF_DATA                       	pidf_data                       ;	// 0x0094
	KMEM_ADDR                       	kmem_addr                       ;	// 0x0098
	KMEM_DATA                       	kmem_data                       ;	// 0x009c
	SECF_ADDR                       	secf_addr                       ;	// 0x00a0
	SECF_DATA                       	secf_data                       ;	// 0x00a4
	UINT32                          	                 __rsvd_15[   2];	// 0x00a8
																			// 0x00ac
	SECF_EN                       		secf_en[2]                      ;	// 0x00b0
																			// 0x00b4
	SECF_MTYPE                    		secf_mtype[2]                   ;	// 0x00b8
																			// 0x00bc
	SECFB_VALID                   		secfb_valid[2]                  ;	// 0x00c0
																			// 0x00c4
	UINT32                          	                 __rsvd_16[  14];	// 0x00c8
																			// 0x00cc
																			// 0x00d0
																			// 0x00d4
																			// 0x00d8
																			// 0x00dc
																			// 0x00e0
																			// 0x00e4
																			// 0x00e8
																			// 0x00ec
																			// 0x00f0
																			// 0x00f4
																			// 0x00f8
																			// 0x00fc
	GPB_BND                         	gpb_bnd[64]                     ;	// 0x0100
	                                	                                 	// ~
	                                	                                 	// 0x01fc
	GPB_W_PTR                       	gpb_w_ptr[64]                   ;	// 0x0200
	                                	                                 	// ~
	                                	                                 	// 0x02fc
	GPB_R_PTR                       	gpb_r_ptr[64]                   ;	// 0x0300
	                                	                                 	// ~
	                                	                                 	// 0x03fc
	SECF_MAP                        	secf_map[128]                   ;	// 0x0400
	                                	                                 	// ~
	                                	                                 	// 0x05fc
} MPG_REG_T;


#ifdef __cplusplus
}
#endif

#endif

/* from 'LG1150-TE-MAN-01 v1.2 (SDEC register description-20100303).csv' 20100311 00:54:20   대한민국 표준시 by getregs v2.3 */
