/*
 * SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 * Copyright(c) 2013 by LG Electronics Inc.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 */

/** @file
 *
 *  sdec driver
 *
 *  @author	Jihoon Lee ( gaius.lee@lge.com)
 *  @author	Jinhwan Bae ( jinhwan.bae@lge.com) - modifier
 *  @version	1.0
 *  @date		2010-03-30
 *  @note		Additional information.
 */


/*----------------------------------------------------------------------------------------
 *   Control Constants
 *---------------------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------------------
 *   File Inclusions
 *---------------------------------------------------------------------------------------*/
#include "sdec_impl.h"
#include "sdec_drv.h"
#include "sdec_io.h"
#include "sdec_hal.h"

#include "sys_regs.h"
#include "sdec_reg_ctrl.h"

#include "sdec_pcr.h"

/*----------------------------------------------------------------------------------------
 *   Constant Definitions

		// en | chan | pcr_pid | copy_en | latch_en
		SDEC_HAL_STCCSetReg(core, ui8Ch, 0x80000000 | (ui8Ch << 29) );
		SDEC_HAL_STCCSetSTC(core, ui8Ch, 0);
		SDEC_HAL_STCCSetReg(core, ui8Ch, 0x80000003 | (ui8Ch << 29) | (ui32PidValue << 16));
	}

	/* if current channel is main channel, set main
	 * warning *
	 * viewing channel is not main channel, main channel is pcr recovery channel */
	if(bMain)
	{
		SDEC_HAL_STCCSetMain(core, ui8Ch);
		pwm_context_reset(stpSdecParam, ui8Ch);	// added by jinhwan.bae for support pip operation
	}

	SDEC_PRINT_TRACE( "-->SDEC_IO_SetPCRPID");

	eRet = RET_OK;

exit:

	OS_UnlockMutex(&stpSdecParam->stSdecMutex);
	return (eRet);

}


/**
********************************************************************************
* @brief
*   set pcr recovery.
* @remarks
*  DETAIL INFORMATION
* @par requirements:
*
* @param
*   stpSdecParam :SDEC parameter
*   stpLXSdecSetPCRRecovery : ioctrl arguments from userspace
* @return
*  int
********************************************************************************
*/
int SDEC_IO_SetPcrRecovery
	(S_SDEC_PARAM_T *stpSdecParam,
	LX_SDEC_SET_PCR_RECOVERY_T *stpLXSdecSetPCRRecovery)
{
	int eRet = RET_ERROR;
	UINT8 ui8Ch = 0x0;
	UINT8 ui8PcrCmd = 0x0;
	UINT8 core = 0, org_ch = 0;

	LX_SDEC_CHECK_CODE( stpSdecParam == NULL, return RET_INVALID_PARAMS, "Invalid parameters" );
	LX_SDEC_CHECK_CODE( stpLXSdecSetPCRRecovery == NULL, return RET_INVALID_PARAMS, "Invalid argument" );

	OS_LockMutex(&stpSdecParam->stSdecMutex);

	SDEC_PRINT_TRACE( "<--SDEC_IO_SetPcrRecovery");

	ui8Ch = stpLXSdecSetPCRRecovery->eCh;
	ui8PcrCmd = stpLXSdecSetPCRRecovery->eCmd;

	org_ch = ui8Ch;
	SDEC_CONVERT_CORE_CH(core, ui8Ch);
	LX_SDEC_CHECK_CODE( ui8Ch > 2, goto exit, "channel is invalid org_ch[%d]ui8Ch[%d]", org_ch, ui8Ch );

	switch (ui8PcrCmd)
	{
		case LX_SDEC_PCR_CMD_DISABLE:
			stpSdecParam->bPcrRecoveryFlag[org_ch] = FALSE;
//			SDEC_HAL_STCCReset(core, ui8Ch);
			break;
		case LX_SDEC_PCR_CMD_ENABLE:
			stpSdecParam->bPcrRecoveryFlag[org_ch] = TRUE;
#if 0	/* M14_TBD jinhwan.bae to add for stc counter reset to 0 , which is A/V decoder STC counter value reset , pause -> play sequence */
			SDEC_HAL_AVSTCReset(core, ui8Ch);
			usleep(50);	/* actually 12us needed to send the reset value to A/V Decoder */
#endif
			SDEC_HAL_STCCReset(core, ui8Ch);

#ifdef __NEW_PWM_RESET_COND__
			pcr_error_for_reset = 0;
#endif
			break;
		case LX_SDEC_PCR_CMD_RESET:
			SDEC_HAL_STCCReset(core, ui8Ch);
			SDEC_HAL_STCCEnableCopy(core, ui8Ch, SDEC_HAL_ENABLE);
		break;
		default:
			SDEC_PRINT_ERROR("Invalid PCR cmd:[%d]", ui8PcrCmd);
			goto exit;
		break;
	}

	SDEC_PRINT_TRACE( "-->SDEC_IO_SetPcrRecovery");

	eRet = RET_OK;

exit:
	OS_UnlockMutex(&stpSdecParam->stSdecMutex);
	return (eRet);
}




/**
 * Below code is from LG D2A STB
 *
 * Modified and adjusted by Jihoon Lee ( gaius.lee@lge.com )
 *
 * 2010.06.14 @ DTV Lab.
 */


/**
 *
 * Filter context - initialised by calling pwm_init
 * @ingroup sdec_struct_type
 */
typedef struct
{
  unsigned long service				: 1, 	///< 0x00(bit 1) : pcr service doing
                recovery_Enable     : 1, 	///< 0x00(bit 1) : enable pcr recovery
                first_pcr_arrived	: 1,	///< 0x00(bit 1) : first_pcr_arrived
                reserved 			: 29;	///< 0x00(bit 28): reserved
  unsigned long fcw_base;					///< 0x04        : fcw base for selected Memory Clock
  signed   long fcw_offset;					///< 0x08        : fcw offset for first reset after each ch. change.
  unsigned long fcw_value;					///< 0x0c        : temperary fcw value
  unsigned long lastUpdateTime;				///< 0x10        : last updated Time Tick
  unsigned long new_reset_discard;			///< 0x14        : after reset recovery discarding count
  unsigned long new_adjust_skip;			///< 0x18        : skip adjusting right after adjust
  unsigned long skip_chk_overshoot;		 	///< 0x1c        : check divergence
  unsigned long fcw_trickSpeed;				///< 0x20        : multiply value for trick mode
  unsigned int	max_ignore_count;			///			 : max ignore count for protecting first jitter
  unsigned int  stable_overshoot;
} pwm_context_t;

static UINT32	max_fcw_value;
static UINT32	min_fcw_value;

static UINT32	pwm_fcw_default		= 0;
static UINT32	pwm_fcw_threshold		= 0;
static UINT32	pwm_fcw_threshold_with_max_ignore = 0;
static UINT32	pwm_fcw_window_sz		= 0;
static SINT32	pwm_fcw_sz_step		= 0;


/*---------------------------------------------------------
 * Constant definition
---------------------------------------------------------*/
#define DCO_INPUT_CLOCK 	198
#define DCO_COEF			8388608		/* 2^23 */

#define FCW_DEFAULT_VALUE_27025 0x0011789A	/* 27 Mhz */
#define FCW_DEFAULT_VALUE 		0x0011745D	/* 27 Mhz */
//#define FCW_DEFAULT_VALUE (UINT32)(KHZ_TO_FCW(24000))
#define FCW_PREFIX			0

#define FREQ_THRESHOLD_KHZ 						100
#define FREQ_THRESHOLD_KHZ_WITH_MAX_IGNORE	    5

