/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

#ifndef _REG_DPPB_H13A0_h
#define _REG_DPPB_H13A0_h



/*
	DPPB TOP
*/

/*-----------------------------------------------------------------------------
	0x0000 top_runstall ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	runstall                        : 1;	//     0
} H13A0_DPPB_RUNSTALL;

/*-----------------------------------------------------------------------------
	0x0004 top_stat_vector_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stat_vector_sel                 : 1;	//     0
} H13A0_DPPB_STAT_VECTOR_SEL;

/*-----------------------------------------------------------------------------
	0x0008 top_pdebugenable ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pdebug_enable                   : 1;	//     0
} H13A0_DPPB_PDEBUGENABLE;

/*-----------------------------------------------------------------------------
	0x000c top_pdebugdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pdebug_data                     ;   	// 31: 0
} H13A0_DPPB_PDEBUGDATA;

/*-----------------------------------------------------------------------------
	0x0010 top_pdebugpc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pdebug_pc                       ;   	// 31: 0
} H13A0_DPPB_PDEBUGPC;

/*-----------------------------------------------------------------------------
	0x0014 top_pdebugstatus ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pdebug_status                   : 8;	//  0: 7
} H13A0_DPPB_PDEBUGSTATUS;

/*-----------------------------------------------------------------------------
	0x0018 top_tr_addr_offset_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tr_addr_offset_0                ;   	// 31: 0
} H13A0_DPPB_TR_ADDR_OFFSET_0;

/*-----------------------------------------------------------------------------
	0x001c top_tr_addr_offset_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tr_addr_offset_1                ;   	// 31: 0
} H13A0_DPPB_TR_ADDR_OFFSET_1;

/*-----------------------------------------------------------------------------
	0x0020 top_tr_addr_offset_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tr_addr_offset_2                ;   	// 31: 0
} H13A0_DPPB_TR_ADDR_OFFSET_2;

/*-----------------------------------------------------------------------------
	0x0024 top_tr_addr_offset_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tr_addr_offset_3                ;   	// 31: 0
} H13A0_DPPB_TR_ADDR_OFFSET_3;

/*-----------------------------------------------------------------------------
	0x0028 top_arm_intr_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	arm_wdg_int_en                      :  1,   ///     0
	arm_dma_int_en                      :  1,   ///     1
	arm_led_int_en                      :  1,   ///     2 
	arm_dppa_int_en                     :  1,   ///     3
	arm_sre_int_en                      :  1,   ///     4 
	arm_lrx_int_en                      :  1,   ///     5
	arm_dvo_int_en                      :  1,   ///     6
	arm_dvi_int_en                      :  1,   ///     7
	arm_h3d0_int_en                     :  1,   ///     8
	arm_h3d1_int_en                     :  1,   ///     9
	reserved                            :  5,   /// 10:14
	arm_swi_int_en                      : 17;   /// 15:31
} H13A0_DPPB_ARM_INTR_EN;

/*-----------------------------------------------------------------------------
	0x002c top_arm_intr_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	arm_wdg_int_status                  :  1,   ///     0
	arm_dma_int_status                  :  1,   ///     1
	arm_led_int_status                  :  1,   ///     2 
	arm_dppa_int_status                 :  1,   ///     3
	arm_sre_int_status                  :  1,   ///     4 
	arm_lrx_int_status                  :  1,   ///     5
	arm_dvo_int_status                  :  1,   ///     6
	arm_dvi_int_status                  :  1,   ///     7
	arm_h3d0_int_status                 :  1,   ///     8
	arm_h3d1_int_status                 :  1,   ///     9
	reserved                            :  5,   /// 10:14
	arm_swi_int_status                  : 17;   /// 15:31
} H13A0_DPPB_ARM_INTR_STATUS;

/*-----------------------------------------------------------------------------
	0x0030 top_arm_intr_raw_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	arm_wdg_int_rawstat                  :  1,   ///     0
	arm_dma_int_rawstat                  :  1,   ///     1
	arm_led_int_rawstat                  :  1,   ///     2 
	arm_dppa_int_rawstat                 :  1,   ///     3
	arm_sre_int_rawstat                  :  1,   ///     4 
	arm_lrx_int_rawstat                  :  1,   ///     5
	arm_dvo_int_rawstat                  :  1,   ///     6
	arm_dvi_int_rawstat                  :  1,   ///     7
	arm_h3d0_int_rawstat                 :  1,   ///     8
	arm_h3d1_int_rawstat                 :  1,   ///     9
	reserved                            :  5,   /// 10:14
	arm_swi_int_rawstat                 : 17;   /// 15:31
} H13A0_DPPB_ARM_INTR_RAW_STATUS;

/*-----------------------------------------------------------------------------
	0x0034 top_arm_intr_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	arm_wdg_int_clear                  :  1,   ///     0
	arm_dma_int_clear                  :  1,   ///     1
	arm_led_int_clear                  :  1,   ///     2 
	arm_dppa_int_clear                 :  1,   ///     3
	arm_sre_int_clear                  :  1,   ///     4 
	arm_lrx_int_clear                  :  1,   ///     5
	arm_dvo_int_clear                  :  1,   ///     6
	arm_dvi_int_clear                  :  1,   ///     7
	arm_h3d0_int_clear                 :  1,   ///     8
	arm_h3d1_int_clear                 :  1,   ///     9
	reserved                           :  5,   /// 10:14
	arm_swi_int_clear                  : 17;   /// 15:31
} H13A0_DPPB_ARM_INTR_CLR;

/*-----------------------------------------------------------------------------
	0x0038 top_de_intr_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_wdg_int_en                      :  1,   ///     0
	de_dma_int_en                      :  1,   ///     1
	de_led_int_en                      :  1,   ///     2 
	de_dppa_int_en                     :  1,   ///     3
	de_sre_int_en                      :  1,   ///     4 
	de_lrx_int_en                      :  1,   ///     5
	de_dvo_int_en                      :  1,   ///     6
	de_dvi_int_en                      :  1,   ///     7
	de_h3d0_int_en                     :  1,   ///     8
	de_h3d1_int_en                     :  1,   ///     9
	de_swi_int_en                      : 21;   /// 10:31
} H13A0_DPPB_DE_INTR_EN;

/*-----------------------------------------------------------------------------
	0x003c top_de_intr_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_wdg_int_status                  :  1,   ///     0
	de_dma_int_status                  :  1,   ///     1
	de_led_int_status                  :  1,   ///     2 
	de_dppa_int_status                 :  1,   ///     3
	de_sre_int_status                  :  1,   ///     4 
	de_lrx_int_status                  :  1,   ///     5
	de_dvo_int_status                  :  1,   ///     6
	de_dvi_int_status                  :  1,   ///     7
	de_h3d0_int_status                 :  1,   ///     8
	de_h3d1_int_status                 :  1,   ///     9
	de_swi_int_status                  : 21;   /// 10:31
} H13A0_DPPB_DE_INTR_STATUS;

/*-----------------------------------------------------------------------------
	0x0040 top_de_intr_raw_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_wdg_int_rawstat                  :  1,   ///     0
	de_dma_int_rawstat                  :  1,   ///     1
	de_led_int_rawstat                  :  1,   ///     2 
	de_dppa_int_rawstat                 :  1,   ///     3
	de_sre_int_rawstat                  :  1,   ///     4 
	de_lrx_int_rawstat                  :  1,   ///     5
	de_dvo_int_rawstat                  :  1,   ///     6
	de_dvi_int_rawstat                  :  1,   ///     7
	de_h3d0_int_rawstat                 :  1,   ///     8
	de_h3d1_int_rawstat                 :  1,   ///     9
	de_swi_int_rawstat                  : 21;   /// 10:31
} H13A0_DPPB_DE_INTR_RAW_STATUS;

/*-----------------------------------------------------------------------------
	0x0044 top_de_intr_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_wdg_int_clear                  :  1,   ///     0
	de_dma_int_clear                  :  1,   ///     1
	de_led_int_clear                  :  1,   ///     2 
	de_dppa_int_clear                 :  1,   ///     3
	de_sre_int_clear                  :  1,   ///     4 
	de_lrx_int_clear                  :  1,   ///     5
	de_dvo_int_clear                  :  1,   ///     6
	de_dvi_int_clear                  :  1,   ///     7
	de_h3d0_int_clear                 :  1,   ///     8
	de_h3d1_int_clear                 :  1,   ///     9
	de_swi_int_clear                  : 21;   /// 10:31
} H13A0_DPPB_DE_INTR_CLR;

/*-----------------------------------------------------------------------------
	0x0048 top_rc_intr_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rc_wdg_int_en                      :  1,   ///     0
	rc_gpio_int_en                     :  1,   ///     1
	rc_dmadone_int_en                  :  1,   ///     2 
	rc_swi_int_en                      : 29;   ///  3:31 
} H13A0_DPPB_RC_INTR_EN;

/*-----------------------------------------------------------------------------
	0x004c top_rc_intr_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rc_wdg_int_status                      :  1,   ///     0
	rc_gpio_int_status                     :  1,   ///     1
	rc_dmadone_int_status                  :  1,   ///     2 
	rc_swi_int_status                      : 29;   ///  3:31 
} H13A0_DPPB_RC_INTR_STATUS;

/*-----------------------------------------------------------------------------
	0x0050 top_rc_intr_raw_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rc_wdg_int_rawstat                      :  1,   ///     0
	rc_gpio_int_rawstat                     :  1,   ///     1
	rc_dmadone_int_rawstat                  :  1,   ///     2 
	rc_swi_int_rawstat                      : 29;   ///  3:31 
} H13A0_DPPB_RC_INTR_RAW_STATUS;

/*-----------------------------------------------------------------------------
	0x0054 top_rc_intr_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rc_wdg_int_clear                      :  1,   ///     0
	rc_gpio_int_clear                     :  1,   ///     1
	rc_dmadone_int_clear                  :  1,   ///     2 
	rc_swi_int_clear                      : 29;   ///  3:31 
} H13A0_DPPB_RC_INTR_CLR;

/*-----------------------------------------------------------------------------
	0x0058 top_dma_crc_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dma_crc_clear                   : 1;	//     0
} H13A0_DPPB_DMA_CRC_CLR;

/*-----------------------------------------------------------------------------
	0x005c top_dma_crc_hec ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dma_crc_hec                     : 8;	//  0: 7
} H13A0_DPPB_DMA_CRC_HEC;

/*-----------------------------------------------------------------------------
	0x0060 top_dma_crc_aal5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dma_crc_aal5                    ;   	// 31: 0
} H13A0_DPPB_DMA_CRC_AAL5;

/*-----------------------------------------------------------------------------
	0x0064 top_ipc0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0068 top_ipc1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x006c top_ipc2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0070 top_ipc3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0074 top_ipc4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0078 top_ipc5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x007c top_ipc6 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0080 top_ipc7 ''
------------------------------------------------------------------------------*/
/*	no field */

typedef struct {
	H13A0_DPPB_RUNSTALL                     	top_runstall                     ;	// 0x0000 : ''
	H13A0_DPPB_STAT_VECTOR_SEL              	top_stat_vector_sel              ;	// 0x0004 : ''
	H13A0_DPPB_PDEBUGENABLE                 	top_pdebugenable                 ;	// 0x0008 : ''
	H13A0_DPPB_PDEBUGDATA                   	top_pdebugdata                   ;	// 0x000c : ''
	H13A0_DPPB_PDEBUGPC                     	top_pdebugpc                     ;	// 0x0010 : ''
	H13A0_DPPB_PDEBUGSTATUS                 	top_pdebugstatus                 ;	// 0x0014 : ''
	H13A0_DPPB_TR_ADDR_OFFSET_0             	top_tr_addr_offset_0             ;	// 0x0018 : ''
	H13A0_DPPB_TR_ADDR_OFFSET_1             	top_tr_addr_offset_1             ;	// 0x001c : ''
	H13A0_DPPB_TR_ADDR_OFFSET_2             	top_tr_addr_offset_2             ;	// 0x0020 : ''
	H13A0_DPPB_TR_ADDR_OFFSET_3             	top_tr_addr_offset_3             ;	// 0x0024 : ''
	H13A0_DPPB_ARM_INTR_EN                  	top_arm_intr_en                  ;	// 0x0028 : ''
	H13A0_DPPB_ARM_INTR_STATUS              	top_arm_intr_status              ;	// 0x002c : ''
	H13A0_DPPB_ARM_INTR_RAW_STATUS          	top_arm_intr_raw_status          ;	// 0x0030 : ''
	H13A0_DPPB_ARM_INTR_CLR                 	top_arm_intr_clr                 ;	// 0x0034 : ''
	H13A0_DPPB_DE_INTR_EN                   	top_de_intr_en                   ;	// 0x0038 : ''
	H13A0_DPPB_DE_INTR_STATUS               	top_de_intr_status               ;	// 0x003c : ''
	H13A0_DPPB_DE_INTR_RAW_STATUS           	top_de_intr_raw_status           ;	// 0x0040 : ''
	H13A0_DPPB_DE_INTR_CLR                  	top_de_intr_clr                  ;	// 0x0044 : ''
	H13A0_DPPB_RC_INTR_EN                   	top_rc_intr_en                   ;	// 0x0048 : ''
	H13A0_DPPB_RC_INTR_STATUS               	top_rc_intr_status               ;	// 0x004c : ''
	H13A0_DPPB_RC_INTR_RAW_STATUS           	top_rc_intr_raw_status           ;	// 0x0050 : ''
	H13A0_DPPB_RC_INTR_CLR                  	top_rc_intr_clr                  ;	// 0x0054 : ''
	H13A0_DPPB_DMA_CRC_CLR                  	top_dma_crc_clr                  ;	// 0x0058 : ''
	H13A0_DPPB_DMA_CRC_HEC                  	top_dma_crc_hec                  ;	// 0x005c : ''
	H13A0_DPPB_DMA_CRC_AAL5                 	top_dma_crc_aal5                 ;	// 0x0060 : ''
	UINT32                                  	top_ipc0                         ;	// 0x0064 : ''
	UINT32                                  	top_ipc1                         ;	// 0x0068 : ''
	UINT32                                  	top_ipc2                         ;	// 0x006c : ''
	UINT32                                  	top_ipc3                         ;	// 0x0070 : ''
	UINT32                                  	top_ipc4                         ;	// 0x0074 : ''
	UINT32                                  	top_ipc5                         ;	// 0x0078 : ''
	UINT32                                  	top_ipc6                         ;	// 0x007c : ''
	UINT32                                  	top_ipc7                         ;	// 0x0080 : ''
} DPPB_TOP_REG_H13A0_T;



/*
	DPPB TX MAP
*/

/*-----------------------------------------------------------------------------
	0x0000 txm_vx1_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_en                          : 4;	//  0: 3
} H13A0_DPPB_VX1_EN;

/*-----------------------------------------------------------------------------
	0x0004 txm_vx1_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_sel                         : 8;	//  0: 7
} H13A0_DPPB_VX1_SEL;

/*-----------------------------------------------------------------------------
	0x0008 txm_vx1_osd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_osd                         : 2;	//  0: 1
} H13A0_DPPB_VX1_OSD;

/*-----------------------------------------------------------------------------
	0x000c txm_force_flag_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_flag_en                   :16;	//  0:15
} H13A0_DPPB_FORCE_FLAG_EN;

/*-----------------------------------------------------------------------------
	0x0010 txm_force_flag ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_flag                      :12;	//  0:11
} H13A0_DPPB_FORCE_FLAG;

/*-----------------------------------------------------------------------------
	0x0014 txm_vx1_ctl0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_ctl0                        :24;	//  0:23
} H13A0_DPPB_VX1_CTL0;

/*-----------------------------------------------------------------------------
	0x0018 txm_vx1_ctl1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_ctl1                        :24;	//  0:23
} H13A0_DPPB_VX1_CTL1;

/*-----------------------------------------------------------------------------
	0x001c txm_vx1_ctl2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_ctl2                        :24;	//  0:23
} H13A0_DPPB_VX1_CTL2;

/*-----------------------------------------------------------------------------
	0x0020 txm_vx1_ctl3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_ctl3                        :24;	//  0:23
} H13A0_DPPB_VX1_CTL3;

/*-----------------------------------------------------------------------------
	0x0024 txm_force_data_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_data_en                   : 4;	//  0: 3
} H13A0_DPPB_FORCE_DATA_EN;

/*-----------------------------------------------------------------------------
	0x0028 txm_force_data0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_data0                     :30;	//  0:29
} H13A0_DPPB_FORCE_DATA0;

/*-----------------------------------------------------------------------------
	0x002c txm_force_data1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_data1                     :30;	//  0:29
} H13A0_DPPB_FORCE_DATA1;

/*-----------------------------------------------------------------------------
	0x0030 txm_force_data2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_data2                     :30;	//  0:29
} H13A0_DPPB_FORCE_DATA2;

/*-----------------------------------------------------------------------------
	0x0034 txm_force_data3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_data3                     :30;	//  0:29
} H13A0_DPPB_FORCE_DATA3;

/*-----------------------------------------------------------------------------
	0x0038 txm_force_alpha_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_alpha_en                  : 4;	//  0: 3
} H13A0_DPPB_FORCE_ALPHA_EN;

/*-----------------------------------------------------------------------------
	0x003c txm_force_alpha ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_alpha                     ;   	// 31: 0
} H13A0_DPPB_FORCE_ALPHA;

/*-----------------------------------------------------------------------------
	0x0040 txm_vmux_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vmux_ctrl                       : 3;	//  0: 2
} H13A0_DPPB_VMUX_CTRL;

/*-----------------------------------------------------------------------------
	0x0044 txm_pf_out_format ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pf_out_foramt                   : 3;	//  0: 2
} H13A0_DPPB_PF_OUT_FORMAT;

/*-----------------------------------------------------------------------------
	0x0048 txm_pf_osd_flag ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pf_osd_flag                     : 1;	//     0
} H13A0_DPPB_PF_OSD_FLAG;

typedef struct {
	H13A0_DPPB_VX1_EN                       	txm_vx1_en                       ;	// 0x0000 : ''
	H13A0_DPPB_VX1_SEL                      	txm_vx1_sel                      ;	// 0x0004 : ''
	H13A0_DPPB_VX1_OSD                      	txm_vx1_osd                      ;	// 0x0008 : ''
	H13A0_DPPB_FORCE_FLAG_EN                	txm_force_flag_en                ;	// 0x000c : ''
	H13A0_DPPB_FORCE_FLAG                   	txm_force_flag                   ;	// 0x0010 : ''
	H13A0_DPPB_VX1_CTL0                     	txm_vx1_ctl0                     ;	// 0x0014 : ''
	H13A0_DPPB_VX1_CTL1                     	txm_vx1_ctl1                     ;	// 0x0018 : ''
	H13A0_DPPB_VX1_CTL2                     	txm_vx1_ctl2                     ;	// 0x001c : ''
	H13A0_DPPB_VX1_CTL3                     	txm_vx1_ctl3                     ;	// 0x0020 : ''
	H13A0_DPPB_FORCE_DATA_EN                	txm_force_data_en                ;	// 0x0024 : ''
	H13A0_DPPB_FORCE_DATA0                  	txm_force_data0                  ;	// 0x0028 : ''
	H13A0_DPPB_FORCE_DATA1                  	txm_force_data1                  ;	// 0x002c : ''
	H13A0_DPPB_FORCE_DATA2                  	txm_force_data2                  ;	// 0x0030 : ''
	H13A0_DPPB_FORCE_DATA3                  	txm_force_data3                  ;	// 0x0034 : ''
	H13A0_DPPB_FORCE_ALPHA_EN               	txm_force_alpha_en               ;	// 0x0038 : ''
	H13A0_DPPB_FORCE_ALPHA                  	txm_force_alpha                  ;	// 0x003c : ''
	H13A0_DPPB_VMUX_CTRL                    	txm_vmux_ctrl                    ;	// 0x0040 : ''
	H13A0_DPPB_PF_OUT_FORMAT                	txm_pf_out_format                ;	// 0x0044 : ''
	H13A0_DPPB_PF_OSD_FLAG                  	txm_pf_osd_flag                  ;	// 0x0048 : ''
} DPPB_TXM_REG_H13A0_T;



/*
	DPPB LED
*/

/*-----------------------------------------------------------------------------
	0x0000 led_bv_gen_hv_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsh_bv_gen                      :12,	//  0:11
	                                : 4,	// 12:15 reserved
	bsv_bv_gen                      :12;	// 16:27
} H13A0_LED_BV_GEN_HV_SIZE;

/*-----------------------------------------------------------------------------
	0x0004 led_bv_gen_blk_num_hv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_bv_gen                      : 6,	//  0: 5
	                                :10,	//  6:15 reserved
	bnv_bv_gen                      : 5;	// 16:20
} H13A0_LED_BV_GEN_BLK_NUM_HV;

/*-----------------------------------------------------------------------------
	0x0008 led_hv_resolution ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hres                            :12,	//  0:11
	                                : 4,	// 12:15 reserved
	vres                            :12;	// 16:27
} H13A0_LED_HV_RESOLUTION;

/*-----------------------------------------------------------------------------
	0x000c led_sync_pol ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vs_out_neg                      : 1,	//     0
	hs_out_neg                      : 1,	//     1
	vs_in_neg                       : 1,	//     2
	hs_in_neg                       : 1;	//     3
} H13A0_LED_SYNC_POL;

/*-----------------------------------------------------------------------------
	0x0010 led_vin_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mode_2ch                        : 1;	//     0
} H13A0_LED_VIN_CONFIG;

/*-----------------------------------------------------------------------------
	0x0040 led_dbg_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pbl_mode                        : 2,	//  0: 1
	apf                             : 1,	//     2
	sbi2rgb                         : 1,	//     3
	sbi_dis                         : 1,	//     4
	mark_en                         : 1,	//     5
	apf_lres                        : 1;	//     6
} H13A0_LED_DBG_CTRL;

/*-----------------------------------------------------------------------------
	0x0044 led_lum ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lum                             :10;	//  0: 9
} H13A0_LED_LUM;

/*-----------------------------------------------------------------------------
	0x0048 led_blu_i2c_wdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_i2c_wdata                   :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	blu_i2c_waddr                   :11,	// 16:26
	                                : 4,	// 27:30 reserved
	blu_i2c_we                      : 1;	//    31
} H13A0_LED_BLU_I2C_WDATA;

/*-----------------------------------------------------------------------------
	0x004c led_sb_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_sel                         : 1;	//     0
} H13A0_LED_SB_SEL;

/*-----------------------------------------------------------------------------
	0x0050 led_sb_i2c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_i2c                         :10;	//  0: 9
} H13A0_LED_SB_I2C;

/*-----------------------------------------------------------------------------
	0x0054 led_bv_read ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_rdata                        :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	bv_raddr                        :11;	// 16:26
} H13A0_LED_BV_READ;

/*-----------------------------------------------------------------------------
	0x0058 led_bv_write ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_wdata                        :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	bv_waddr                        :11;	// 16:26
} H13A0_LED_BV_WRITE;

/*-----------------------------------------------------------------------------
	0x005c led_bv_rw_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_rw_done                      : 1;	//     0
} H13A0_LED_BV_RW_STATUS;

/*-----------------------------------------------------------------------------
	0x0060 led_debug_dither ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	debug_dither_mode               : 2,	//  0: 1
	debug_dither_frame_cnt          : 2;	//  2: 3
} H13A0_LED_DEBUG_DITHER;

/*-----------------------------------------------------------------------------
	0x0080 led_pat_on ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rectangular                     : 1,	//     0
	grid                            : 1,	//     1
	gradation_r                     : 1,	//     2
	gradation_g                     : 1,	//     3
	gradation_b                     : 1,	//     4
	color_bar                       : 1,	//     5
	                                : 2,	//  6: 7 reserved
	gray_image                      : 1;	//     8
} H13A0_LED_PAT_ON;

/*-----------------------------------------------------------------------------
	0x0084 led_pat_val ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	b_value                         :10,	//  0: 9
	g_value                         :10,	// 10:19
	r_value                         :10;	// 20:29
} H13A0_LED_PAT_VAL;

/*-----------------------------------------------------------------------------
	0x0088 led_pat_h_min_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	h_min                           :11,	//  0:10
	                                : 5,	// 11:15 reserved
	h_max                           :11;	// 16:26
} H13A0_LED_PAT_H_MIN_MAX;

/*-----------------------------------------------------------------------------
	0x008c led_pat_v_min_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_min                           :12,	//  0:11
	                                : 4,	// 12:15 reserved
	v_max                           :12;	// 16:27
} H13A0_LED_PAT_V_MIN_MAX;

/*-----------------------------------------------------------------------------
	0x0090 led_pat_hv_ppf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_h_ppf                       : 8,	//  0: 7
	pat_v_ppf                       : 8;	//  8:15
} H13A0_LED_PAT_HV_PPF;

/*-----------------------------------------------------------------------------
	0x0094 led_pat_val_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	b_value                         :10,	//  0: 9
	g_value                         :10,	// 10:19
	r_value                         :10;	// 20:29
} H13A0_LED_PAT_VAL_R;

/*-----------------------------------------------------------------------------
	0x0098 led_pat_h_min_max_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	h_min                           :11,	//  0:10
	                                : 5,	// 11:15 reserved
	h_max                           :11;	// 16:26
} H13A0_LED_PAT_H_MIN_MAX_R;

/*-----------------------------------------------------------------------------
	0x009c led_pat_v_min_max_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_min                           :12,	//  0:11
	                                : 4,	// 12:15 reserved
	v_max                           :12;	// 16:27
} H13A0_LED_PAT_V_MIN_MAX_R;

/*-----------------------------------------------------------------------------
	0x00c0 led_iwb_r_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iwb_r_gain                      :11,	//  0:10
	                                : 5,	// 11:15 reserved
	iwb_r_offset                    :10;	// 16:25
} H13A0_LED_IWB_R_GAIN;

/*-----------------------------------------------------------------------------
	0x00c4 led_iwb_g_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iwb_g_gain                      :11,	//  0:10
	                                : 5,	// 11:15 reserved
	iwb_g_offset                    :10;	// 16:25
} H13A0_LED_IWB_G_GAIN;

/*-----------------------------------------------------------------------------
	0x00c8 led_iwb_b_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iwb_b_gain                      :11,	//  0:10
	                                : 5,	// 11:15 reserved
	iwb_b_offset                    :10;	// 16:25
} H13A0_LED_IWB_B_GAIN;

/*-----------------------------------------------------------------------------
	0x0180 led_max_opt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	max_opt                         : 8;	//  0: 7
} H13A0_LED_MAX_OPT;

/*-----------------------------------------------------------------------------
	0x0184 led_blk_max_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_max_mode                    : 1;	//     0
} H13A0_LED_BLK_MAX_MODE;

/*-----------------------------------------------------------------------------
	0x0188 led_max_opt_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	max_opt_mode                    : 1;	//     0
} H13A0_LED_MAX_OPT_MODE;

/*-----------------------------------------------------------------------------
	0x018c led_max_opt0_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	max_opt1                        : 8,	//  0: 7
	max_opt0                        : 8;	//  8:15
} H13A0_LED_MAX_OPT0_1;

/*-----------------------------------------------------------------------------
	0x0190 led_level_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	level_th                        :10;	//  0: 9
} H13A0_LED_LEVEL_TH;

/*-----------------------------------------------------------------------------
	0x0194 led_number_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	number_th                       :12,	//  0:11
	                                : 4,	// 12:15 reserved
	number_bit_sel                  : 4;	// 16:19
} H13A0_LED_NUMBER_TH;

/*-----------------------------------------------------------------------------
	0x0198 led_apl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	avg_bv                          :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	apl                             :10;	// 16:25
} H13A0_LED_APL;

/*-----------------------------------------------------------------------------
	0x019c led_bv_gen_x1_x2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_x2                       :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	bv_gen_x1                       :10;	// 16:25
} H13A0_LED_BV_GEN_X1_X2;

/*-----------------------------------------------------------------------------
	0x01a0 led_bv_gen_x3_x4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_x4                       :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	bv_gen_x3                       :10;	// 16:25
} H13A0_LED_BV_GEN_X3_X4;

/*-----------------------------------------------------------------------------
	0x01a4 led_bv_gen_y0_y1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_y1                       :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	bv_gen_y0                       :10;	// 16:25
} H13A0_LED_BV_GEN_Y0_Y1;

/*-----------------------------------------------------------------------------
	0x01a8 led_bv_gen_y2_y3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_y3                       :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	bv_gen_y2                       :10;	// 16:25
} H13A0_LED_BV_GEN_Y2_Y3;

/*-----------------------------------------------------------------------------
	0x01ac led_bv_gen_y4_y5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_y5                       :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	bv_gen_y4                       :10;	// 16:25
} H13A0_LED_BV_GEN_Y4_Y5;

/*-----------------------------------------------------------------------------
	0x01c0 led_bv_rctrl_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rctrl_mode                      : 4,	//  0: 3
	                                : 4,	//  4: 7 reserved
	vsout_mode                      : 4,	//  8:11
	                                : 4,	// 12:15 reserved
	bdata_mode                      : 4,	// 16:19
	                                : 4,	// 20:23 reserved
	tfout_mode                      : 4;	// 24:27
} H13A0_LED_BV_RCTRL_MODE;

/*-----------------------------------------------------------------------------
	0x01c4 led_pic_attr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_attr                        : 1,	//     0
	black_mask                      : 1,	//     1
	tf_pic_attr                     : 1;	//     2
} H13A0_LED_PIC_ATTR;

/*-----------------------------------------------------------------------------
	0x01c8 led_lr_sync_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lr_sync_sel                     : 1;	//     0
} H13A0_LED_LR_SYNC_SEL;

/*-----------------------------------------------------------------------------
	0x0200 led_sc_mag_gn_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_mag_th                       :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	sc_mag_gn                       : 8;	// 16:23
} H13A0_LED_SC_MAG_GN_TH;

/*-----------------------------------------------------------------------------
	0x0204 led_sc_mag_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_mag_info                     :10;	//  0: 9
} H13A0_LED_SC_MAG_INFO;

/*-----------------------------------------------------------------------------
	0x0240 led_lut_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut_mode                        : 2;	//  0: 1
} H13A0_LED_LUT_MODE;

/*-----------------------------------------------------------------------------
	0x0244 led_ex_abv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ex_abv                          :10;	//  0: 9
} H13A0_LED_EX_ABV;

/*-----------------------------------------------------------------------------
	0x0248 led_sg_l_h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_l                            : 8,	//  0: 7
	sg_h                            : 8;	//  8:15
} H13A0_LED_SG_L_H;

/*-----------------------------------------------------------------------------
	0x024c led_dc_lut_raddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut_dbg_raddr                   :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	lut_dbg_rd_sel                  : 1;	//    16
} H13A0_LED_DC_LUT_RADDR;

/*-----------------------------------------------------------------------------
	0x0250 led_dc_lut_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut1_dbg_rdata                  :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	lut0_dbg_rdata                  :10;	// 16:25
} H13A0_LED_DC_LUT_RDATA;

/*-----------------------------------------------------------------------------
	0x0254 led_bv_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gain                         :11;	//  0:10
} H13A0_LED_BV_GAIN;

/*-----------------------------------------------------------------------------
	0x0258 led_lut_avg_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut_avg_sel                     : 1;	//     0
} H13A0_LED_LUT_AVG_SEL;

/*-----------------------------------------------------------------------------
	0x0280 led_lsf_um_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_en                          : 1;	//     0
} H13A0_LED_LSF_UM_EN;

/*-----------------------------------------------------------------------------
	0x0284 led_lsf_5x5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_5x5_en                      : 1;	//     0
} H13A0_LED_LSF_5X5;

/*-----------------------------------------------------------------------------
	0x0288 led_lsf_coaring ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_coaring_n                   :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	lsf_coaring_p                   :10;	// 16:25
} H13A0_LED_LSF_COARING;

/*-----------------------------------------------------------------------------
	0x028c led_lsf_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_gain_n                      :12,	//  0:11
	                                : 4,	// 12:15 reserved
	lsf_gain_p                      :12;	// 16:27
} H13A0_LED_LSF_GAIN;

/*-----------------------------------------------------------------------------
	0x0290 led_lsf_wr_coeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_coeff_wdata                 :12;	//  0:11
} H13A0_LED_LSF_WR_COEFF;

/*-----------------------------------------------------------------------------
	0x0294 led_lsf_rd_coeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_coeff_rdata                 :12,	//  0:11
	                                : 4,	// 12:15 reserved
	lsf_coeff_raddr                 : 5;	// 16:20
} H13A0_LED_LSF_RD_COEFF;

/*-----------------------------------------------------------------------------
	0x02c0 led_t_sf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	t_sf                            :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	limit                           :10;	// 16:25
} H13A0_LED_T_SF;

/*-----------------------------------------------------------------------------
	0x02c4 led_kmode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	kmode                           : 1;	//     0
} H13A0_LED_KMODE;

/*-----------------------------------------------------------------------------
	0x02c8 led_hvkmask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hkmask                          : 2,	//  0: 1
	vkmask                          : 2;	//  2: 3
} H13A0_LED_HVKMASK;

/*-----------------------------------------------------------------------------
	0x0300 led_tf_opmode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tf_opmode                       : 3;	//  0: 2
} H13A0_LED_TF_OPMODE;

/*-----------------------------------------------------------------------------
	0x0304 led_a_para ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a_para                          : 9;	//  0: 8
} H13A0_LED_A_PARA;

/*-----------------------------------------------------------------------------
	0x0308 led_sc_adj_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_adj_en                       : 1;	//     0
} H13A0_LED_SC_ADJ_EN;

/*-----------------------------------------------------------------------------
	0x030c led_md_adj_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_adj_en                       : 1;	//     0
} H13A0_LED_MD_ADJ_EN;

/*-----------------------------------------------------------------------------
	0x0310 led_md_x1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_x1_n                         :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	md_x1_p                         :10;	// 16:25
} H13A0_LED_MD_X1;

/*-----------------------------------------------------------------------------
	0x0314 led_md_x2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_x2_n                         :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	md_x2_p                         :10;	// 16:25
} H13A0_LED_MD_X2;

/*-----------------------------------------------------------------------------
	0x0318 led_md_x3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_x3_n                         :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	md_x3_p                         :10;	// 16:25
} H13A0_LED_MD_X3;

/*-----------------------------------------------------------------------------
	0x031c led_md_x4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_x4_n                         :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	md_x4_p                         :10;	// 16:25
} H13A0_LED_MD_X4;

/*-----------------------------------------------------------------------------
	0x0320 led_md_y0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y0_n                         : 9,	//  0: 8
	                                : 7,	//  9:15 reserved
	md_y0_p                         : 9;	// 16:24
} H13A0_LED_MD_Y0;

/*-----------------------------------------------------------------------------
	0x0324 led_md_y1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y1_n                         : 9,	//  0: 8
	                                : 7,	//  9:15 reserved
	md_y1_p                         : 9;	// 16:24
} H13A0_LED_MD_Y1;

/*-----------------------------------------------------------------------------
	0x0328 led_md_y2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y2_n                         : 9,	//  0: 8
	                                : 7,	//  9:15 reserved
	md_y2_p                         : 9;	// 16:24
} H13A0_LED_MD_Y2;

/*-----------------------------------------------------------------------------
	0x032c led_md_y3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y3_n                         : 9,	//  0: 8
	                                : 7,	//  9:15 reserved
	md_y3_p                         : 9;	// 16:24
} H13A0_LED_MD_Y3;

/*-----------------------------------------------------------------------------
	0x0330 led_md_y4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y4_n                         : 9,	//  0: 8
	                                : 7,	//  9:15 reserved
	md_y4_p                         : 9;	// 16:24
} H13A0_LED_MD_Y4;

/*-----------------------------------------------------------------------------
	0x0334 led_md_y5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y5_n                         : 9,	//  0: 8
	                                : 7,	//  9:15 reserved
	md_y5_p                         : 9;	// 16:24
} H13A0_LED_MD_Y5;

/*-----------------------------------------------------------------------------
	0x0340 led_led_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	led_mode                        : 2,	//  0: 1
	                                : 6,	//  2: 7 reserved
	edge_mode                       : 2,	//  8: 9
	                                : 6,	// 10:15 reserved
	hybrid_mode                     : 1,	//    16
	                                : 7,	// 17:23 reserved
	hybrid_pattern                  : 4;	// 24:27
} H13A0_LED_LED_MODE;

/*-----------------------------------------------------------------------------
	0x0344 led_lres_bnh_bnv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_lres                        : 6,	//  0: 5
	                                :10,	//  6:15 reserved
	bnv_lres                        : 5;	// 16:20
} H13A0_LED_LRES_BNH_BNV;

/*-----------------------------------------------------------------------------
	0x0348 led_lres_bsh_bsv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsh_lres                        : 6,	//  0: 5
	                                :10,	//  6:15 reserved
	bsv_lres                        : 5;	// 16:20
} H13A0_LED_LRES_BSH_BSV;

/*-----------------------------------------------------------------------------
	0x034c led_sbi_bnh_bnv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_bnh                         : 8,	//  0: 7
	                                : 8,	//  8:15 reserved
	sbi_bnv                         : 7;	// 16:22
} H13A0_LED_SBI_BNH_BNV;

/*-----------------------------------------------------------------------------
	0x0350 led_sbi_bsh_bsv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_bsh                         :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	sbi_bsv                         :10;	// 16:25
} H13A0_LED_SBI_BSH_BSV;

/*-----------------------------------------------------------------------------
	0x0354 led_tab1_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tab1_rd_sel                     : 1;	//     0
} H13A0_LED_TAB1_RD_SEL;

/*-----------------------------------------------------------------------------
	0x0358 led_tab1_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tab1_re                         : 1;	//     0
} H13A0_LED_TAB1_RDATA;

/*-----------------------------------------------------------------------------
	0x035c led_tab5_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tab5_rd_sel                     : 1;	//     0
} H13A0_LED_TAB5_RD_SEL;

/*-----------------------------------------------------------------------------
	0x0360 led_tab5_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tab5_re                         : 1;	//     0
} H13A0_LED_TAB5_RDATA;

/*-----------------------------------------------------------------------------
	0x0364 led_hfc_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hfc_rd_sel                      : 1;	//     0
} H13A0_LED_HFC_RD_SEL;

/*-----------------------------------------------------------------------------
	0x0368 led_hfc_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hfc_re                          : 1;	//     0
} H13A0_LED_HFC_RDATA;

/*-----------------------------------------------------------------------------
	0x036c led_vfc_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vfc_rd_sel                      : 1;	//     0
} H13A0_LED_VFC_RD_SEL;

/*-----------------------------------------------------------------------------
	0x0370 led_vfc_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vfc_re                          : 1;	//     0
} H13A0_LED_VFC_RDATA;

/*-----------------------------------------------------------------------------
	0x0380 led_comp_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pixel_comp_en                   : 1;	//     0
} H13A0_LED_COMP_EN;

/*-----------------------------------------------------------------------------
	0x0384 led_cont_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	const_gain                      :10;	//  0: 9
} H13A0_LED_CONT_GAIN;

/*-----------------------------------------------------------------------------
	0x0388 led_comp_in ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	comp_in_sel                     : 2;	//  0: 1
} H13A0_LED_COMP_IN;

/*-----------------------------------------------------------------------------
	0x038c led_pc_raddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_raddr                    : 7,	//  0: 6
	                                : 9,	//  7:15 reserved
	pc_lut_d_rden                   : 1,	//    16
	pc_lut_c_rden                   : 1,	//    17
	pc_lut_b_rden                   : 1,	//    18
	pc_lut_a_rden                   : 1;	//    19
} H13A0_LED_PC_RADDR;

/*-----------------------------------------------------------------------------
	0x0390 led_pc_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_rdata                    :10;	//  0: 9
} H13A0_LED_PC_RDATA;

/*-----------------------------------------------------------------------------
	0x0400 led_gbl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gbl                             :10;	//  0: 9
} H13A0_LED_GBL;

/*-----------------------------------------------------------------------------
	0x0404 led_abv_cmp_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	abv_cmp_val                     :10;	//  0: 9
} H13A0_LED_ABV_CMP_VALUE;

/*-----------------------------------------------------------------------------
	0x0408 led_bv_dly ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_dly_ble                      : 2,	//  0: 1
	                                : 6,	//  2: 7 reserved
	bv_dly_blu                      : 2;	//  8: 9
} H13A0_LED_BV_DLY;

/*-----------------------------------------------------------------------------
	0x040c led_blu_bv_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_bv_sel                      : 1;	//     0
} H13A0_LED_BLU_BV_SEL;

/*-----------------------------------------------------------------------------
	0x0440 led_instr_wr_req ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	led_instr_wr_req_0                 : 1,	//     0
	led_instr_wr_req_1                 : 1;	//     1
} H13A0_LED_INSTR_WR_REQ;

/*-----------------------------------------------------------------------------
	0x0444 led_instr_wdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wdata_instr                     :11,	//  0:10
	                                : 5,	// 11:15 reserved
	waddr_instr                     : 3;	// 16:18
} H13A0_LED_INSTR_WDATA;

/*-----------------------------------------------------------------------------
	0x0448 led_instr_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rdata_instr                     :11,	//  0:10
	                                : 5,	// 11:15 reserved
	raddr_instr                     : 3;	// 16:18
} H13A0_LED_INSTR_RDATA;

/*-----------------------------------------------------------------------------
	0x044c led_instr_dgb ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	debug_instr                     :11,	//  0:10
	                                : 5,	// 11:15 reserved
	debug_pc                        : 3,	// 16:18
	                                :12,	// 19:30 reserved
	bv_ctrl_err                     : 1;	//    31
} H13A0_LED_INSTR_DGB;

/*-----------------------------------------------------------------------------
	0x0480 led_blc_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blc_mode                        : 1;	//     0
} H13A0_LED_BLC_MODE;

/*-----------------------------------------------------------------------------
	0x0484 led_bsf_c0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_c0                          :10;	//  0: 9
} H13A0_LED_BSF_C0;

/*-----------------------------------------------------------------------------
	0x0488 led_bsf_c1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_c1                          :10;	//  0: 9
} H13A0_LED_BSF_C1;

/*-----------------------------------------------------------------------------
	0x048c led_bsf_c2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_c2                          :10;	//  0: 9
} H13A0_LED_BSF_C2;

/*-----------------------------------------------------------------------------
	0x0490 led_bsf_ratio0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_ratio0                      :10;	//  0: 9
} H13A0_LED_BSF_RATIO0;

/*-----------------------------------------------------------------------------
	0x0494 led_bsf_ratio1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_ratio1                      :10;	//  0: 9
} H13A0_LED_BSF_RATIO1;

/*-----------------------------------------------------------------------------
	0x0498 led_bsf_ratio2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_ratio2                      :10;	//  0: 9
} H13A0_LED_BSF_RATIO2;

/*-----------------------------------------------------------------------------
	0x049c led_a0_gn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a0_gn                           : 8;	//  0: 7
} H13A0_LED_A0_GN;

/*-----------------------------------------------------------------------------
	0x04a0 led_a1_gn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a1_gn                           : 8;	//  0: 7
} H13A0_LED_A1_GN;

/*-----------------------------------------------------------------------------
	0x04a4 led_a2_gn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a2_gn                           : 8;	//  0: 7
} H13A0_LED_A2_GN;

/*-----------------------------------------------------------------------------
	0x04a8 led_a0_ratio ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a0_ratio                        : 8;	//  0: 7
} H13A0_LED_A0_RATIO;

/*-----------------------------------------------------------------------------
	0x04ac led_a1_ratio ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a1_ratio                        : 8;	//  0: 7
} H13A0_LED_A1_RATIO;

/*-----------------------------------------------------------------------------
	0x04b0 led_drv_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	drv_max                         :10;	//  0: 9
} H13A0_LED_DRV_MAX;

/*-----------------------------------------------------------------------------
	0x04c0 led_mem_addr_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mem_dl_addr_clr                 : 1,	//     0
	                                :15,	//  1:15 reserved
	mem_dl_addr                     :12;	// 16:27
} H13A0_LED_MEM_ADDR_CLR;

/*-----------------------------------------------------------------------------
	0x04c4 led_mem_dl_sbi_hcoeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_hcoeff                      :10;	//  0: 9
} H13A0_LED_MEM_DL_SBI_HCOEFF;

/*-----------------------------------------------------------------------------
	0x04c8 led_mem_dl_sbi_vcoeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_vcoeff                      :10;	//  0: 9
} H13A0_LED_MEM_DL_SBI_VCOEFF;

/*-----------------------------------------------------------------------------
	0x04cc led_mem_dl_pixel_comp_a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_a                        :10;	//  0: 9
} H13A0_LED_MEM_DL_PIXEL_COMP_A;

/*-----------------------------------------------------------------------------
	0x04d0 led_mem_dl_pixel_comp_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_b                        :10;	//  0: 9
} H13A0_LED_MEM_DL_PIXEL_COMP_B;

/*-----------------------------------------------------------------------------
	0x04d4 led_mem_dl_pixel_comp_c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_c                        :10;	//  0: 9
} H13A0_LED_MEM_DL_PIXEL_COMP_C;

/*-----------------------------------------------------------------------------
	0x04d8 led_mem_dl_pixel_comp_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_d                        :10;	//  0: 9
} H13A0_LED_MEM_DL_PIXEL_COMP_D;

/*-----------------------------------------------------------------------------
	0x04dc led_upper_dc_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dc_lut_upper                    :10;	//  0: 9
} H13A0_LED_UPPER_DC_LUT;

/*-----------------------------------------------------------------------------
	0x04e0 led_lower_dc_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dc_lut_lower                    :10;	//  0: 9
} H13A0_LED_LOWER_DC_LUT;

/*-----------------------------------------------------------------------------
	0x04e4 led_fc_tab1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fc_tab1                         :10;	//  0: 9
} H13A0_LED_FC_TAB1;

/*-----------------------------------------------------------------------------
	0x04e8 led_fc_tab5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fc_tab5                         :10;	//  0: 9
} H13A0_LED_FC_TAB5;

/*-----------------------------------------------------------------------------
	0x0500 led_mean_in_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mean_in_sel                     : 1;	//     0
} H13A0_LED_MEAN_IN_SEL;

/*-----------------------------------------------------------------------------
	0x0504 led_mean ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pixel_mean                      :10;	//  0: 9
} H13A0_LED_MEAN;

/*-----------------------------------------------------------------------------
	0x0540 led_rp_hv_pos ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rp_v_pos                        :12,	//  0:11
	                                : 4,	// 12:15 reserved
	rp_h_pos                        :12;	// 16:27
} H13A0_LED_RP_HV_POS;

/*-----------------------------------------------------------------------------
	0x0544 led_rp_make_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mark_en                         : 1;	//     0
} H13A0_LED_RP_MAKE_EN;

/*-----------------------------------------------------------------------------
	0x0548 led_rp_r_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_pixel_r                      :14;	//  0:13
} H13A0_LED_RP_R_VALUE;

/*-----------------------------------------------------------------------------
	0x054c led_rp_g_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_pixel_g                      :14;	//  0:13
} H13A0_LED_RP_G_VALUE;

/*-----------------------------------------------------------------------------
	0x0550 led_rp_b_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_pixel_b                      :14;	//  0:13
} H13A0_LED_RP_B_VALUE;

/*-----------------------------------------------------------------------------
	0x0580 led_disp_bv_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	display_bv_en                   : 1;	//     0
} H13A0_LED_DISP_BV_EN;

/*-----------------------------------------------------------------------------
	0x0584 led_dsip_bv_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	display_bv_addr                 :11;	//  0:10
} H13A0_LED_DSIP_BV_ADDR;

/*-----------------------------------------------------------------------------
	0x05c0 led_dither_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither_en                       : 1,	//     0
	dither_temp_en                  : 1;	//     1
} H13A0_LED_DITHER_EN;

/*-----------------------------------------------------------------------------
	0x05c4 led_dither_load ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	loled_bit                        : 1;	//     0
} H13A0_LED_DITHER_LOAD;

/*-----------------------------------------------------------------------------
	0x05c8 led_dither_pat_00_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_0_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_00_U;

/*-----------------------------------------------------------------------------
	0x05cc led_dither_pat_00_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_0_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_00_L;

/*-----------------------------------------------------------------------------
	0x05d0 led_dither_pat_01_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_1_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_01_U;

/*-----------------------------------------------------------------------------
	0x05d4 led_dither_pat_01_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_1_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_01_L;

/*-----------------------------------------------------------------------------
	0x05d8 led_dither_pat_02_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_2_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_02_U;

/*-----------------------------------------------------------------------------
	0x05dc led_dither_pat_02_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_2_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_02_L;

/*-----------------------------------------------------------------------------
	0x05e0 led_dither_pat_03_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_3_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_03_U;

/*-----------------------------------------------------------------------------
	0x05e4 led_dither_pat_03_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_3_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_03_L;

/*-----------------------------------------------------------------------------
	0x05e8 led_dither_pat_04_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_4_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_04_U;

/*-----------------------------------------------------------------------------
	0x05ec led_dither_pat_04_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_4_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_04_L;

/*-----------------------------------------------------------------------------
	0x05f0 led_dither_pat_05_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_5_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_05_U;

/*-----------------------------------------------------------------------------
	0x05f4 led_dither_pat_05_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_5_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_05_L;

/*-----------------------------------------------------------------------------
	0x05f8 led_dither_pat_06_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_6_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_06_U;

/*-----------------------------------------------------------------------------
	0x05fc led_dither_pat_06_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_6_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_06_L;

/*-----------------------------------------------------------------------------
	0x0600 led_dither_pat_07_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_7_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_07_U;

/*-----------------------------------------------------------------------------
	0x0604 led_dither_pat_07_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_7_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_07_L;

/*-----------------------------------------------------------------------------
	0x0608 led_dither_pat_08_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_8_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_08_U;

/*-----------------------------------------------------------------------------
	0x060c led_dither_pat_08_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_8_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_08_L;

/*-----------------------------------------------------------------------------
	0x0610 led_dither_pat_09_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_9_31__0           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_09_U;

/*-----------------------------------------------------------------------------
	0x0614 led_dither_pat_09_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_9_63_32           ;   	// 31: 0
} H13A0_LED_DITHER_PAT_09_L;

/*-----------------------------------------------------------------------------
	0x0618 led_dither_pat_10_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_10_31__0          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_10_U;

/*-----------------------------------------------------------------------------
	0x061c led_dither_pat_10_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_10_63_32          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_10_L;

/*-----------------------------------------------------------------------------
	0x0620 led_dither_pat_11_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_11_31__0          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_11_U;

/*-----------------------------------------------------------------------------
	0x0624 led_dither_pat_11_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_11_63_32          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_11_L;

/*-----------------------------------------------------------------------------
	0x0628 led_dither_pat_12_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_12_31__0          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_12_U;

/*-----------------------------------------------------------------------------
	0x062c led_dither_pat_12_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_12_63_32          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_12_L;

/*-----------------------------------------------------------------------------
	0x0630 led_dither_pat_13_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_13_31__0          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_13_U;

/*-----------------------------------------------------------------------------
	0x0634 led_dither_pat_13_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_13_63_32          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_13_L;

/*-----------------------------------------------------------------------------
	0x0638 led_dither_pat_14_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_14_31__0          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_14_U;

/*-----------------------------------------------------------------------------
	0x063c led_dither_pat_14_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_14_63_32          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_14_L;

/*-----------------------------------------------------------------------------
	0x0640 led_dither_pat_15_u ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_15_31__0          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_15_U;

/*-----------------------------------------------------------------------------
	0x0644 led_dither_pat_15_l ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither4x4_pat_15_63_32          ;   	// 31: 0
} H13A0_LED_DITHER_PAT_15_L;

/*-----------------------------------------------------------------------------
	0x0648 led_frame0_pat_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame0_pattern_r                :16;	//  0:15
} H13A0_LED_FRAME0_PAT_R;

/*-----------------------------------------------------------------------------
	0x064c led_frame0_pat_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame0_pattern_g                :16;	//  0:15
} H13A0_LED_FRAME0_PAT_G;

/*-----------------------------------------------------------------------------
	0x0650 led_frame0_pat_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame0_pattern_b                :16;	//  0:15
} H13A0_LED_FRAME0_PAT_B;

/*-----------------------------------------------------------------------------
	0x0654 led_frame1_pat_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame1_pattern_r                :16;	//  0:15
} H13A0_LED_FRAME1_PAT_R;

/*-----------------------------------------------------------------------------
	0x0658 led_frame1_pat_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame1_pattern_g                :16;	//  0:15
} H13A0_LED_FRAME1_PAT_G;

/*-----------------------------------------------------------------------------
	0x065c led_frame1_pat_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame1_pattern_b                :16;	//  0:15
} H13A0_LED_FRAME1_PAT_B;

/*-----------------------------------------------------------------------------
	0x0660 led_frame2_pat_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame2_pattern_r                :16;	//  0:15
} H13A0_LED_FRAME2_PAT_R;

/*-----------------------------------------------------------------------------
	0x0664 led_frame2_pat_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame2_pattern_g                :16;	//  0:15
} H13A0_LED_FRAME2_PAT_G;

/*-----------------------------------------------------------------------------
	0x0668 led_frame2_pat_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame2_pattern_b                :16;	//  0:15
} H13A0_LED_FRAME2_PAT_B;

/*-----------------------------------------------------------------------------
	0x066c led_frame3_pat_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame3_pattern_r                :16;	//  0:15
} H13A0_LED_FRAME3_PAT_R;

/*-----------------------------------------------------------------------------
	0x0670 led_frame3_pat_g ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame3_pattern_g                :16;	//  0:15
} H13A0_LED_FRAME3_PAT_G;

/*-----------------------------------------------------------------------------
	0x0674 led_frame3_pat_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	frame3_pattern_b                :16;	//  0:15
} H13A0_LED_FRAME3_PAT_B;

/*-----------------------------------------------------------------------------
	0x0680 led_hdr_bsv_bsh ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_bsh                         : 7,	//  0: 6
	                                : 9,	//  7:15 reserved
	hdr_bsv                         : 7;	// 16:22
} H13A0_LED_HDR_BSV_BSH;

/*-----------------------------------------------------------------------------
	0x0684 led_hdr_bnv_bnh ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_bnh                         : 7,	//  0: 6
	                                : 9,	//  7:15 reserved
	hdr_bnv                         : 6;	// 16:21
} H13A0_LED_HDR_BNV_BNH;

/*-----------------------------------------------------------------------------
	0x0688 led_hdr_blk_dif_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_blk_dif_th                  : 5;	//  0: 4
} H13A0_LED_HDR_BLK_DIF_TH;

/*-----------------------------------------------------------------------------
	0x068c led_hdr_blk_num_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_blk_num_th                  :10;	//  0: 9
} H13A0_LED_HDR_BLK_NUM_TH;

/*-----------------------------------------------------------------------------
	0x0690 led_hdr_bd_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_bd_th                       : 4;	//  0: 3
} H13A0_LED_HDR_BD_TH;

/*-----------------------------------------------------------------------------
	0x0694 led_hdr_lk_lpf_apf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_lpf_apf                  : 1;	//     0
} H13A0_LED_HDR_LK_LPF_APF;

/*-----------------------------------------------------------------------------
	0x0698 led_hdr_lk_wei_apf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_apf                  : 1;	//     0
} H13A0_LED_HDR_LK_WEI_APF;

/*-----------------------------------------------------------------------------
	0x069c led_hdr_lk_wei_gn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_gn                   : 6;	//  0: 5
} H13A0_LED_HDR_LK_WEI_GN;

/*-----------------------------------------------------------------------------
	0x06a0 led_hdr_lk_wei_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_mode                 : 1;	//     0
} H13A0_LED_HDR_LK_WEI_MODE;

/*-----------------------------------------------------------------------------
	0x06a4 led_hdr_sk_flt_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_sk_flt_th                   : 5;	//  0: 4
} H13A0_LED_HDR_SK_FLT_TH;

/*-----------------------------------------------------------------------------
	0x06a8 led_hdr_sk_dif_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_sk_dif_th                   : 5;	//  0: 4
} H13A0_LED_HDR_SK_DIF_TH;

/*-----------------------------------------------------------------------------
	0x06ac led_hdr_lpf_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_dbg_lpf_mode                : 2;	//  0: 1
} H13A0_LED_HDR_LPF_MODE;

/*-----------------------------------------------------------------------------
	0x06b0 led_hdr_decon_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_decon_en                    : 1;	//     0
} H13A0_LED_HDR_DECON_EN;

/*-----------------------------------------------------------------------------
	0x06b4 led_hdr_decon_dif_gn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_decon_dif_gn                : 8;	//  0: 7
} H13A0_LED_HDR_DECON_DIF_GN;

/*-----------------------------------------------------------------------------
	0x06b8 led_hdr_dbg_disp_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_dbg_disp_en                 : 2;	//  0: 1
} H13A0_LED_HDR_DBG_DISP_EN;

/*-----------------------------------------------------------------------------
	0x06bc led_hdr_dbg_rgb_disp_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_dbg_rgb_disp_en             : 2;	//  0: 1
} H13A0_LED_HDR_DBG_RGB_DISP_EN;

/*-----------------------------------------------------------------------------
	0x06c0 led_hdr_bd_maxflt_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_bd_maxflt_en                : 1;	//     0
} H13A0_LED_HDR_BD_MAXFLT_EN;

/*-----------------------------------------------------------------------------
	0x06c4 led_hdr_ba_antihalo_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_ba_antihalo_en              : 1;	//     0
} H13A0_LED_HDR_BA_ANTIHALO_EN;

/*-----------------------------------------------------------------------------
	0x06c8 led_hdr_fc_addr_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_fc_addr_clr                 : 1;	//     0
} H13A0_LED_HDR_FC_ADDR_CLR;

/*-----------------------------------------------------------------------------
	0x06cc led_hdr_lk_lpf_hfc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_lpf_hfc_data             :10;	//  0: 9
} H13A0_LED_HDR_LK_LPF_HFC;

/*-----------------------------------------------------------------------------
	0x06d0 led_hdr_lk_lpf_vfc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_lpf_vfc_data             :10;	//  0: 9
} H13A0_LED_HDR_LK_LPF_VFC;

/*-----------------------------------------------------------------------------
	0x06d4 led_hdr_lk_wei_hfc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_hfc_data             :10;	//  0: 9
} H13A0_LED_HDR_LK_WEI_HFC;

/*-----------------------------------------------------------------------------
	0x06d8 led_hdr_lk_wei_vfc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_vfc_data             :10;	//  0: 9
} H13A0_LED_HDR_LK_WEI_VFC;

/*-----------------------------------------------------------------------------
	0x06dc led_hdr_lk_lpf_hfc_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_lpf_hfc_rd_sel           : 1;	//     0
} H13A0_LED_HDR_LK_LPF_HFC_RD_SEL;

/*-----------------------------------------------------------------------------
	0x06e0 led_hdr_lk_lpf_hfc_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_lpf_hfc_rdata            :10;	//  0: 9
} H13A0_LED_HDR_LK_LPF_HFC_RD;

/*-----------------------------------------------------------------------------
	0x06e4 led_hdr_lk_lpf_vfc_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_lpf_vfc_rd_sel           : 1;	//     0
} H13A0_LED_HDR_LK_LPF_VFC_RD_SEL;

/*-----------------------------------------------------------------------------
	0x06e8 led_hdr_lk_lpf_vfc_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_lpf_vfc_rdata            :10;	//  0: 9
} H13A0_LED_HDR_LK_LPF_VFC_RD;

/*-----------------------------------------------------------------------------
	0x06ec led_hdr_lk_wei_hfc_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_hfc_rd_sel           : 1;	//     0
} H13A0_LED_HDR_LK_WEI_HFC_RD_SEL;

/*-----------------------------------------------------------------------------
	0x06f0 led_hdr_lk_wei_hfc_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_hfc_rdata            :10;	//  0: 9
} H13A0_LED_HDR_LK_WEI_HFC_RD;

/*-----------------------------------------------------------------------------
	0x06f4 led_hdr_lk_wei_vfc_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_vfc_rd_sel           : 1;	//     0
} H13A0_LED_HDR_LK_WEI_VFC_RD_SEL;

/*-----------------------------------------------------------------------------
	0x06f8 led_hdr_lk_wei_vfc_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_lk_wei_vfc_rdata            :10;	//  0: 9
} H13A0_LED_HDR_LK_WEI_VFC_RD;

/*-----------------------------------------------------------------------------
	0x06fc led_hdr_blk_var_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_blk_var_th                  :10;	//  0: 9
} H13A0_LED_HDR_BLK_VAR_TH;

/*-----------------------------------------------------------------------------
	0x0700 led_hdr_bd_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hdr_bd_mode                     : 1;	//     0
} H13A0_LED_HDR_BD_MODE;

/*-----------------------------------------------------------------------------
	0x0740 led_wcg_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_en                          : 1;	//     0
} H13A0_LED_WCG_EN;

/*-----------------------------------------------------------------------------
	0x0744 led_wcg_dbg_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_bit_expansion               : 1,	//     0
	wcg_mismatch_check              : 1;	//     1
} H13A0_LED_WCG_DBG_EN;

/*-----------------------------------------------------------------------------
	0x0748 led_wcg_mem_wr_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_mem_wr_mode                 : 1;	//     0
} H13A0_LED_WCG_MEM_WR_MODE;

/*-----------------------------------------------------------------------------
	0x074c led_wcg_mem_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_mem_sel                     ;   	// 31: 0
} H13A0_LED_WCG_MEM_SEL;

/*-----------------------------------------------------------------------------
	0x0750 led_wcg_mem_waddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_waddr                       : 7;	//  0: 6
} H13A0_LED_WCG_MEM_WADDR;

/*-----------------------------------------------------------------------------
	0x0754 led_wcg_mem_wdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_mem_wdata                   :30;	//  0:29
} H13A0_LED_WCG_MEM_WDATA;

/*-----------------------------------------------------------------------------
	0x0758 led_wcg_mem_ren ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_ren                         ;   	// 31: 0
} H13A0_LED_WCG_MEM_REN;

/*-----------------------------------------------------------------------------
	0x075c led_wcg_mem_raddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_raddr                       : 7;	//  0: 6
} H13A0_LED_WCG_MEM_RADDR;

/*-----------------------------------------------------------------------------
	0x0760 led_wcg_mem_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_rdata                       :30;	//  0:29
} H13A0_LED_WCG_MEM_RDATA;

/*-----------------------------------------------------------------------------
	0x0764 led_wcg_miss_match_ind ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_mismatch_check              : 1;	//     0
} H13A0_LED_WCG_MISS_MATCH_IND;

/*-----------------------------------------------------------------------------
	0x0000 led_blu_blk_num_hv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_blu_if                      : 6,	//  0: 5
	                                :10,	//  6:15 reserved
	bnv_blu_if                      : 5;	// 16:20
} H13A0_LED_BLU_BLK_NUM_HV;

/*-----------------------------------------------------------------------------
	0x0004 led_vs_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	led_vs_mode_0                      : 2,	//  0: 1
	led_vs_mode_1                      : 1,	//     2
	led_vs_mode_2                      : 1;	//     3
} H13A0_LED_VS_MODE;

/*-----------------------------------------------------------------------------
	0x0008 led_blu_vs_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_vs_num                      : 3;	//  0: 2
} H13A0_LED_BLU_VS_NUM;

/*-----------------------------------------------------------------------------
	0x000c led_blu_vs_t0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_vs_t0                       :24;	//  0:23
} H13A0_LED_BLU_VS_T0;

/*-----------------------------------------------------------------------------
	0x0010 led_vs_dly ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vs_delay                        :24;	//  0:23
} H13A0_LED_VS_DLY;

/*-----------------------------------------------------------------------------
	0x0014 led_i2c_slave_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	i2c_slave_addr                  : 8;	//  0: 7
} H13A0_LED_I2C_SLAVE_ADDR;

/*-----------------------------------------------------------------------------
	0x0018 led_i2c_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	time_out                        : 8,	//  0: 7
	                                : 8,	//  8:15 reserved
	hold_scl                        : 8;	// 16:23
} H13A0_LED_I2C_CONF;

/*-----------------------------------------------------------------------------
	0x001c led_version ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	version                         ;   	// 31: 0
} H13A0_LED_VERSION;

/*-----------------------------------------------------------------------------
	0x0020 led_general_reg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	general_reg0                    ;   	// 31: 0
} H13A0_LED_GENERAL_REG0;

/*-----------------------------------------------------------------------------
	0x0024 led_general_reg1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	general_reg1                    ;   	// 31: 0
} H13A0_LED_GENERAL_REG1;

/*-----------------------------------------------------------------------------
	0x0028 led_general_reg2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	general_reg2                    ;   	// 31: 0
} H13A0_LED_GENERAL_REG2;

/*-----------------------------------------------------------------------------
	0x002c led_general_reg3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	general_reg3                    ;   	// 31: 0
} H13A0_LED_GENERAL_REG3;

/*-----------------------------------------------------------------------------
	0x0040 led_i2c_rd_on ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_i2c_rd_on                   : 1;	//     0
} H13A0_LED_I2C_RD_ON;

/*-----------------------------------------------------------------------------
	0x0044 led_i2c_rd_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_i2c_raddr                   :12;	//  0:11
} H13A0_LED_I2C_RD_ADDR;

/*-----------------------------------------------------------------------------
	0x0048 led_i2c_rd_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_i2c_rdata                   :10;	//  0: 9
} H13A0_LED_I2C_RD_DATA;

/*-----------------------------------------------------------------------------
	0x0080 led_spi_cfg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_cpha                        : 1,	//     0
	spi_cpol                        : 1,	//     1
	spi_16b                         : 1,	//     2
	spi_10b                         : 1;	//     3
} H13A0_LED_SPI_CFG0;

/*-----------------------------------------------------------------------------
	0x0084 led_spi_cmd_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_cmd_mod                     : 2;	//  0: 1
} H13A0_LED_SPI_CMD_MODE;

/*-----------------------------------------------------------------------------
	0x0088 led_m_spi_ch_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mask_ch3                        : 1,	//     0
	mask_ch2                        : 1,	//     1
	mask_ch1                        : 1,	//     2
	mask_ch0                        : 1;	//     3
} H13A0_LED_M_SPI_CH_MASK;

/*-----------------------------------------------------------------------------
	0x008c led_spi_idc01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_idc0                        :16,	//  0:15
	spi_idc1                        :16;	// 16:31
} H13A0_LED_SPI_IDC01;

/*-----------------------------------------------------------------------------
	0x0090 led_spi_idc23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_idc2                        :16,	//  0:15
	spi_idc3                        :16;	// 16:31
} H13A0_LED_SPI_IDC23;

/*-----------------------------------------------------------------------------
	0x0094 led_spi_cmd01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_cmd0                        :16,	//  0:15
	spi_cmd1                        :16;	// 16:31
} H13A0_LED_SPI_CMD01;

/*-----------------------------------------------------------------------------
	0x0098 led_spi_cmd23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_cmd2                        :16,	//  0:15
	spi_cmd3                        :16;	// 16:31
} H13A0_LED_SPI_CMD23;

/*-----------------------------------------------------------------------------
	0x009c led_sclk_t1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t1                         :16;	//  0:15
} H13A0_LED_SCLK_T1;

/*-----------------------------------------------------------------------------
	0x00a0 led_sclk_t2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t2                         :16;	//  0:15
} H13A0_LED_SCLK_T2;

/*-----------------------------------------------------------------------------
	0x00a4 led_sclk_t3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t3                         :16;	//  0:15
} H13A0_LED_SCLK_T3;

/*-----------------------------------------------------------------------------
	0x00a8 led_sclk_t4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t4                         :16;	//  0:15
} H13A0_LED_SCLK_T4;

/*-----------------------------------------------------------------------------
	0x00ac led_sclk_t5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t5                         :16;	//  0:15
} H13A0_LED_SCLK_T5;

/*-----------------------------------------------------------------------------
	0x00c0 led_blk_sp0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_sp0                         :11;	//  0:10
} H13A0_LED_BLK_SP0;

/*-----------------------------------------------------------------------------
	0x00c4 led_blk_sp1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_sp1                         :11;	//  0:10
} H13A0_LED_BLK_SP1;

/*-----------------------------------------------------------------------------
	0x00c8 led_blk_sp2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_sp2                         :11;	//  0:10
} H13A0_LED_BLK_SP2;

/*-----------------------------------------------------------------------------
	0x00cc led_blk_sp3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_sp3                         :11;	//  0:10
} H13A0_LED_BLK_SP3;

/*-----------------------------------------------------------------------------
	0x00d0 led_bnh_seg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_seg0                        : 6;	//  0: 5
} H13A0_LED_BNH_SEG0;

/*-----------------------------------------------------------------------------
	0x00d4 led_bnh_seg1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_seg1                        : 6;	//  0: 5
} H13A0_LED_BNH_SEG1;

/*-----------------------------------------------------------------------------
	0x00d8 led_bnh_seg2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_seg2                        : 6;	//  0: 5
} H13A0_LED_BNH_SEG2;

/*-----------------------------------------------------------------------------
	0x00dc led_bnh_seg3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_seg3                        : 6;	//  0: 5
} H13A0_LED_BNH_SEG3;

/*-----------------------------------------------------------------------------
	0x00e0 led_bnv_seg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnv_seg0                        : 5;	//  0: 4
} H13A0_LED_BNV_SEG0;

/*-----------------------------------------------------------------------------
	0x00e4 led_bnv_seg1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnv_seg1                        : 5;	//  0: 4
} H13A0_LED_BNV_SEG1;

/*-----------------------------------------------------------------------------
	0x00e8 led_bnv_seg2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnv_seg2                        : 5;	//  0: 4
} H13A0_LED_BNV_SEG2;

/*-----------------------------------------------------------------------------
	0x00ec led_bnv_seg3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnv_seg3                        : 5;	//  0: 4
} H13A0_LED_BNV_SEG3;

/*-----------------------------------------------------------------------------
	0x00f0 led_reverse ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lr_swap                         : 1,	//     0
	tb_swap                         : 1;	//     1
} H13A0_LED_REVERSE;

/*-----------------------------------------------------------------------------
	0x0100 led_pwm_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_value                       :10;	//  0: 9
} H13A0_LED_PWM_VALUE;

/*-----------------------------------------------------------------------------
	0x0104 led_scanning_status ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0140 led_ext_int_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_in_en                       ;   	// 31: 0
} H13A0_LED_EXT_INT_EN;

/*-----------------------------------------------------------------------------
	0x0144 led_ext_int_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_int_status                  ;   	// 31: 0
} H13A0_LED_EXT_INT_STATUS;

/*-----------------------------------------------------------------------------
	0x0148 led_ext_int_raw_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_int_raw_status              ;   	// 31: 0
} H13A0_LED_EXT_INT_RAW_STATUS;

/*-----------------------------------------------------------------------------
	0x014c led_ext_int_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_int_clr                     ;   	// 31: 0
} H13A0_LED_EXT_INT_CLR;

/*-----------------------------------------------------------------------------
	0x0150 led_ext_int_line_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	int_line_num                    :12;	//  0:11
} H13A0_LED_EXT_INT_LINE_NUM;

typedef struct {
	H13A0_LED_BV_GEN_HV_SIZE               	led_bv_gen_hv_size               ;	// 0x0000 : ''
	H13A0_LED_BV_GEN_BLK_NUM_HV            	led_bv_gen_blk_num_hv            ;	// 0x0004 : ''
	H13A0_LED_HV_RESOLUTION                	led_hv_resolution                ;	// 0x0008 : ''
	H13A0_LED_SYNC_POL                     	led_sync_pol                     ;	// 0x000c : ''
	H13A0_LED_VIN_CONFIG                   	led_vin_config                   ;	// 0x0010 : ''
	UINT32                          	                 __rsvd_02[  11];	// 0x0014 ~ 0x003c
	H13A0_LED_DBG_CTRL                     	led_dbg_ctrl                     ;	// 0x0040 : ''
	H13A0_LED_LUM                          	led_lum                          ;	// 0x0044 : ''
	H13A0_LED_BLU_I2C_WDATA                	led_blu_i2c_wdata                ;	// 0x0048 : ''
	H13A0_LED_SB_SEL                       	led_sb_sel                       ;	// 0x004c : ''
	H13A0_LED_SB_I2C                       	led_sb_i2c                       ;	// 0x0050 : ''
	H13A0_LED_BV_READ                      	led_bv_read                      ;	// 0x0054 : ''
	H13A0_LED_BV_WRITE                     	led_bv_write                     ;	// 0x0058 : ''
	H13A0_LED_BV_RW_STATUS                 	led_bv_rw_status                 ;	// 0x005c : ''
	H13A0_LED_DEBUG_DITHER                 	led_debug_dither                 ;	// 0x0060 : ''
	UINT32                          	                 __rsvd_03[   7];	// 0x0064 ~ 0x007c
	H13A0_LED_PAT_ON                       	led_pat_on                       ;	// 0x0080 : ''
	H13A0_LED_PAT_VAL                      	led_pat_val                      ;	// 0x0084 : ''
	H13A0_LED_PAT_H_MIN_MAX                	led_pat_h_min_max                ;	// 0x0088 : ''
	H13A0_LED_PAT_V_MIN_MAX                	led_pat_v_min_max                ;	// 0x008c : ''
	H13A0_LED_PAT_HV_PPF                   	led_pat_hv_ppf                   ;	// 0x0090 : ''
	H13A0_LED_PAT_VAL_R                    	led_pat_val_r                    ;	// 0x0094 : ''
	H13A0_LED_PAT_H_MIN_MAX_R              	led_pat_h_min_max_r              ;	// 0x0098 : ''
	H13A0_LED_PAT_V_MIN_MAX_R              	led_pat_v_min_max_r              ;	// 0x009c : ''
	UINT32                          	                 __rsvd_04[   8];	// 0x00a0 ~ 0x00bc
	H13A0_LED_IWB_R_GAIN                   	led_iwb_r_gain                   ;	// 0x00c0 : ''
	H13A0_LED_IWB_G_GAIN                   	led_iwb_g_gain                   ;	// 0x00c4 : ''
	H13A0_LED_IWB_B_GAIN                   	led_iwb_b_gain                   ;	// 0x00c8 : ''
	UINT32                          	                 __rsvd_05[  45];	// 0x00cc ~ 0x017c
	H13A0_LED_MAX_OPT                      	led_max_opt                      ;	// 0x0180 : ''
	H13A0_LED_BLK_MAX_MODE                 	led_blk_max_mode                 ;	// 0x0184 : ''
	H13A0_LED_MAX_OPT_MODE                 	led_max_opt_mode                 ;	// 0x0188 : ''
	H13A0_LED_MAX_OPT0_1                   	led_max_opt0_1                   ;	// 0x018c : ''
	H13A0_LED_LEVEL_TH                     	led_level_th                     ;	// 0x0190 : ''
	H13A0_LED_NUMBER_TH                    	led_number_th                    ;	// 0x0194 : ''
	H13A0_LED_APL                          	led_apl                          ;	// 0x0198 : ''
	H13A0_LED_BV_GEN_X1_X2                 	led_bv_gen_x1_x2                 ;	// 0x019c : ''
	H13A0_LED_BV_GEN_X3_X4                 	led_bv_gen_x3_x4                 ;	// 0x01a0 : ''
	H13A0_LED_BV_GEN_Y0_Y1                 	led_bv_gen_y0_y1                 ;	// 0x01a4 : ''
	H13A0_LED_BV_GEN_Y2_Y3                 	led_bv_gen_y2_y3                 ;	// 0x01a8 : ''
	H13A0_LED_BV_GEN_Y4_Y5                 	led_bv_gen_y4_y5                 ;	// 0x01ac : ''
	UINT32                          	                 __rsvd_06[   4];	// 0x01b0 ~ 0x01bc
	H13A0_LED_BV_RCTRL_MODE                	led_bv_rctrl_mode                ;	// 0x01c0 : ''
	H13A0_LED_PIC_ATTR                     	led_pic_attr                     ;	// 0x01c4 : ''
	H13A0_LED_LR_SYNC_SEL                  	led_lr_sync_sel                  ;	// 0x01c8 : ''
	UINT32                          	                 __rsvd_07[  13];	// 0x01cc ~ 0x01fc
	H13A0_LED_SC_MAG_GN_TH                 	led_sc_mag_gn_th                 ;	// 0x0200 : ''
	H13A0_LED_SC_MAG_INFO                  	led_sc_mag_info                  ;	// 0x0204 : ''
	UINT32                          	                 __rsvd_08[  14];	// 0x0208 ~ 0x023c
	H13A0_LED_LUT_MODE                     	led_lut_mode                     ;	// 0x0240 : ''
	H13A0_LED_EX_ABV                       	led_ex_abv                       ;	// 0x0244 : ''
	H13A0_LED_SG_L_H                       	led_sg_l_h                       ;	// 0x0248 : ''
	H13A0_LED_DC_LUT_RADDR                 	led_dc_lut_raddr                 ;	// 0x024c : ''
	H13A0_LED_DC_LUT_RDATA                 	led_dc_lut_rdata                 ;	// 0x0250 : ''
	H13A0_LED_BV_GAIN                      	led_bv_gain                      ;	// 0x0254 : ''
	H13A0_LED_LUT_AVG_SEL                  	led_lut_avg_sel                  ;	// 0x0258 : ''
	UINT32                          	                 __rsvd_09[   9];	// 0x025c ~ 0x027c
	H13A0_LED_LSF_UM_EN                    	led_lsf_um_en                    ;	// 0x0280 : ''
	H13A0_LED_LSF_5X5                      	led_lsf_5x5                      ;	// 0x0284 : ''
	H13A0_LED_LSF_COARING                  	led_lsf_coaring                  ;	// 0x0288 : ''
	H13A0_LED_LSF_GAIN                     	led_lsf_gain                     ;	// 0x028c : ''
	H13A0_LED_LSF_WR_COEFF                 	led_lsf_wr_coeff                 ;	// 0x0290 : ''
	H13A0_LED_LSF_RD_COEFF                 	led_lsf_rd_coeff                 ;	// 0x0294 : ''
	UINT32                          	                 __rsvd_10[  10];	// 0x0298 ~ 0x02bc
	H13A0_LED_T_SF                         	led_t_sf                         ;	// 0x02c0 : ''
	H13A0_LED_KMODE                        	led_kmode                        ;	// 0x02c4 : ''
	H13A0_LED_HVKMASK                      	led_hvkmask                      ;	// 0x02c8 : ''
	UINT32                          	                 __rsvd_11[  13];	// 0x02cc ~ 0x02fc
	H13A0_LED_TF_OPMODE                    	led_tf_opmode                    ;	// 0x0300 : ''
	H13A0_LED_A_PARA                       	led_a_para                       ;	// 0x0304 : ''
	H13A0_LED_SC_ADJ_EN                    	led_sc_adj_en                    ;	// 0x0308 : ''
	H13A0_LED_MD_ADJ_EN                    	led_md_adj_en                    ;	// 0x030c : ''
	H13A0_LED_MD_X1                        	led_md_x1                        ;	// 0x0310 : ''
	H13A0_LED_MD_X2                        	led_md_x2                        ;	// 0x0314 : ''
	H13A0_LED_MD_X3                        	led_md_x3                        ;	// 0x0318 : ''
	H13A0_LED_MD_X4                        	led_md_x4                        ;	// 0x031c : ''
	H13A0_LED_MD_Y0                        	led_md_y0                        ;	// 0x0320 : ''
	H13A0_LED_MD_Y1                        	led_md_y1                        ;	// 0x0324 : ''
	H13A0_LED_MD_Y2                        	led_md_y2                        ;	// 0x0328 : ''
	H13A0_LED_MD_Y3                        	led_md_y3                        ;	// 0x032c : ''
	H13A0_LED_MD_Y4                        	led_md_y4                        ;	// 0x0330 : ''
	H13A0_LED_MD_Y5                        	led_md_y5                        ;	// 0x0334 : ''
	UINT32                          	                 __rsvd_12[   2];	// 0x0338 ~ 0x033c
	H13A0_LED_LED_MODE                     	led_led_mode                     ;	// 0x0340 : ''
	H13A0_LED_LRES_BNH_BNV                 	led_lres_bnh_bnv                 ;	// 0x0344 : ''
	H13A0_LED_LRES_BSH_BSV                 	led_lres_bsh_bsv                 ;	// 0x0348 : ''
	H13A0_LED_SBI_BNH_BNV                  	led_sbi_bnh_bnv                  ;	// 0x034c : ''
	H13A0_LED_SBI_BSH_BSV                  	led_sbi_bsh_bsv                  ;	// 0x0350 : ''
	H13A0_LED_TAB1_RD_SEL                  	led_tab1_rd_sel                  ;	// 0x0354 : ''
	H13A0_LED_TAB1_RDATA                   	led_tab1_rdata                   ;	// 0x0358 : ''
	H13A0_LED_TAB5_RD_SEL                  	led_tab5_rd_sel                  ;	// 0x035c : ''
	H13A0_LED_TAB5_RDATA                   	led_tab5_rdata                   ;	// 0x0360 : ''
	H13A0_LED_HFC_RD_SEL                   	led_hfc_rd_sel                   ;	// 0x0364 : ''
	H13A0_LED_HFC_RDATA                    	led_hfc_rdata                    ;	// 0x0368 : ''
	H13A0_LED_VFC_RD_SEL                   	led_vfc_rd_sel                   ;	// 0x036c : ''
	H13A0_LED_VFC_RDATA                    	led_vfc_rdata                    ;	// 0x0370 : ''
	UINT32                          	                 __rsvd_13[   3];	// 0x0374 ~ 0x037c
	H13A0_LED_COMP_EN                      	led_comp_en                      ;	// 0x0380 : ''
	H13A0_LED_CONT_GAIN                    	led_cont_gain                    ;	// 0x0384 : ''
	H13A0_LED_COMP_IN                      	led_comp_in                      ;	// 0x0388 : ''
	H13A0_LED_PC_RADDR                     	led_pc_raddr                     ;	// 0x038c : ''
	H13A0_LED_PC_RDATA                     	led_pc_rdata                     ;	// 0x0390 : ''
	UINT32                          	                 __rsvd_14[  27];	// 0x0394 ~ 0x03fc
	H13A0_LED_GBL                          	led_gbl                          ;	// 0x0400 : ''
	H13A0_LED_ABV_CMP_VALUE                	led_abv_cmp_value                ;	// 0x0404 : ''
	H13A0_LED_BV_DLY                       	led_bv_dly                       ;	// 0x0408 : ''
	H13A0_LED_BLU_BV_SEL                   	led_blu_bv_sel                   ;	// 0x040c : ''
	UINT32                          	                 __rsvd_15[  12];	// 0x0410 ~ 0x043c
	H13A0_LED_INSTR_WR_REQ                 	led_instr_wr_req                 ;	// 0x0440 : ''
	H13A0_LED_INSTR_WDATA                  	led_instr_wdata                  ;	// 0x0444 : ''
	H13A0_LED_INSTR_RDATA                  	led_instr_rdata                  ;	// 0x0448 : ''
	H13A0_LED_INSTR_DGB                    	led_instr_dgb                    ;	// 0x044c : ''
	UINT32                          	                 __rsvd_16[  12];	// 0x0450 ~ 0x047c
	H13A0_LED_BLC_MODE                     	led_blc_mode                     ;	// 0x0480 : ''
	H13A0_LED_BSF_C0                       	led_bsf_c0                       ;	// 0x0484 : ''
	H13A0_LED_BSF_C1                       	led_bsf_c1                       ;	// 0x0488 : ''
	H13A0_LED_BSF_C2                       	led_bsf_c2                       ;	// 0x048c : ''
	H13A0_LED_BSF_RATIO0                   	led_bsf_ratio0                   ;	// 0x0490 : ''
	H13A0_LED_BSF_RATIO1                   	led_bsf_ratio1                   ;	// 0x0494 : ''
	H13A0_LED_BSF_RATIO2                   	led_bsf_ratio2                   ;	// 0x0498 : ''
	H13A0_LED_A0_GN                        	led_a0_gn                        ;	// 0x049c : ''
	H13A0_LED_A1_GN                        	led_a1_gn                        ;	// 0x04a0 : ''
	H13A0_LED_A2_GN                        	led_a2_gn                        ;	// 0x04a4 : ''
	H13A0_LED_A0_RATIO                     	led_a0_ratio                     ;	// 0x04a8 : ''
	H13A0_LED_A1_RATIO                     	led_a1_ratio                     ;	// 0x04ac : ''
	H13A0_LED_DRV_MAX                      	led_drv_max                      ;	// 0x04b0 : ''
	UINT32                          	                 __rsvd_17[   3];	// 0x04b4 ~ 0x04bc
	H13A0_LED_MEM_ADDR_CLR                 	led_mem_addr_clr                 ;	// 0x04c0 : ''
	H13A0_LED_MEM_DL_SBI_HCOEFF            	led_mem_dl_sbi_hcoeff            ;	// 0x04c4 : ''
	H13A0_LED_MEM_DL_SBI_VCOEFF            	led_mem_dl_sbi_vcoeff            ;	// 0x04c8 : ''
	H13A0_LED_MEM_DL_PIXEL_COMP_A          	led_mem_dl_pixel_comp_a          ;	// 0x04cc : ''
	H13A0_LED_MEM_DL_PIXEL_COMP_B          	led_mem_dl_pixel_comp_b          ;	// 0x04d0 : ''
	H13A0_LED_MEM_DL_PIXEL_COMP_C          	led_mem_dl_pixel_comp_c          ;	// 0x04d4 : ''
	H13A0_LED_MEM_DL_PIXEL_COMP_D          	led_mem_dl_pixel_comp_d          ;	// 0x04d8 : ''
	H13A0_LED_UPPER_DC_LUT                 	led_upper_dc_lut                 ;	// 0x04dc : ''
	H13A0_LED_LOWER_DC_LUT                 	led_lower_dc_lut                 ;	// 0x04e0 : ''
	H13A0_LED_FC_TAB1                      	led_fc_tab1                      ;	// 0x04e4 : ''
	H13A0_LED_FC_TAB5                      	led_fc_tab5                      ;	// 0x04e8 : ''
	UINT32                          	                 __rsvd_18[   5];	// 0x04ec ~ 0x04fc
	H13A0_LED_MEAN_IN_SEL                  	led_mean_in_sel                  ;	// 0x0500 : ''
	H13A0_LED_MEAN                         	led_mean                         ;	// 0x0504 : ''
	UINT32                          	                 __rsvd_19[  14];	// 0x0508 ~ 0x053c
	H13A0_LED_RP_HV_POS                    	led_rp_hv_pos                    ;	// 0x0540 : ''
	H13A0_LED_RP_MAKE_EN                   	led_rp_make_en                   ;	// 0x0544 : ''
	H13A0_LED_RP_R_VALUE                   	led_rp_r_value                   ;	// 0x0548 : ''
	H13A0_LED_RP_G_VALUE                   	led_rp_g_value                   ;	// 0x054c : ''
	H13A0_LED_RP_B_VALUE                   	led_rp_b_value                   ;	// 0x0550 : ''
	UINT32                          	                 __rsvd_20[  11];	// 0x0554 ~ 0x057c
	H13A0_LED_DISP_BV_EN                   	led_disp_bv_en                   ;	// 0x0580 : ''
	H13A0_LED_DSIP_BV_ADDR                 	led_dsip_bv_addr                 ;	// 0x0584 : ''
	UINT32                          	                 __rsvd_21[  14];	// 0x0588 ~ 0x05bc
	H13A0_LED_DITHER_EN                    	led_dither_en                    ;	// 0x05c0 : ''
	H13A0_LED_DITHER_LOAD                  	led_dither_load                  ;	// 0x05c4 : ''
	H13A0_LED_DITHER_PAT_00_U              	led_dither_pat_00_u              ;	// 0x05c8 : ''
	H13A0_LED_DITHER_PAT_00_L              	led_dither_pat_00_l              ;	// 0x05cc : ''
	H13A0_LED_DITHER_PAT_01_U              	led_dither_pat_01_u              ;	// 0x05d0 : ''
	H13A0_LED_DITHER_PAT_01_L              	led_dither_pat_01_l              ;	// 0x05d4 : ''
	H13A0_LED_DITHER_PAT_02_U              	led_dither_pat_02_u              ;	// 0x05d8 : ''
	H13A0_LED_DITHER_PAT_02_L              	led_dither_pat_02_l              ;	// 0x05dc : ''
	H13A0_LED_DITHER_PAT_03_U              	led_dither_pat_03_u              ;	// 0x05e0 : ''
	H13A0_LED_DITHER_PAT_03_L              	led_dither_pat_03_l              ;	// 0x05e4 : ''
	H13A0_LED_DITHER_PAT_04_U              	led_dither_pat_04_u              ;	// 0x05e8 : ''
	H13A0_LED_DITHER_PAT_04_L              	led_dither_pat_04_l              ;	// 0x05ec : ''
	H13A0_LED_DITHER_PAT_05_U              	led_dither_pat_05_u              ;	// 0x05f0 : ''
	H13A0_LED_DITHER_PAT_05_L              	led_dither_pat_05_l              ;	// 0x05f4 : ''
	H13A0_LED_DITHER_PAT_06_U              	led_dither_pat_06_u              ;	// 0x05f8 : ''
	H13A0_LED_DITHER_PAT_06_L              	led_dither_pat_06_l              ;	// 0x05fc : ''
	H13A0_LED_DITHER_PAT_07_U              	led_dither_pat_07_u              ;	// 0x0600 : ''
	H13A0_LED_DITHER_PAT_07_L              	led_dither_pat_07_l              ;	// 0x0604 : ''
	H13A0_LED_DITHER_PAT_08_U              	led_dither_pat_08_u              ;	// 0x0608 : ''
	H13A0_LED_DITHER_PAT_08_L              	led_dither_pat_08_l              ;	// 0x060c : ''
	H13A0_LED_DITHER_PAT_09_U              	led_dither_pat_09_u              ;	// 0x0610 : ''
	H13A0_LED_DITHER_PAT_09_L              	led_dither_pat_09_l              ;	// 0x0614 : ''
	H13A0_LED_DITHER_PAT_10_U              	led_dither_pat_10_u              ;	// 0x0618 : ''
	H13A0_LED_DITHER_PAT_10_L              	led_dither_pat_10_l              ;	// 0x061c : ''
	H13A0_LED_DITHER_PAT_11_U              	led_dither_pat_11_u              ;	// 0x0620 : ''
	H13A0_LED_DITHER_PAT_11_L              	led_dither_pat_11_l              ;	// 0x0624 : ''
	H13A0_LED_DITHER_PAT_12_U              	led_dither_pat_12_u              ;	// 0x0628 : ''
	H13A0_LED_DITHER_PAT_12_L              	led_dither_pat_12_l              ;	// 0x062c : ''
	H13A0_LED_DITHER_PAT_13_U              	led_dither_pat_13_u              ;	// 0x0630 : ''
	H13A0_LED_DITHER_PAT_13_L              	led_dither_pat_13_l              ;	// 0x0634 : ''
	H13A0_LED_DITHER_PAT_14_U              	led_dither_pat_14_u              ;	// 0x0638 : ''
	H13A0_LED_DITHER_PAT_14_L              	led_dither_pat_14_l              ;	// 0x063c : ''
	H13A0_LED_DITHER_PAT_15_U              	led_dither_pat_15_u              ;	// 0x0640 : ''
	H13A0_LED_DITHER_PAT_15_L              	led_dither_pat_15_l              ;	// 0x0644 : ''
	H13A0_LED_FRAME0_PAT_R                 	led_frame0_pat_r                 ;	// 0x0648 : ''
	H13A0_LED_FRAME0_PAT_G                 	led_frame0_pat_g                 ;	// 0x064c : ''
	H13A0_LED_FRAME0_PAT_B                 	led_frame0_pat_b                 ;	// 0x0650 : ''
	H13A0_LED_FRAME1_PAT_R                 	led_frame1_pat_r                 ;	// 0x0654 : ''
	H13A0_LED_FRAME1_PAT_G                 	led_frame1_pat_g                 ;	// 0x0658 : ''
	H13A0_LED_FRAME1_PAT_B                 	led_frame1_pat_b                 ;	// 0x065c : ''
	H13A0_LED_FRAME2_PAT_R                 	led_frame2_pat_r                 ;	// 0x0660 : ''
	H13A0_LED_FRAME2_PAT_G                 	led_frame2_pat_g                 ;	// 0x0664 : ''
	H13A0_LED_FRAME2_PAT_B                 	led_frame2_pat_b                 ;	// 0x0668 : ''
	H13A0_LED_FRAME3_PAT_R                 	led_frame3_pat_r                 ;	// 0x066c : ''
	H13A0_LED_FRAME3_PAT_G                 	led_frame3_pat_g                 ;	// 0x0670 : ''
	H13A0_LED_FRAME3_PAT_B                 	led_frame3_pat_b                 ;	// 0x0674 : ''
	UINT32                          	                 __rsvd_22[   2];	// 0x0678 ~ 0x067c
	H13A0_LED_HDR_BSV_BSH                  	led_hdr_bsv_bsh                  ;	// 0x0680 : ''
	H13A0_LED_HDR_BNV_BNH                  	led_hdr_bnv_bnh                  ;	// 0x0684 : ''
	H13A0_LED_HDR_BLK_DIF_TH               	led_hdr_blk_dif_th               ;	// 0x0688 : ''
	H13A0_LED_HDR_BLK_NUM_TH               	led_hdr_blk_num_th               ;	// 0x068c : ''
	H13A0_LED_HDR_BD_TH                    	led_hdr_bd_th                    ;	// 0x0690 : ''
	H13A0_LED_HDR_LK_LPF_APF               	led_hdr_lk_lpf_apf               ;	// 0x0694 : ''
	H13A0_LED_HDR_LK_WEI_APF               	led_hdr_lk_wei_apf               ;	// 0x0698 : ''
	H13A0_LED_HDR_LK_WEI_GN                	led_hdr_lk_wei_gn                ;	// 0x069c : ''
	H13A0_LED_HDR_LK_WEI_MODE              	led_hdr_lk_wei_mode              ;	// 0x06a0 : ''
	H13A0_LED_HDR_SK_FLT_TH                	led_hdr_sk_flt_th                ;	// 0x06a4 : ''
	H13A0_LED_HDR_SK_DIF_TH                	led_hdr_sk_dif_th                ;	// 0x06a8 : ''
	H13A0_LED_HDR_LPF_MODE                 	led_hdr_lpf_mode                 ;	// 0x06ac : ''
	H13A0_LED_HDR_DECON_EN                 	led_hdr_decon_en                 ;	// 0x06b0 : ''
	H13A0_LED_HDR_DECON_DIF_GN             	led_hdr_decon_dif_gn             ;	// 0x06b4 : ''
	H13A0_LED_HDR_DBG_DISP_EN              	led_hdr_dbg_disp_en              ;	// 0x06b8 : ''
	H13A0_LED_HDR_DBG_RGB_DISP_EN          	led_hdr_dbg_rgb_disp_en          ;	// 0x06bc : ''
	H13A0_LED_HDR_BD_MAXFLT_EN             	led_hdr_bd_maxflt_en             ;	// 0x06c0 : ''
	H13A0_LED_HDR_BA_ANTIHALO_EN           	led_hdr_ba_antihalo_en           ;	// 0x06c4 : ''
	H13A0_LED_HDR_FC_ADDR_CLR              	led_hdr_fc_addr_clr              ;	// 0x06c8 : ''
	H13A0_LED_HDR_LK_LPF_HFC               	led_hdr_lk_lpf_hfc               ;	// 0x06cc : ''
	H13A0_LED_HDR_LK_LPF_VFC               	led_hdr_lk_lpf_vfc               ;	// 0x06d0 : ''
	H13A0_LED_HDR_LK_WEI_HFC               	led_hdr_lk_wei_hfc               ;	// 0x06d4 : ''
	H13A0_LED_HDR_LK_WEI_VFC               	led_hdr_lk_wei_vfc               ;	// 0x06d8 : ''
	H13A0_LED_HDR_LK_LPF_HFC_RD_SEL        	led_hdr_lk_lpf_hfc_rd_sel        ;	// 0x06dc : ''
	H13A0_LED_HDR_LK_LPF_HFC_RD            	led_hdr_lk_lpf_hfc_rd            ;	// 0x06e0 : ''
	H13A0_LED_HDR_LK_LPF_VFC_RD_SEL        	led_hdr_lk_lpf_vfc_rd_sel        ;	// 0x06e4 : ''
	H13A0_LED_HDR_LK_LPF_VFC_RD            	led_hdr_lk_lpf_vfc_rd            ;	// 0x06e8 : ''
	H13A0_LED_HDR_LK_WEI_HFC_RD_SEL        	led_hdr_lk_wei_hfc_rd_sel        ;	// 0x06ec : ''
	H13A0_LED_HDR_LK_WEI_HFC_RD            	led_hdr_lk_wei_hfc_rd            ;	// 0x06f0 : ''
	H13A0_LED_HDR_LK_WEI_VFC_RD_SEL        	led_hdr_lk_wei_vfc_rd_sel        ;	// 0x06f4 : ''
	H13A0_LED_HDR_LK_WEI_VFC_RD            	led_hdr_lk_wei_vfc_rd            ;	// 0x06f8 : ''
	H13A0_LED_HDR_BLK_VAR_TH               	led_hdr_blk_var_th               ;	// 0x06fc : ''
	H13A0_LED_HDR_BD_MODE                  	led_hdr_bd_mode                  ;	// 0x0700 : ''
	UINT32                          	                 __rsvd_23[  15];	// 0x0704 ~ 0x073c
	H13A0_LED_WCG_EN                       	led_wcg_en                       ;	// 0x0740 : ''
	H13A0_LED_WCG_DBG_EN                   	led_wcg_dbg_en                   ;	// 0x0744 : ''
	H13A0_LED_WCG_MEM_WR_MODE              	led_wcg_mem_wr_mode              ;	// 0x0748 : ''
	H13A0_LED_WCG_MEM_SEL                  	led_wcg_mem_sel                  ;	// 0x074c : ''
	H13A0_LED_WCG_MEM_WADDR                	led_wcg_mem_waddr                ;	// 0x0750 : ''
	H13A0_LED_WCG_MEM_WDATA                	led_wcg_mem_wdata                ;	// 0x0754 : ''
	H13A0_LED_WCG_MEM_REN                  	led_wcg_mem_ren                  ;	// 0x0758 : ''
	H13A0_LED_WCG_MEM_RADDR                	led_wcg_mem_raddr                ;	// 0x075c : ''
	H13A0_LED_WCG_MEM_RDATA                	led_wcg_mem_rdata                ;	// 0x0760 : ''
	H13A0_LED_WCG_MISS_MATCH_IND           	led_wcg_miss_match_ind           ;	// 0x0764 : ''
	UINT32                                                   __rsvd_24[1575];       // 0x0765 ~ 0x1FFC
	H13A0_LED_BLU_BLK_NUM_HV               	led_blu_blk_num_hv               ;	// 0x0000 : ''
	H13A0_LED_VS_MODE                      	led_vs_mode                      ;	// 0x0004 : ''
	H13A0_LED_BLU_VS_NUM                   	led_blu_vs_num                   ;	// 0x0008 : ''
	H13A0_LED_BLU_VS_T0                    	led_blu_vs_t0                    ;	// 0x000c : ''
	H13A0_LED_VS_DLY                       	led_vs_dly                       ;	// 0x0010 : ''
	H13A0_LED_I2C_SLAVE_ADDR               	led_i2c_slave_addr               ;	// 0x0014 : ''
	H13A0_LED_I2C_CONF                     	led_i2c_conf                     ;	// 0x0018 : ''
	H13A0_LED_VERSION                      	led_version                      ;	// 0x001c : ''
	H13A0_LED_GENERAL_REG0                 	led_general_reg0                 ;	// 0x0020 : ''
	H13A0_LED_GENERAL_REG1                 	led_general_reg1                 ;	// 0x0024 : ''
	H13A0_LED_GENERAL_REG2                 	led_general_reg2                 ;	// 0x0028 : ''
	H13A0_LED_GENERAL_REG3                 	led_general_reg3                 ;	// 0x002c : ''
	UINT32                          	                 __rsvd_25[   4];	// 0x0030 ~ 0x003c
	H13A0_LED_I2C_RD_ON                    	led_i2c_rd_on                    ;	// 0x0040 : ''
	H13A0_LED_I2C_RD_ADDR                  	led_i2c_rd_addr                  ;	// 0x0044 : ''
	H13A0_LED_I2C_RD_DATA                  	led_i2c_rd_data                  ;	// 0x0048 : ''
	UINT32                          	                 __rsvd_26[  13];	// 0x004c ~ 0x007c
	H13A0_LED_SPI_CFG0                     	led_spi_cfg0                     ;	// 0x0080 : ''
	H13A0_LED_SPI_CMD_MODE                 	led_spi_cmd_mode                 ;	// 0x0084 : ''
	H13A0_LED_M_SPI_CH_MASK                	led_m_spi_ch_mask                ;	// 0x0088 : ''
	H13A0_LED_SPI_IDC01                    	led_spi_idc01                    ;	// 0x008c : ''
	H13A0_LED_SPI_IDC23                    	led_spi_idc23                    ;	// 0x0090 : ''
	H13A0_LED_SPI_CMD01                    	led_spi_cmd01                    ;	// 0x0094 : ''
	H13A0_LED_SPI_CMD23                    	led_spi_cmd23                    ;	// 0x0098 : ''
	H13A0_LED_SCLK_T1                      	led_sclk_t1                      ;	// 0x009c : ''
	H13A0_LED_SCLK_T2                      	led_sclk_t2                      ;	// 0x00a0 : ''
	H13A0_LED_SCLK_T3                      	led_sclk_t3                      ;	// 0x00a4 : ''
	H13A0_LED_SCLK_T4                      	led_sclk_t4                      ;	// 0x00a8 : ''
	H13A0_LED_SCLK_T5                      	led_sclk_t5                      ;	// 0x00ac : ''
	UINT32                          	                 __rsvd_27[   4];	// 0x00b0 ~ 0x00bc
	H13A0_LED_BLK_SP0                      	led_blk_sp0                      ;	// 0x00c0 : ''
	H13A0_LED_BLK_SP1                      	led_blk_sp1                      ;	// 0x00c4 : ''
	H13A0_LED_BLK_SP2                      	led_blk_sp2                      ;	// 0x00c8 : ''
	H13A0_LED_BLK_SP3                      	led_blk_sp3                      ;	// 0x00cc : ''
	H13A0_LED_BNH_SEG0                     	led_bnh_seg0                     ;	// 0x00d0 : ''
	H13A0_LED_BNH_SEG1                     	led_bnh_seg1                     ;	// 0x00d4 : ''
	H13A0_LED_BNH_SEG2                     	led_bnh_seg2                     ;	// 0x00d8 : ''
	H13A0_LED_BNH_SEG3                     	led_bnh_seg3                     ;	// 0x00dc : ''
	H13A0_LED_BNV_SEG0                     	led_bnv_seg0                     ;	// 0x00e0 : ''
	H13A0_LED_BNV_SEG1                     	led_bnv_seg1                     ;	// 0x00e4 : ''
	H13A0_LED_BNV_SEG2                     	led_bnv_seg2                     ;	// 0x00e8 : ''
	H13A0_LED_BNV_SEG3                     	led_bnv_seg3                     ;	// 0x00ec : ''
	H13A0_LED_REVERSE                      	led_reverse                      ;	// 0x00f0 : ''
	UINT32                          	                 __rsvd_28[   3];	// 0x00f4 ~ 0x00fc
	H13A0_LED_PWM_VALUE                    	led_pwm_value                    ;	// 0x0100 : ''
	UINT32                          	led_scanning_status              ;	// 0x0104 : ''
	UINT32                          	                 __rsvd_29[  14];	// 0x0108 ~ 0x013c
	H13A0_LED_EXT_INT_EN                   	led_ext_int_en                   ;	// 0x0140 : ''
	H13A0_LED_EXT_INT_STATUS               	led_ext_int_status               ;	// 0x0144 : ''
	H13A0_LED_EXT_INT_RAW_STATUS           	led_ext_int_raw_status           ;	// 0x0148 : ''
	H13A0_LED_EXT_INT_CLR                  	led_ext_int_clr                  ;	// 0x014c : ''
	H13A0_LED_EXT_INT_LINE_NUM             	led_ext_int_line_num             ;	// 0x0150 : ''
} DPPB_LED_REG_H13A0_T;

#endif //#ifndef _REG_DPPB_H13A0_h
