/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
	GNU General Public License for more details.
*/

#ifndef _REG_DPPB_M14B0_h
#define _REG_DPPB_M14B0_h

/*
	DPPB LED
*/

/*-----------------------------------------------------------------------------
	0x0000 led_bv_gen_hv_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsh_bv_gen				:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	bsv_bv_gen				:12;	// 16:27
} M14B0_LED_BV_GEN_HV_SIZE;

/*-----------------------------------------------------------------------------
	0x0004 led_bv_gen_blk_num_hv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_bv_gen				: 6,	//  0: 5
	 _rsvd					:10,	//  6:15 reserved
	bnv_bv_gen				: 5;	// 16:20
} M14B0_LED_BV_GEN_BLK_NUM_HV;

/*-----------------------------------------------------------------------------
	0x0008 led_hv_resolution ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hres					:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	vres					:12;	// 16:27
} M14B0_LED_HV_RESOLUTION;

/*-----------------------------------------------------------------------------
	0x000c led_sync_pol ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vs_out_neg				: 1,	//     0
	hs_out_neg				: 1,	//     1
	vs_in_neg				: 1,	//     2
	hs_in_neg				: 1;	//     3
} M14B0_LED_SYNC_POL;

/*-----------------------------------------------------------------------------
	0x0014 led_led_dly ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	led_dly					: 3;	//  0: 2
} M14B0_LED_DLY;

/*-----------------------------------------------------------------------------
	0x0018 led_monitor_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	monitor_sel				: 1;	//     0
} M14B0_LED_MONITOR_SEL;

/*-----------------------------------------------------------------------------
	0x001c led_dpath_order ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	func_dpath_order		: 1;	//     0
} M14B0_LED_DPATH_ORDER;

/*-----------------------------------------------------------------------------
	0x0040 led_dbg_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pbl_mode				: 2,	//  0: 1
	apf						: 1,	//     2
	sbi2rgb					: 1,	//     3
	sbi_dis					: 1,	//     4
	mark_en				: 1,	//     5
	apf_lres					: 1;	//     6
} M14B0_LED_DBG_CTRL;

/*-----------------------------------------------------------------------------
	0x0044 led_lum ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lum						:10;	//  0: 9
} M14B0_LED_LUM;

/*-----------------------------------------------------------------------------
	0x0048 led_blu_i2c_wdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_i2c_wdata			:10,	//  0: 9
	_rsvd_00				: 6,	// 10:15 reserved
	blu_i2c_waddr			:11,	// 16:26
	_rsvd_01				: 4,	// 27:30 reserved
	blu_i2c_we				: 1;	//    31
} M14B0_LED_BLU_I2C_WDATA;

/*-----------------------------------------------------------------------------
	0x004c led_sb_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_sel					: 1;	//     0
} M14B0_LED_SB_SEL;

/*-----------------------------------------------------------------------------
	0x0050 led_sb_i2c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_i2c					:10;	//  0: 9
} M14B0_LED_SB_I2C;

/*-----------------------------------------------------------------------------
	0x0054 led_bv_read ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_rdata				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_raddr				:11;	// 16:26
} M14B0_LED_BV_READ;

/*-----------------------------------------------------------------------------
	0x0058 led_bv_write ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_wdata				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_waddr				:11;	// 16:26
} M14B0_LED_BV_WRITE;

/*-----------------------------------------------------------------------------
	0x005c led_bv_rw_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_rw_done				: 1;	//     0
} M14B0_LED_BV_RW_STATUS;

/*-----------------------------------------------------------------------------
	0x0080 led_pat_on ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rectangular				: 1,	//     0
	grid						: 1,	//     1
	gradation_r				: 1,	//     2
	gradation_g				: 1,	//     3
	gradation_b				: 1,	//     4
	color_bar				: 1,	//     5
	_rsvd					: 2,	//  6: 7 reserved
	gray_image				: 1;	//     8
} M14B0_LED_PAT_ON;

/*-----------------------------------------------------------------------------
	0x0084 led_pat_val ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	b_value					:10,	//  0: 9
	g_value					:10,	// 10:19
	r_value					:10;	// 20:29
} M14B0_LED_PAT_VAL;

/*-----------------------------------------------------------------------------
	0x0088 led_pat_h_min_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	h_min					:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	h_max					:12;	// 16:27
} M14B0_LED_PAT_H_MIN_MAX;

/*-----------------------------------------------------------------------------
	0x008c led_pat_v_min_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_min					:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	v_max					:12;	// 16:27
} M14B0_LED_PAT_V_MIN_MAX;

/*-----------------------------------------------------------------------------
	0x0090 led_pat_hv_ppf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pat_h_ppf				: 8,	//  0: 7
	pat_v_ppf				: 8;	//  8:15
} M14B0_LED_PAT_HV_PPF;

/*-----------------------------------------------------------------------------
	0x0094 led_pat_val_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	b_value					:10,	//  0: 9
	g_value					:10,	// 10:19
	r_value					:10;	// 20:29
} M14B0_LED_PAT_VAL_R;

/*-----------------------------------------------------------------------------
	0x0098 led_pat_h_min_max_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	h_min					:11,	//  0:10
	_rsvd					: 5,	// 11:15 reserved
	h_max					:11;	// 16:26
} M14B0_LED_PAT_H_MIN_MAX_R;

/*-----------------------------------------------------------------------------
	0x009c led_pat_v_min_max_r ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_min					:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	v_max					:12;	// 16:27
} M14B0_LED_PAT_V_MIN_MAX_R;

/*-----------------------------------------------------------------------------
	0x00a0 led_pat_bgval ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	b_value					:10,	//  0: 9
	g_value					:10,	// 10:19
	r_value					:10;	// 20:29
} M14B0_LED_PAT_BGVAL;

/*-----------------------------------------------------------------------------
	0x00c0 led_iwb_r_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iwb_r_gain				:11,	//  0:10
	_rsvd					: 5,	// 11:15 reserved
	iwb_r_offset				:10;	// 16:25
} M14B0_LED_IWB_R_GAIN;

/*-----------------------------------------------------------------------------
	0x00c4 led_iwb_g_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iwb_g_gain				:11,	//  0:10
	_rsvd					: 5,	// 11:15 reserved
	iwb_g_offset				:10;	// 16:25
} M14B0_LED_IWB_G_GAIN;

/*-----------------------------------------------------------------------------
	0x00c8 led_iwb_b_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	iwb_b_gain				:11,	//  0:10
	_rsvd					: 5,	// 11:15 reserved
	iwb_b_offset				:10;	// 16:25
} M14B0_LED_IWB_B_GAIN;

/*-----------------------------------------------------------------------------
	0x0100 led_hist_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hist_mode				: 2;	//  0: 1
} M14B0_LED_HIST_MODE;

/*-----------------------------------------------------------------------------
	0x0104 led_hist_raddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hist_rdata				:23,	//  0:22
	_rsvd					: 1,	//    23 reserved
	hist_raddr				: 6;	// 24:29
} M14B0_LED_HIST_RADDR;

/*-----------------------------------------------------------------------------
	0x0108 led_pwm_sc_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_ext_sc_sel			: 1,	//     0
	_rsvd					: 3,	//  1: 3 reserved
	pwm_sc_mode			: 3;	//  4: 6
} M14B0_LED_PWM_SC_MODE;

/*-----------------------------------------------------------------------------
	0x010c led_pwm_max_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_fr_max_only		: 1,	//     0
	_rsvd_00				: 3,	//  1: 3 reserved
	pwm_ext_max_sel		: 1,	//     4
	_rsvd_01				: 3,	//  5: 7 reserved
	pwm_max_mode			: 2,	//  8: 9
	_rsvd_02				: 2,	// 10:11 reserved
	pwm_bv_end_sel		: 1;	//    12
} M14B0_LED_PWM_MAX_MODE;

/*-----------------------------------------------------------------------------
	0x0110 led_pwm_iir_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_maf_iir_en			: 1,	//     0
	_rsvd					: 3,	//  1: 3 reserved
	pwm_sc_iir_en			: 1;	//     4
} M14B0_LED_PWM_IIR_MODE;

/*-----------------------------------------------------------------------------
	0x0114 led_pwm_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_pwm_sel                     : 1,	//     0
	_rsvd	                            : 3,	//  1: 3 reserved
	pwm_blu_en                      : 1;	//     4
} M14B0_LED_PWM_MODE;

/*-----------------------------------------------------------------------------
	0x0118 led_pwm_pel_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_pwm_sel				: 1;	//     0
} M14B0_LED_PWM_PEL_MODE;

/*-----------------------------------------------------------------------------
	0x011c led_pwm_ext_sc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_ext_sc				: 1;	//     0
} M14B0_LED_PWM_EXT_SC;

/*-----------------------------------------------------------------------------
	0x0120 led_pwm_sc_hist_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_sc_hist_th			:24;	//  0:23
} M14B0_LED_PWM_SC_HIST_TH;

/*-----------------------------------------------------------------------------
	0x0124 led_pwm_sc_apl_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_sc_apl_th			:10;	//  0: 9
} M14B0_LED_PWM_SC_APL_TH;

/*-----------------------------------------------------------------------------
	0x0128 led_pwm_sc_detect_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_sc_detect			: 1;	//     0
} M14B0_LED_PWM_SC_DETECT_RD;

/*-----------------------------------------------------------------------------
	0x012c led_pwm_max_cdf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_max_cdf			:23;	//  0:22
} M14B0_LED_PWM_MAX_CDF;

/*-----------------------------------------------------------------------------
	0x0130 led_pwm_ext_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_ext_max			:10;	//  0: 9
} M14B0_LED_PWM_EXT_MAX;

/*-----------------------------------------------------------------------------
	0x0134 led_pwm_fr_max_wei ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_fr_max_wei		: 8;	//  0: 7
} M14B0_LED_PWM_FR_MAX_WEI;

/*-----------------------------------------------------------------------------
	0x0138 led_pwm_x1_x2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_x2					:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	pwm_x1					:10;	// 16:25
} M14B0_LED_PWM_X1_X2;

/*-----------------------------------------------------------------------------
	0x013c led_pwm_x3_x4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_x4					:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	pwm_x3					:10;	// 16:25
} M14B0_LED_PWM_X3_X4;

/*-----------------------------------------------------------------------------
	0x0140 led_pwm_y0_y1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_y1					:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	pwm_y0					:10;	// 16:25
} M14B0_LED_PWM_Y0_Y1;

/*-----------------------------------------------------------------------------
	0x0144 led_pwm_y2_y3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_y3					:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	pwm_y2					:10;	// 16:25
} M14B0_LED_PWM_Y2_Y3;

/*-----------------------------------------------------------------------------
	0x0148 led_pwm_y4_y5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_y5					:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	pwm_y4					:10;	// 16:25
} M14B0_LED_PWM_Y4_Y5;

/*-----------------------------------------------------------------------------
	0x014c led_pwm_bv_fr_max_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_fr_max_value		:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	pwm_bv_max_value		:10;	// 16:25
} M14B0_LED_PWM_BV_FR_MAX_RD;

/*-----------------------------------------------------------------------------
	0x0150 led_pwm_max_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_max_value			:10;	//  0: 9
} M14B0_LED_PWM_MAX_RD;

/*-----------------------------------------------------------------------------
	0x0154 led_pwm_value_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_value_iir			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	pwm_value				:10;	// 16:25
} M14B0_LED_PWM_VALUE_RD;

/*-----------------------------------------------------------------------------
	0x0158 led_pwm_iir_wei ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_iir_wei				: 8;	//  0: 7
} M14B0_LED_PWM_IIR_WEI;

/*-----------------------------------------------------------------------------
	0x015c led_pwm_sc_iir_step_c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_sc_iir_step_c		:18;	//  0:17
} M14B0_LED_PWM_SC_IIR_STEP_C;

/*-----------------------------------------------------------------------------
	0x0160 led_pwm_sc_iir_step_p ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_sc_iir_step_p		:18;	//  0:17
} M14B0_LED_PWM_SC_IIR_STEP_P;

/*-----------------------------------------------------------------------------
	0x0164 led_pwm_ledj_iir_wei_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_adj_iir_wei			: 8;	//  0: 7
} M14B0_LED_PWM_ADJ_IIR_WEI_RD;

/*-----------------------------------------------------------------------------
	0x0168 led_pwm_maf_iir_step_c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_maf_iir_step_c		:20;	//  0:19
} M14B0_LED_PWM_MAF_IIR_STEP_C;

/*-----------------------------------------------------------------------------
	0x016c led_pwm_maf_iir_step_p ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_maf_iir_step_p		:20;	//  0:19
} M14B0_LED_PWM_MAF_IIR_STEP_P;

/*-----------------------------------------------------------------------------
	0x0170 led_pwm_maf_iir_mag_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_maf_iir_mag			:10;	//  0: 9
} M14B0_LED_PWM_MAF_IIR_MAG_RD;

/*-----------------------------------------------------------------------------
	0x0174 led_pwm_ext_val_pel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_pwm_pel			 :10;	//  0: 9
} M14B0_LED_PWM_EXT_VAL_PEL;

/*-----------------------------------------------------------------------------
	0x0178 led_pwm_bl_tdif_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_bl_tdif_avg_th		:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	pwm_bl_tdif_avg			:10;	// 16:25
} M14B0_LED_PWM_BL_TDIF_TH;

/*-----------------------------------------------------------------------------
	0x0180 led_max_opt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	max_opt				: 8;	//  0: 7
} M14B0_LED_MAX_OPT;

/*-----------------------------------------------------------------------------
	0x0184 led_blk_max_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_max_mode			: 1;	//     0
} M14B0_LED_BLK_MAX_MODE;

/*-----------------------------------------------------------------------------
	0x0188 led_max_opt_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	max_opt_mode			: 1;	//     0
} M14B0_LED_MAX_OPT_MODE;

/*-----------------------------------------------------------------------------
	0x018c led_max_opt0_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	max_opt1				: 8,	//  0: 7
	max_opt0				: 8;	//  8:15
} M14B0_LED_MAX_OPT0_1;

/*-----------------------------------------------------------------------------
	0x0190 led_level_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	level_th					:10;	//  0: 9
} M14B0_LED_LEVEL_TH;

/*-----------------------------------------------------------------------------
	0x0194 led_number_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	number_th				:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	number_bit_sel			: 4;	// 16:19
} M14B0_LED_NUMBER_TH;

/*-----------------------------------------------------------------------------
	0x0198 led_apl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	avg_bv					:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	apl						:10;	// 16:25
} M14B0_LED_APL;

/*-----------------------------------------------------------------------------
	0x019c led_bv_gen_x1_x2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_x2				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_gen_x1				:10;	// 16:25
} M14B0_LED_BV_GEN_X1_X2;

/*-----------------------------------------------------------------------------
	0x01a0 led_bv_gen_x3_x4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_x4				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_gen_x3				:10;	// 16:25
} M14B0_LED_BV_GEN_X3_X4;

/*-----------------------------------------------------------------------------
	0x01a4 led_bv_gen_y0_y1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_y1				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_gen_y0				:10;	// 16:25
} M14B0_LED_BV_GEN_Y0_Y1;

/*-----------------------------------------------------------------------------
	0x01a8 led_bv_gen_y2_y3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_y3				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_gen_y2				:10;	// 16:25
} M14B0_LED_BV_GEN_Y2_Y3;

/*-----------------------------------------------------------------------------
	0x01ac led_bv_gen_y4_y5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gen_y5				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_gen_y4				:10;	// 16:25
} M14B0_LED_BV_GEN_Y4_Y5;

/*-----------------------------------------------------------------------------
	0x01b0 led_bv_gen_bv_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bvgen_max				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bvgen_min				:10;	// 16:25
} M14B0_LED_BV_GEN_BV_MAX;

/*-----------------------------------------------------------------------------
	0x01b4 led_bv_min_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	max_bv					:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	min_bv					:10;	// 16:25
} M14B0_LED_BV_MIN_MAX;

/*-----------------------------------------------------------------------------
	0x01c0 led_bv_rctrl_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rctrl_mode				: 4,	//  0: 3
	_rsvd_00				: 4,	//  4: 7 reserved
	vsout_mode				: 4,	//  8:11
	_rsvd_01				: 4,	// 12:15 reserved
	bdata_mode				: 4,	// 16:19
	_rsvd_02				: 4,	// 20:23 reserved
	tfout_mode				: 4;	// 24:27
} M14B0_LED_BV_RCTRL_MODE;

/*-----------------------------------------------------------------------------
	0x01c4 led_pic_attr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_attr					: 1,	//     0
	black_mask				: 1,	//     1
	tf_pic_attr				: 1;	//     2
} M14B0_LED_PIC_ATTR;

/*-----------------------------------------------------------------------------
	0x01c8 led_lr_sync_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lr_sync_sel				: 1;	//     0
} M14B0_LED_LR_SYNC_SEL;

/*-----------------------------------------------------------------------------
	0x0200 led_sc_mag_gn_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_mag_th				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	sc_mag_gn				: 8;	// 16:23
} M14B0_LED_SC_MAG_GN_TH;

/*-----------------------------------------------------------------------------
	0x0204 led_sc_mag_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_mag_info				:10;	//  0: 9
} M14B0_LED_SC_MAG_INFO;

/*-----------------------------------------------------------------------------
	0x0240 led_lut_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut_mode				: 2;	//  0: 1
} M14B0_LED_LUT_MODE;

/*-----------------------------------------------------------------------------
	0x0244 led_ex_abv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ex_abv					:10;	//  0: 9
} M14B0_LED_EX_ABV;

/*-----------------------------------------------------------------------------
	0x0248 led_sg_l_h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sg_l						: 8,	//  0: 7
	sg_h					: 8;	//  8:15
} M14B0_LED_SG_L_H;

/*-----------------------------------------------------------------------------
	0x024c led_dc_lut_raddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut_dbg_raddr			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	lut_dbg_rd_sel			: 1;	//    16
} M14B0_LED_DC_LUT_RADDR;

/*-----------------------------------------------------------------------------
	0x0250 led_dc_lut_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut1_dbg_rdata			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	lut0_dbg_rdata			:10;	// 16:25
} M14B0_LED_DC_LUT_RDATA;

/*-----------------------------------------------------------------------------
	0x0254 led_bv_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_gain					:11;	//  0:10
} M14B0_LED_BV_GAIN;

/*-----------------------------------------------------------------------------
	0x0258 led_lut_avg_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut_avg_sel				: 1;	//     0
} M14B0_LED_LUT_AVG_SEL;

/*-----------------------------------------------------------------------------
	0x025c led_lut_offset_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_offset_en			: 2;	//  0: 1
} M14B0_LED_LUT_OFFSET_EN;

/*-----------------------------------------------------------------------------
	0x0260 led_lut_offset_x1_x2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_offset_x2			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_offset_x1			:10;	// 16:25
} M14B0_LED_LUT_OFFSET_X1_X2;

/*-----------------------------------------------------------------------------
	0x0264 led_lut_offset_x3_x4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_offset_x4			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_offset_x3			:10;	// 16:25
} M14B0_LED_LUT_OFFSET_X3_X4;

/*-----------------------------------------------------------------------------
	0x0268 led_lut_offset_y0_y1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_offset_y1			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_offset_y0			:10;	// 16:25
} M14B0_LED_LUT_OFFSET_Y0_Y1;

/*-----------------------------------------------------------------------------
	0x026c led_lut_offset_y2_y3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_offset_y3			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_offset_y2			:10;	// 16:25
} M14B0_LED_LUT_OFFSET_Y2_Y3;

/*-----------------------------------------------------------------------------
	0x0270 led_lut_offset_y4_y5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_offset_y5			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	bv_offset_y4			:10;	// 16:25
} M14B0_LED_LUT_OFFSET_Y4_Y5;

/*-----------------------------------------------------------------------------
	0x0274 led_ld_smooth_off ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	smooth_off				: 1;	//     0
} M14B0_LED_LD_SMOOTH_OFF;

/*-----------------------------------------------------------------------------
	0x0278 led_ld_smooth_off_step ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	smooth_off_step			:10;	//  0: 9
} M14B0_LED_LD_SMOOTH_OFF_STEP;

/*-----------------------------------------------------------------------------
	0x027c led_ld_bv_ext_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_ext_max				:10;	//  0: 9
} M14B0_LED_LD_BV_EXT_MAX;

/*-----------------------------------------------------------------------------
	0x0280 led_umask_um_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_en					: 1;	//     0
} M14B0_LED_UMASK_UM_EN;

/*-----------------------------------------------------------------------------
	0x0284 led_umask_5x5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_5x5_en				: 1;	//     0
} M14B0_LED_UMASK_5X5;

/*-----------------------------------------------------------------------------
	0x0288 led_umask_coaring ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_coaring_n			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	lsf_coaring_p			:10;	// 16:25
} M14B0_LED_UMASK_COARING;

/*-----------------------------------------------------------------------------
	0x028c led_umask_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_gain_n				:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	lsf_gain_p				:12;	// 16:27
} M14B0_LED_UMASK_GAIN;

/*-----------------------------------------------------------------------------
	0x0290 led_umask_wr_coeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_coeff_wdata			:12;	//  0:11
} M14B0_LED_UMASK_WR_COEFF;

/*-----------------------------------------------------------------------------
	0x0294 led_umask_rd_coeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lsf_coeff_rdata			:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	lsf_coeff_raddr			: 5;	// 16:20
} M14B0_LED_UMASK_RD_COEFF;

/*-----------------------------------------------------------------------------
	0x02c0 led_t_sf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	t_sf						:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	limit					:10;	// 16:25
} M14B0_LED_T_SF;

/*-----------------------------------------------------------------------------
	0x02c4 led_kmode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	kmode					: 1;	//     0
} M14B0_LED_KMODE;

/*-----------------------------------------------------------------------------
	0x02c8 led_hvkmask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hkmask					: 2,	//  0: 1
	vkmask					: 2;	//  2: 3
} M14B0_LED_HVKMASK;

/*-----------------------------------------------------------------------------
	0x0300 led_tf_opmode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tf_opmode				: 3;	//  0: 2
} M14B0_LED_TF_OPMODE;

/*-----------------------------------------------------------------------------
	0x0304 led_a_para ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a_para					: 9;	//  0: 8
} M14B0_LED_A_PARA;

/*-----------------------------------------------------------------------------
	0x0308 led_sc_adj_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_adj_en				: 1;	//     0
} M14B0_LED_SC_ADJ_EN;

/*-----------------------------------------------------------------------------
	0x030c led_md_adj_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_adj_en                       : 1;	//     0
} M14B0_LED_MD_ADJ_EN;

/*-----------------------------------------------------------------------------
	0x0310 led_md_x1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_x1_n				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	md_x1_p				:10;	// 16:25
} M14B0_LED_MD_X1;

/*-----------------------------------------------------------------------------
	0x0314 led_md_x2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_x2_n				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	md_x2_p				:10;	// 16:25
} M14B0_LED_MD_X2;

/*-----------------------------------------------------------------------------
	0x0318 led_md_x3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_x3_n				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	md_x3_p				:10;	// 16:25
} M14B0_LED_MD_X3;

/*-----------------------------------------------------------------------------
	0x031c led_md_x4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_x4_n				:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	md_x4_p				:10;	// 16:25
} M14B0_LED_MD_X4;

/*-----------------------------------------------------------------------------
	0x0320 led_md_y0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y0_n				: 9,	//  0: 8
	_rsvd					: 7,	//  9:15 reserved
	md_y0_p				: 9;	// 16:24
} M14B0_LED_MD_Y0;

/*-----------------------------------------------------------------------------
	0x0324 led_md_y1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y1_n				: 9,	//  0: 8
	_rsvd					: 7,	//  9:15 reserved
	md_y1_p				: 9;	// 16:24
} M14B0_LED_MD_Y1;

/*-----------------------------------------------------------------------------
	0x0328 led_md_y2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y2_n				: 9,	//  0: 8
	_rsvd					: 7,	//  9:15 reserved
	md_y2_p				: 9;	// 16:24
} M14B0_LED_MD_Y2;

/*-----------------------------------------------------------------------------
	0x032c led_md_y3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y3_n				: 9,	//  0: 8
	_rsvd					: 7,	//  9:15 reserved
	md_y3_p				: 9;	// 16:24
} M14B0_LED_MD_Y3;

/*-----------------------------------------------------------------------------
	0x0330 led_md_y4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y4_n				: 9,	//  0: 8
	_rsvd					: 7,	//  9:15 reserved
	md_y4_p				: 9;	// 16:24
} M14B0_LED_MD_Y4;

/*-----------------------------------------------------------------------------
	0x0334 led_md_y5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	md_y5_n				: 9,	//  0: 8
	_rsvd					: 7,	//  9:15 reserved
	md_y5_p				: 9;	// 16:24
} M14B0_LED_MD_Y5;

/*-----------------------------------------------------------------------------
	0x0340 led_led_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	led_mode				: 2,	//  0: 1
	_rsvd_00				: 6,	//  2: 7 reserved
	edge_mode				: 2,	//  8: 9
	_rsvd_01				: 6,	// 10:15 reserved
	hybrid_mode			: 1,	//    16
	_rsvd_02				: 7,	// 17:23 reserved
	hybrid_pattern			: 4;	// 24:27
} M14B0_LED_LED_MODE;

/*-----------------------------------------------------------------------------
	0x0344 led_lres_bnh_bnv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_lres					: 6,	//  0: 5
	_rsvd					:10,	//  6:15 reserved
	bnv_lres					: 5;	// 16:20
} M14B0_LED_LRES_BNH_BNV;

/*-----------------------------------------------------------------------------
	0x0348 led_lres_bsh_bsv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsh_lres					: 6,	//  0: 5
	_rsvd					:10,	//  6:15 reserved
	bsv_lres					: 5;	// 16:20
} M14B0_LED_LRES_BSH_BSV;

/*-----------------------------------------------------------------------------
	0x034c led_sbi_bnh_bnv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_bnh					: 8,	//  0: 7
	_rsvd					: 8,	//  8:15 reserved
	sbi_bnv					: 7;	// 16:22
} M14B0_LED_SBI_BNH_BNV;

/*-----------------------------------------------------------------------------
	0x0350 led_sbi_bsh_bsv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_bsh					:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	sbi_bsv					:10;	// 16:25
} M14B0_LED_SBI_BSH_BSV;

/*-----------------------------------------------------------------------------
	0x0354 led_tab1_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tab1_rd_sel				: 1;	//     0
} M14B0_LED_TAB1_RD_SEL;

/*-----------------------------------------------------------------------------
	0x0358 led_tab1_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tab1_re					: 1;	//     0
} M14B0_LED_TAB1_RDATA;

/*-----------------------------------------------------------------------------
	0x035c led_tab5_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tab5_rd_sel				: 1;	//     0
} M14B0_LED_TAB5_RD_SEL;

/*-----------------------------------------------------------------------------
	0x0360 led_tab5_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tab5_re					: 1;	//     0
} M14B0_LED_TAB5_RDATA;

/*-----------------------------------------------------------------------------
	0x0364 led_hfc_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hfc_rd_sel				: 1;	//     0
} M14B0_LED_HFC_RD_SEL;

/*-----------------------------------------------------------------------------
	0x0368 led_hfc_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hfc_re					: 1;	//     0
} M14B0_LED_HFC_RDATA;

/*-----------------------------------------------------------------------------
	0x036c led_vfc_rd_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vfc_rd_sel				: 1;	//     0
} M14B0_LED_VFC_RD_SEL;

/*-----------------------------------------------------------------------------
	0x0370 led_vfc_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vfc_re					: 1;	//     0
} M14B0_LED_VFC_RDATA;

/*-----------------------------------------------------------------------------
	0x0374 led_polaris_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	polaris_en				: 1,	//     0
	_rsvd_00				: 7,	//  1: 7 reserved
	polaris_hx2_en			: 1,	//     8
	_rsvd_01				: 7,	//  9:15 reserved
	polaris_hsft_odd			: 3,	// 16:18
	polaris_hsft_odd_dir		: 1,	//    19
	_rsvd_02				: 4,	// 20:23 reserved
	polaris_hsft_eve			: 3,	// 24:26
	polaris_hsft_eve_dir		: 1;	//    27
} M14B0_LED_POLARIS_MODE;

/*-----------------------------------------------------------------------------
	0x0380 led_comp_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pixel_comp_en			: 1;	//     0
} M14B0_LED_COMP_EN;

/*-----------------------------------------------------------------------------
	0x0384 led_cont_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	const_gain				:10;	//  0: 9
} M14B0_LED_CONT_GAIN;

/*-----------------------------------------------------------------------------
	0x0388 led_comp_in ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	comp_in_sel				: 2;	//  0: 1
} M14B0_LED_COMP_IN;

/*-----------------------------------------------------------------------------
	0x038c led_pc_raddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_raddr				: 7,	//  0: 6
	_rsvd					: 9,	//  7:15 reserved
	pc_lut_d_rden			: 1,	//    16
	pc_lut_c_rden			: 1,	//    17
	pc_lut_b_rden			: 1,	//    18
	pc_lut_a_rden			: 1;	//    19
} M14B0_LED_PC_RADDR;

/*-----------------------------------------------------------------------------
	0x0390 led_pc_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_rdata				:10;	//  0: 9
} M14B0_LED_PC_RDATA;

/*-----------------------------------------------------------------------------
	0x0400 led_gbl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gbl						:10;	//  0: 9
} M14B0_LED_GBL;

/*-----------------------------------------------------------------------------
	0x0404 led_abv_cmp_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	abv_cmp_val			:10;	//  0: 9
} M14B0_LED_ABV_CMP_VALUE;

/*-----------------------------------------------------------------------------
	0x0408 led_bv_dly ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bv_dly_ble				: 2,	//  0: 1
	_rsvd					: 6,	//  2: 7 reserved
	bv_dly_blu				: 2;	//  8: 9
} M14B0_LED_BV_DLY;

/*-----------------------------------------------------------------------------
	0x040c led_blu_bv_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_bv_sel				: 1;	//     0
} M14B0_LED_BLU_BV_SEL;

/*-----------------------------------------------------------------------------
	0x0440 led_instr_wr_req ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	led_instr_wr_req			: 1,	//     0
	led_instr_wr_ack			: 1;	//     1
} M14B0_LED_INSTR_WR_REQ;

/*-----------------------------------------------------------------------------
	0x0444 led_instr_wdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wdata_instr				:11,	//  0:10
	_rsvd					: 5,	// 11:15 reserved
	waddr_instr				: 3;	// 16:18
} M14B0_LED_INSTR_WDATA;

/*-----------------------------------------------------------------------------
	0x0448 led_instr_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rdata_instr				:11,	//  0:10
	_rsvd					: 5,	// 11:15 reserved
	raddr_instr				: 3;	// 16:18
} M14B0_LED_INSTR_RDATA;

/*-----------------------------------------------------------------------------
	0x044c led_instr_dgb ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	debug_instr				:11,	//  0:10
	_rsvd_00				: 5,	// 11:15 reserved
	debug_pc				: 3,	// 16:18
	_rsvd_01				:12,	// 19:30 reserved
	bv_ctrl_err				: 1;	//    31
} M14B0_LED_INSTR_DGB;

/*-----------------------------------------------------------------------------
	0x0480 led_blc_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blc_mode				: 2;	//  0: 1
} M14B0_LED_BLC_MODE;

/*-----------------------------------------------------------------------------
	0x0484 led_bsf_c0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_c0					:10;	//  0: 9
} M14B0_LED_BSF_C0;

/*-----------------------------------------------------------------------------
	0x0488 led_bsf_c1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_c1					:10;	//  0: 9
} M14B0_LED_BSF_C1;

/*-----------------------------------------------------------------------------
	0x048c led_bsf_c2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_c2					:10;	//  0: 9
} M14B0_LED_BSF_C2;

/*-----------------------------------------------------------------------------
	0x0490 led_bsf_ratio0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_ratio0				:10;	//  0: 9
} M14B0_LED_BSF_RATIO0;

/*-----------------------------------------------------------------------------
	0x0494 led_bsf_ratio1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_ratio1				:10;	//  0: 9
} M14B0_LED_BSF_RATIO1;

/*-----------------------------------------------------------------------------
	0x0498 led_bsf_ratio2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bsf_ratio2				:10;	//  0: 9
} M14B0_LED_BSF_RATIO2;

/*-----------------------------------------------------------------------------
	0x049c led_a0_gn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a0_gn					: 8;	//  0: 7
} M14B0_LED_A0_GN;

/*-----------------------------------------------------------------------------
	0x04a0 led_a1_gn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a1_gn					: 8;	//  0: 7
} M14B0_LED_A1_GN;

/*-----------------------------------------------------------------------------
	0x04a4 led_a2_gn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a2_gn					: 8;	//  0: 7
} M14B0_LED_A2_GN;

/*-----------------------------------------------------------------------------
	0x04a8 led_a0_ratio ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a0_ratio					: 8;	//  0: 7
} M14B0_LED_A0_RATIO;

/*-----------------------------------------------------------------------------
	0x04ac led_a1_ratio ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a1_ratio					: 8;	//  0: 7
} M14B0_LED_A1_RATIO;

/*-----------------------------------------------------------------------------
	0x04b0 led_drv_max ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	drv_max				:10;	//  0: 9
} M14B0_LED_DRV_MAX;

/*-----------------------------------------------------------------------------
	0x04b4 led_blc_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blc_en					: 1,	//     0
	blc_tempo_en			: 1;	//     1
} M14B0_LED_BLC_EN;

/*-----------------------------------------------------------------------------
	0x04b8 led_blc_tempo_th ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blc_tempo_th			:10;	//  0: 9
}M14B0_LED_BLC_TEMPO_TH;

/*-----------------------------------------------------------------------------
	0x04bc led_blc_frame_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blc_frame_num			:10;	//  0: 9
} M14B0_LED_BLC_FRAME_NUM;

/*-----------------------------------------------------------------------------
	0x04c0 led_mem_addr_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mem_dl_addr_clr		: 1,	//     0
	_rsvd					:15,	//  1:15 reserved
	mem_dl_addr			:12;	// 16:27
} M14B0_LED_MEM_ADDR_CLR;

/*-----------------------------------------------------------------------------
	0x04c4 led_mem_dl_sbi_hcoeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_hcoeff				:10;	//  0: 9
} M14B0_LED_MEM_DL_SBI_HCOEFF;

/*-----------------------------------------------------------------------------
	0x04c8 led_mem_dl_sbi_vcoeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbi_vcoeff				:10;	//  0: 9
} M14B0_LED_MEM_DL_SBI_VCOEFF;

/*-----------------------------------------------------------------------------
	0x04cc led_mem_dl_pixel_comp_a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_a					:10;	//  0: 9
} M14B0_LED_MEM_DL_PIXEL_COMP_A;

/*-----------------------------------------------------------------------------
	0x04d0 led_mem_dl_pixel_comp_b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_b					:10;	//  0: 9
} M14B0_LED_MEM_DL_PIXEL_COMP_B;

/*-----------------------------------------------------------------------------
	0x04d4 led_mem_dl_pixel_comp_c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_c					:10;	//  0: 9
} M14B0_LED_MEM_DL_PIXEL_COMP_C;

/*-----------------------------------------------------------------------------
	0x04d8 led_mem_dl_pixel_comp_d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_lut_d					:10;	//  0: 9
} M14B0_LED_MEM_DL_PIXEL_COMP_D;

/*-----------------------------------------------------------------------------
	0x04dc led_upper_dc_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dc_lut_upper			:10;	//  0: 9
} M14B0_LED_UPPER_DC_LUT;

/*-----------------------------------------------------------------------------
	0x04e0 led_lower_dc_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dc_lut_lower				:10;	//  0: 9
} M14B0_LED_LOWER_DC_LUT;

/*-----------------------------------------------------------------------------
	0x04e4 led_fc_tab1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fc_tab1					:10;	//  0: 9
} M14B0_LED_FC_TAB1;

/*-----------------------------------------------------------------------------
	0x04e8 led_fc_tab5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fc_tab5					:10;	//  0: 9
} M14B0_LED_FC_TAB5;

/*-----------------------------------------------------------------------------
	0x0500 led_mean_in_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mean_in_sel				: 1;	//     0
} M14B0_LED_MEAN_IN_SEL;

/*-----------------------------------------------------------------------------
	0x0504 led_mean ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pixel_mean				:10;	//  0: 9
} M14B0_LED_MEAN;

/*-----------------------------------------------------------------------------
	0x0540 led_rp_hv_pos ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rp_v_pos				:12,	//  0:11
	_rsvd					: 4,	// 12:15 reserved
	rp_h_pos				:12;	// 16:27
} M14B0_LED_RP_HV_POS;

/*-----------------------------------------------------------------------------
	0x0544 led_rp_make_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mark_en				: 1;	//     0
} M14B0_LED_RP_MAKE_EN;

/*-----------------------------------------------------------------------------
	0x0548 led_rp_r_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_pixel_r				:14;	//  0:13
} M14B0_LED_RP_R_VALUE;

/*-----------------------------------------------------------------------------
	0x054c led_rp_g_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_pixel_g                      :14;	//  0:13
} M14B0_LED_RP_G_VALUE;

/*-----------------------------------------------------------------------------
	0x0550 led_rp_b_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rd_pixel_b				:14;	//  0:13
} M14B0_LED_RP_B_VALUE;

/*-----------------------------------------------------------------------------
	0x0558 led_alef2_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_en					: 1,	//     0
	_rsvd_00				: 3,	//  1: 3 reserved
	alef2_gain_en			: 1,	//     4
	_rsvd_01				: 3,	//  5: 7 reserved
	alef2_mode				: 1;	//     8
} M14B0_LED_ALEF2_MODE;

/*-----------------------------------------------------------------------------
	0x055c led_alef2_block_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_block_num			: 5;	//  0: 4
} M14B0_LED_ALEF2_BLOCK_NUM;

/*-----------------------------------------------------------------------------
	0x0560 led_alef2_addr_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_addr_clr			: 1;	//     0
} M14B0_LED_ALEF2_ADDR_CLR;

/*-----------------------------------------------------------------------------
	0x0564 led_alef2_cfg_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_height				: 5,	//  0: 4
	_rsvd_00				: 3,	//  5: 7 reserved
	alef2_width				: 6,	//  8:13
	_rsvd_01				: 2,	// 14:15 reserved
	alef2_v_srt				: 5,	// 16:20
	_rsvd_02				: 3,	// 21:23 reserved
	alef2_h_srt				: 6;	// 24:29
} M14B0_LED_ALEF2_CFG_LUT;

/*-----------------------------------------------------------------------------
	0x0568 led_alef2_cfg_lut_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_height				: 5,	//  0: 4
	_rsvd_00				: 3,	//  5: 7 reserved
	alef2_width				: 6,	//  8:13
	_rsvd_01				: 2,	// 14:15 reserved
	alef2_v_srt				: 5,	// 16:20
	_rsvd_02				: 3,	// 21:23 reserved
	alef2_h_srt				: 6;	// 24:29
} M14B0_LED_ALEF2_CFG_LUT_RD;

/*-----------------------------------------------------------------------------
	0x056c led_alef2_gain_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_gain				:10;	//  0: 9
} M14B0_LED_ALEF2_GAIN_LUT;

/*-----------------------------------------------------------------------------
	0x0570 led_alef2_gain_lut_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_gain_re			: 1;	//     0
} M14B0_LED_ALEF2_GAIN_LUT_RD;

/*-----------------------------------------------------------------------------
	0x0574 led_alef2_maxopt_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_maxopt			: 8;	//  0: 7
} M14B0_LED_ALEF2_MAXOPT_LUT;

/*-----------------------------------------------------------------------------
	0x0578 led_alef2_maxopt_lut_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_maxopt_re			: 1;	//     0
} M14B0_LED_ALEF2_MAXOPT_LUT_RD;

/*-----------------------------------------------------------------------------
	0x057c led_alef2_maxvalue_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alef2_maxvalue_en		:16;	//  0:15
} M14B0_LED_ALEF2_MAXVALUE_EN;

/*-----------------------------------------------------------------------------
	0x0580 led_disp_bv_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	display_bv_en			: 1;	//     0
} M14B0_LED_DISP_BV_EN;

/*-----------------------------------------------------------------------------
	0x0584 led_dsip_bv_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	display_bv_addr			:11;	//  0:10
} M14B0_LED_DSIP_BV_ADDR;

/*-----------------------------------------------------------------------------
	0x05c0 led_dither_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither_en				: 1,	//     0
	dither_temp_en			: 1;	//     1
} M14B0_LED_DITHER_EN;

/*-----------------------------------------------------------------------------
	0x05d0 led_blu_gain_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_gain_en				: 1,	//     0
	_rsvd					: 3,	//  1: 3 reserved
	blu_gain_wr_mode		: 1;	//     4
} M14B0_LED_BLU_GAIN_EN;

/*-----------------------------------------------------------------------------
	0x05d4 led_blu_gain_addr_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_gain_addr_clr		: 1;	//     0
} M14B0_LED_BLU_GAIN_ADDR_CLR;

/*-----------------------------------------------------------------------------
	0x05d8 led_blu_gain_wd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_gain_wdata			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	blu_gain_waddr			:11;	// 16:26
} M14B0_LED_BLU_GAIN_WD;

/*-----------------------------------------------------------------------------
	0x05dc led_blu_gain_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_gain_rdata			:10,	//  0: 9
	_rsvd					: 6,	// 10:15 reserved
	blu_gain_raddr			:11;	// 16:26
} M14B0_LED_BLU_GAIN_RD;

/*-----------------------------------------------------------------------------
	0x0740 led_wcg_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_en					: 1;	//     0
} M14B0_LED_WCG_EN;

/*-----------------------------------------------------------------------------
	0x0744 led_wcg_dbg_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_bit_expansion		: 1,	//     0
	wcg_mismatch_check	: 1;	//     1
} M14B0_LED_WCG_DBG_EN;

/*-----------------------------------------------------------------------------
	0x0748 led_wcg_mem_wr_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_mem_wr_mode		: 1;	//     0
} M14B0_LED_WCG_MEM_WR_MODE;

/*-----------------------------------------------------------------------------
	0x074c led_wcg_mem_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_mem_sel                     ;   	// 31: 0
} M14B0_LED_WCG_MEM_SEL;

/*-----------------------------------------------------------------------------
	0x0750 led_wcg_mem_waddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_waddr				: 7;	//  0: 6
} M14B0_LED_WCG_MEM_WADDR;

/*-----------------------------------------------------------------------------
	0x0754 led_wcg_mem_wdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_mem_wdata		:30;	//  0:29
} M14B0_LED_WCG_MEM_WDATA;

/*-----------------------------------------------------------------------------
	0x0758 led_wcg_mem_ren ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_ren                         ;   	// 31: 0
} M14B0_LED_WCG_MEM_REN;

/*-----------------------------------------------------------------------------
	0x075c led_wcg_mem_raddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_raddr				: 7;	//  0: 6
} M14B0_LED_WCG_MEM_RADDR;

/*-----------------------------------------------------------------------------
	0x0760 led_wcg_mem_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_rdata				:30;	//  0:29
} M14B0_LED_WCG_MEM_RDATA;

/*-----------------------------------------------------------------------------
	0x0764 led_wcg_miss_match_ind ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wcg_mismatch_check	: 1;	//     0
} M14B0_LED_WCG_MISS_MATCH_IND;

/*-----------------------------------------------------------------------------
	0x2000 led_blu_blk_num_hv ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_blu_if				: 6,	//  0: 5
	_rsvd					:10,	//  6:15 reserved
	bnv_blu_if				: 5;	// 16:20
} M14B0_LED_BLU_BLK_NUM_HV;

/*-----------------------------------------------------------------------------
	0x2004 led_vs_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	led_vs_mode_0			: 2,	//  0: 1
	led_vs_mode_1			: 1,	//     2
	led_vs_mode_2			: 1;	//     3
} M14B0_LED_VS_MODE;

/*-----------------------------------------------------------------------------
	0x2008 led_blu_vs_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_vs_num				: 3;	//  0: 2
} M14B0_LED_BLU_VS_NUM;

/*-----------------------------------------------------------------------------
	0x200c led_blu_vs_t0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_vs_t0				:24;	//  0:23
} M14B0_LED_BLU_VS_T0;

/*-----------------------------------------------------------------------------
	0x2010 led_vs_dly ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vs_delay				:24;	//  0:23
} M14B0_LED_VS_DLY;

/*-----------------------------------------------------------------------------
	0x2014 led_i2c_slave_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	i2c_slave_addr			: 8;	//  0: 7
} M14B0_LED_I2C_SLAVE_ADDR;

/*-----------------------------------------------------------------------------
	0x2018 led_i2c_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	time_out				: 8,	//  0: 7
	_rsvd					: 8,	//  8:15 reserved
	hold_scl					: 8;	// 16:23
} M14B0_LED_I2C_CONF;

/*-----------------------------------------------------------------------------
	0x201c led_version ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	version                         ;   	// 31: 0
} M14B0_LED_VERSION;

/*-----------------------------------------------------------------------------
	0x2020 led_general_reg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	general_reg0                    ;   	// 31: 0
} M14B0_LED_GENERAL_REG0;

/*-----------------------------------------------------------------------------
	0x2024 led_general_reg1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	general_reg1                    ;   	// 31: 0
} M14B0_LED_GENERAL_REG1;

/*-----------------------------------------------------------------------------
	0x2028 led_general_reg2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	general_reg2                    ;   	// 31: 0
} M14B0_LED_GENERAL_REG2;

/*-----------------------------------------------------------------------------
	0x202c led_general_reg3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	general_reg3                    ;   	// 31: 0
} M14B0_LED_GENERAL_REG3;

/*-----------------------------------------------------------------------------
	0x2040 led_i2c_rd_on ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_i2c_rd_on			: 1;	//     0
} M14B0_LED_I2C_RD_ON;

/*-----------------------------------------------------------------------------
	0x2044 led_i2c_rd_addr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_i2c_raddr			:12;	//  0:11
} M14B0_LED_I2C_RD_ADDR;

/*-----------------------------------------------------------------------------
	0x2048 led_i2c_rd_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blu_i2c_rdata			:10;	//  0: 9
} M14B0_LED_I2C_RD_DATA;

/*-----------------------------------------------------------------------------
	0x2080 led_spi_cfg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_cpha				: 1,	//     0
	spi_cpol					: 1,	//     1
	spi_16b					: 1,	//     2
	spi_10b					: 1;	//     3
} M14B0_LED_SPI_CFG0;

/*-----------------------------------------------------------------------------
	0x2084 led_spi_cmd_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_cmd_mod			: 2;	//  0: 1
} M14B0_LED_SPI_CMD_MODE;

/*-----------------------------------------------------------------------------
	0x2088 led_m_spi_ch_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mask_ch3				: 1,	//     0
	mask_ch2				: 1,	//     1
	mask_ch1				: 1,	//     2
	mask_ch0				: 1;	//     3
} M14B0_LED_M_SPI_CH_MASK;

/*-----------------------------------------------------------------------------
	0x208c led_spi_idc01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_idc0					:16,	//  0:15
	spi_idc1					:16;	// 16:31
} M14B0_LED_SPI_IDC01;

/*-----------------------------------------------------------------------------
	0x2090 led_spi_idc23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_idc2					:16,	//  0:15
	spi_idc3					:16;	// 16:31
} M14B0_LED_SPI_IDC23;

/*-----------------------------------------------------------------------------
	0x2094 led_spi_cmd01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_cmd0				:16,	//  0:15
	spi_cmd1				:16;	// 16:31
} M14B0_LED_SPI_CMD01;

/*-----------------------------------------------------------------------------
	0x2098 led_spi_cmd23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_cmd2				:16,	//  0:15
	spi_cmd3				:16;	// 16:31
} M14B0_LED_SPI_CMD23;

/*-----------------------------------------------------------------------------
	0x209c led_sclk_t1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t1					:16;	//  0:15
} M14B0_LED_SCLK_T1;

/*-----------------------------------------------------------------------------
	0x20a0 led_sclk_t2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t2					:16;	//  0:15
} M14B0_LED_SCLK_T2;

/*-----------------------------------------------------------------------------
	0x20a4 led_sclk_t3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t3					:16;	//  0:15
} M14B0_LED_SCLK_T3;

/*-----------------------------------------------------------------------------
	0x20a8 led_sclk_t4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t4					:16;	//  0:15
} M14B0_LED_SCLK_T4;

/*-----------------------------------------------------------------------------
	0x20ac led_sclk_t5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sclk_t5					:16;	//  0:15
} M14B0_LED_SCLK_T5;

/*-----------------------------------------------------------------------------
	0x20c0 led_blk_sp0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_sp0					:11;	//  0:10
} M14B0_LED_BLK_SP0;

/*-----------------------------------------------------------------------------
	0x20c4 led_blk_sp1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_sp1					:11;	//  0:10
} M14B0_LED_BLK_SP1;

/*-----------------------------------------------------------------------------
	0x20c8 led_blk_sp2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_sp2					:11;	//  0:10
} M14B0_LED_BLK_SP2;

/*-----------------------------------------------------------------------------
	0x20cc led_blk_sp3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blk_sp3					:11;	//  0:10
} M14B0_LED_BLK_SP3;

/*-----------------------------------------------------------------------------
	0x20d0 led_bnh_seg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_seg0				: 6;	//  0: 5
} M14B0_LED_BNH_SEG0;

/*-----------------------------------------------------------------------------
	0x20d4 led_bnh_seg1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_seg1				: 6;	//  0: 5
} M14B0_LED_BNH_SEG1;

/*-----------------------------------------------------------------------------
	0x20d8 led_bnh_seg2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_seg2				: 6;	//  0: 5
} M14B0_LED_BNH_SEG2;

/*-----------------------------------------------------------------------------
	0x20dc led_bnh_seg3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnh_seg3				: 6;	//  0: 5
} M14B0_LED_BNH_SEG3;

/*-----------------------------------------------------------------------------
	0x20e0 led_bnv_seg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnv_seg0				: 5;	//  0: 4
} M14B0_LED_BNV_SEG0;

/*-----------------------------------------------------------------------------
	0x20e4 led_bnv_seg1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnv_seg1				: 5;	//  0: 4
} M14B0_LED_BNV_SEG1;

/*-----------------------------------------------------------------------------
	0x20e8 led_bnv_seg2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnv_seg2				: 5;	//  0: 4
} M14B0_LED_BNV_SEG2;

/*-----------------------------------------------------------------------------
	0x20ec led_bnv_seg3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnv_seg3				: 5;	//  0: 4
} M14B0_LED_BNV_SEG3;

/*-----------------------------------------------------------------------------
	0x20f0 led_reverse ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lr_swap					: 1,	//     0
	tb_swap					: 1;	//     1
} M14B0_LED_REVERSE;

/*-----------------------------------------------------------------------------
	0x2100 led_pwm_value ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_value				:10;	//  0: 9
} M14B0_LED_PWM_VALUE;

/*-----------------------------------------------------------------------------
	0x2104 led_blu_maxval_en ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x2108 led_spi_alef2_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_alef2_en				: 1;	//     0
} M14B0_LED_SPI_ALEF2_EN;

/*-----------------------------------------------------------------------------
	0x210c led_spi_alef2_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi_alef2_clr				: 1;	//     0
} M14B0_LED_SPI_ALEF2_CLR;

/*-----------------------------------------------------------------------------
	0x2110 led_spi0_alef2_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi0_alef2_rdpos			:11;	//  0:10
} M14B0_LED_SPI0_ALEF2_LUT;

/*-----------------------------------------------------------------------------
	0x2114 led_spi0_alef2_lut_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi0_alef2_re			: 1;	//     0
} M14B0_LED_SPI0_ALEF2_LUT_RD;

/*-----------------------------------------------------------------------------
	0x2118 led_spi1_alef2_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi1_alef2_rdpos			:11;	//  0:10
} M14B0_LED_SPI1_ALEF2_LUT;

/*-----------------------------------------------------------------------------
	0x211c led_spi1_alef2_lut_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi1_alef2_re			: 1;	//     0
} M14B0_LED_SPI1_ALEF2_LUT_RD;

/*-----------------------------------------------------------------------------
	0x2120 led_spi2_alef2_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi2_alef2_rdpos			:11;	//  0:10
} M14B0_LED_SPI2_ALEF2_LUT;

/*-----------------------------------------------------------------------------
	0x2124 led_spi2_alef2_lut_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi2_alef2_re			: 1;	//     0
} M14B0_LED_SPI2_ALEF2_LUT_RD;

/*-----------------------------------------------------------------------------
	0x2128 led_spi3_alef2_lut ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi3_alef2_rdpos			:11;	//  0:10
} M14B0_LED_SPI3_ALEF2_LUT;

/*-----------------------------------------------------------------------------
	0x212c led_spi3_alef2_lut_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spi3_alef2_re			: 1;	//     0
} M14B0_LED_SPI3_ALEF2_LUT_RD;

/*-----------------------------------------------------------------------------
	0x2140 led_ext_int_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_in_en                       ;   	// 31: 0
} M14B0_LED_EXT_INT_EN;

/*-----------------------------------------------------------------------------
	0x2144 led_ext_int_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_int_status                  ;   	// 31: 0
} M14B0_LED_EXT_INT_STATUS;

/*-----------------------------------------------------------------------------
	0x2148 led_ext_int_raw_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_int_raw_status              ;   	// 31: 0
} M14B0_LED_EXT_INT_RAW_STATUS;

/*-----------------------------------------------------------------------------
	0x214c led_ext_int_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext_int_clr                     ;   	// 31: 0
} M14B0_LED_EXT_INT_CLR;

/*-----------------------------------------------------------------------------
	0x2150 led_ext_int_line_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	int_line_num				:12;	//  0:11
} M14B0_LED_EXT_INT_LINE_NUM;

typedef struct {
	M14B0_LED_BV_GEN_HV_SIZE			led_bv_gen_hv_size             ;	// 0x0000 : ''
	M14B0_LED_BV_GEN_BLK_NUM_HV		led_bv_gen_blk_num_hv      ;	// 0x0004 : ''
	M14B0_LED_HV_RESOLUTION                	led_hv_resolution                ;	// 0x0008 : ''
	M14B0_LED_SYNC_POL                     	led_sync_pol                     ;	// 0x000c : ''
	UINT32                          	                 	_rsvd_00[   1];				// 0x0010
	M14B0_LED_DLY                      			led_led_dly                      ;	// 0x0014 : ''
	M14B0_LED_MONITOR_SEL                  	led_monitor_sel                  ;	// 0x0018 : ''
	M14B0_LED_DPATH_ORDER                  	led_dpath_order                  ;	// 0x001c : ''
	UINT32                          	                 	_rsvd_01[   8];	// 0x0020 ~ 0x003c
	M14B0_LED_DBG_CTRL                     		led_dbg_ctrl                     ;	// 0x0040 : ''
	M14B0_LED_LUM                          		led_lum                          ;	// 0x0044 : ''
	M14B0_LED_BLU_I2C_WDATA                	led_blu_i2c_wdata                ;	// 0x0048 : ''
	M14B0_LED_SB_SEL                       		led_sb_sel                       ;	// 0x004c : ''
	M14B0_LED_SB_I2C                       		led_sb_i2c                       ;	// 0x0050 : ''
	M14B0_LED_BV_READ                      		led_bv_read                      ;	// 0x0054 : ''
	M14B0_LED_BV_WRITE                     	led_bv_write                     ;	// 0x0058 : ''
	M14B0_LED_BV_RW_STATUS                 	led_bv_rw_status                 ;	// 0x005c : ''
	UINT32                          	                 	_rsvd_02[   8];	// 0x0060 ~ 0x007c
	M14B0_LED_PAT_ON                       		led_pat_on                       ;	// 0x0080 : ''
	M14B0_LED_PAT_VAL                      		led_pat_val                      ;	// 0x0084 : ''
	M14B0_LED_PAT_H_MIN_MAX                	led_pat_h_min_max                ;	// 0x0088 : ''
	M14B0_LED_PAT_V_MIN_MAX                	led_pat_v_min_max                ;	// 0x008c : ''
	M14B0_LED_PAT_HV_PPF                   	led_pat_hv_ppf                   ;	// 0x0090 : ''
	M14B0_LED_PAT_VAL_R                    	led_pat_val_r                    ;	// 0x0094 : ''
	M14B0_LED_PAT_H_MIN_MAX_R              	led_pat_h_min_max_r              ;	// 0x0098 : ''
	M14B0_LED_PAT_V_MIN_MAX_R              	led_pat_v_min_max_r              ;	// 0x009c : ''
	M14B0_LED_PAT_BGVAL                    	led_pat_bgval                    ;	// 0x00a0 : ''
	UINT32                          	                	 _rsvd_03[   7];	// 0x00a4 ~ 0x00bc
	M14B0_LED_IWB_R_GAIN                   	led_iwb_r_gain                   ;	// 0x00c0 : ''
	M14B0_LED_IWB_G_GAIN                   	led_iwb_g_gain                   ;	// 0x00c4 : ''
	M14B0_LED_IWB_B_GAIN                   	led_iwb_b_gain                   ;	// 0x00c8 : ''
	UINT32                          	                 	_rsvd_04[  13];	// 0x00cc ~ 0x00fc
	M14B0_LED_HIST_MODE                    	led_hist_mode                    ;	// 0x0100 : ''
	M14B0_LED_HIST_RADDR                   	led_hist_raddr                   ;	// 0x0104 : ''
	M14B0_LED_PWM_SC_MODE                  	led_pwm_sc_mode                  ;	// 0x0108 : ''
	M14B0_LED_PWM_MAX_MODE                 	led_pwm_max_mode                 ;	// 0x010c : ''
	M14B0_LED_PWM_IIR_MODE                 	led_pwm_iir_mode                 ;	// 0x0110 : ''
	M14B0_LED_PWM_MODE                     	led_pwm_mode                     ;	// 0x0114 : ''
	M14B0_LED_PWM_PEL_MODE                 	led_pwm_pel_mode                 ;	// 0x0118 : ''
	M14B0_LED_PWM_EXT_SC                   	led_pwm_ext_sc                   ;	// 0x011c : ''
	M14B0_LED_PWM_SC_HIST_TH               	led_pwm_sc_hist_th               ;	// 0x0120 : ''
	M14B0_LED_PWM_SC_APL_TH                	led_pwm_sc_apl_th                ;	// 0x0124 : ''
	M14B0_LED_PWM_SC_DETECT_RD            	led_pwm_sc_detect_rd             ;	// 0x0128 : ''
	M14B0_LED_PWM_MAX_CDF                  	led_pwm_max_cdf                  ;	// 0x012c : ''
	M14B0_LED_PWM_EXT_MAX                  	led_pwm_ext_max                  ;	// 0x0130 : ''
	M14B0_LED_PWM_FR_MAX_WEI               	led_pwm_fr_max_wei               ;	// 0x0134 : ''
	M14B0_LED_PWM_X1_X2                    	led_pwm_x1_x2                    ;	// 0x0138 : ''
	M14B0_LED_PWM_X3_X4                    	led_pwm_x3_x4                    ;	// 0x013c : ''
	M14B0_LED_PWM_Y0_Y1                    	led_pwm_y0_y1                    ;	// 0x0140 : ''
	M14B0_LED_PWM_Y2_Y3                    	led_pwm_y2_y3                    ;	// 0x0144 : ''
	M14B0_LED_PWM_Y4_Y5                    	led_pwm_y4_y5                    ;	// 0x0148 : ''
	M14B0_LED_PWM_BV_FR_MAX_RD            	led_pwm_bv_fr_max_rd             ;	// 0x014c : ''
	M14B0_LED_PWM_MAX_RD                   	led_pwm_max_rd                   ;	// 0x0150 : ''
	M14B0_LED_PWM_VALUE_RD                 	led_pwm_value_rd                 ;	// 0x0154 : ''
	M14B0_LED_PWM_IIR_WEI                  	led_pwm_iir_wei                  ;	// 0x0158 : ''
	M14B0_LED_PWM_SC_IIR_STEP_C            	led_pwm_sc_iir_step_c            ;	// 0x015c : ''
	M14B0_LED_PWM_SC_IIR_STEP_P            	led_pwm_sc_iir_step_p            ;	// 0x0160 : ''
	M14B0_LED_PWM_ADJ_IIR_WEI_RD           	led_pwm_adj_iir_wei_rd           ;	// 0x0164 : ''
	M14B0_LED_PWM_MAF_IIR_STEP_C          	led_pwm_maf_iir_step_c           ;	// 0x0168 : ''
	M14B0_LED_PWM_MAF_IIR_STEP_P           led_pwm_maf_iir_step_p           ;	// 0x016c : ''
	M14B0_LED_PWM_MAF_IIR_MAG_RD          led_pwm_maf_iir_mag_rd           ;	// 0x0170 : ''
	M14B0_LED_PWM_EXT_VAL_PEL              	led_pwm_ext_val_pel              ;	// 0x0174 : ''
	M14B0_LED_PWM_BL_TDIF_TH               	led_pwm_bl_tdif_th               ;	// 0x0178 : ''
	UINT32                          	                 	_rsvd_05[   1];	// 0x017c
	M14B0_LED_MAX_OPT                      	led_max_opt                      ;	// 0x0180 : ''
	M14B0_LED_BLK_MAX_MODE                 	led_blk_max_mode                 ;	// 0x0184 : ''
	M14B0_LED_MAX_OPT_MODE                 	led_max_opt_mode                 ;	// 0x0188 : ''
	M14B0_LED_MAX_OPT0_1                   	led_max_opt0_1                   ;	// 0x018c : ''
	M14B0_LED_LEVEL_TH                     		led_level_th                     ;	// 0x0190 : ''
	M14B0_LED_NUMBER_TH                    	led_number_th                    ;	// 0x0194 : ''
	M14B0_LED_APL                          		led_apl                          ;	// 0x0198 : ''
	M14B0_LED_BV_GEN_X1_X2                 	led_bv_gen_x1_x2                 ;	// 0x019c : ''
	M14B0_LED_BV_GEN_X3_X4                 	led_bv_gen_x3_x4                 ;	// 0x01a0 : ''
	M14B0_LED_BV_GEN_Y0_Y1                 	led_bv_gen_y0_y1                 ;	// 0x01a4 : ''
	M14B0_LED_BV_GEN_Y2_Y3                 	led_bv_gen_y2_y3                 ;	// 0x01a8 : ''
	M14B0_LED_BV_GEN_Y4_Y5                 	led_bv_gen_y4_y5                 ;	// 0x01ac : ''
	M14B0_LED_BV_GEN_BV_MAX                	led_bv_gen_bv_max                ;	// 0x01b0 : ''
	M14B0_LED_BV_MIN_MAX                   	led_bv_min_max                   ;	// 0x01b4 : ''
	UINT32                          	                 	_rsvd_06[   2];	// 0x01b8 ~ 0x01bc
	M14B0_LED_BV_RCTRL_MODE                	led_bv_rctrl_mode                ;	// 0x01c0 : ''
	M14B0_LED_PIC_ATTR                     		led_pic_attr                     ;	// 0x01c4 : ''
	M14B0_LED_LR_SYNC_SEL                  	led_lr_sync_sel                  ;	// 0x01c8 : ''
	UINT32                          	                 	_rsvd_07[  13];	// 0x01cc ~ 0x01fc
	M14B0_LED_SC_MAG_GN_TH                 	led_sc_mag_gn_th                 ;	// 0x0200 : ''
	M14B0_LED_SC_MAG_INFO                  	led_sc_mag_info                  ;	// 0x0204 : ''
	UINT32                          	                 	_rsvd_08[  14];	// 0x0208 ~ 0x023c
	M14B0_LED_LUT_MODE                     	led_lut_mode                     ;	// 0x0240 : ''
	M14B0_LED_EX_ABV                       		led_ex_abv                       ;	// 0x0244 : ''
	M14B0_LED_SG_L_H                       		led_sg_l_h                       ;	// 0x0248 : ''
	M14B0_LED_DC_LUT_RADDR                 	led_dc_lut_raddr                 ;	// 0x024c : ''
	M14B0_LED_DC_LUT_RDATA                 	led_dc_lut_rdata                 ;	// 0x0250 : ''
	M14B0_LED_BV_GAIN                      		led_bv_gain                      ;	// 0x0254 : ''
	M14B0_LED_LUT_AVG_SEL                  	led_lut_avg_sel                  ;	// 0x0258 : ''
	M14B0_LED_LUT_OFFSET_EN                	led_lut_offset_en                ;	// 0x025c : ''
	M14B0_LED_LUT_OFFSET_X1_X2             	led_lut_offset_x1_x2             ;	// 0x0260 : ''
	M14B0_LED_LUT_OFFSET_X3_X4             	led_lut_offset_x3_x4             ;	// 0x0264 : ''
	M14B0_LED_LUT_OFFSET_Y0_Y1             	led_lut_offset_y0_y1             ;	// 0x0268 : ''
	M14B0_LED_LUT_OFFSET_Y2_Y3             	led_lut_offset_y2_y3             ;	// 0x026c : ''
	M14B0_LED_LUT_OFFSET_Y4_Y5             	led_lut_offset_y4_y5             ;	// 0x0270 : ''
	M14B0_LED_LD_SMOOTH_OFF                	led_ld_smooth_off                ;	// 0x0274 : ''
	M14B0_LED_LD_SMOOTH_OFF_STEP         	led_ld_smooth_off_step           ;	// 0x0278 : ''
	M14B0_LED_LD_BV_EXT_MAX                	led_ld_bv_ext_max                ;	// 0x027c : ''
	M14B0_LED_UMASK_UM_EN                  	led_umask_um_en                  ;	// 0x0280 : ''
	M14B0_LED_UMASK_5X5                    	led_umask_5x5                    ;	// 0x0284 : ''
	M14B0_LED_UMASK_COARING                	led_umask_coaring                ;	// 0x0288 : ''
	M14B0_LED_UMASK_GAIN                   	led_umask_gain                   ;	// 0x028c : ''
	M14B0_LED_UMASK_WR_COEFF               	led_umask_wr_coeff               ;	// 0x0290 : ''
	M14B0_LED_UMASK_RD_COEFF               	led_umask_rd_coeff               ;	// 0x0294 : ''
	UINT32                          	                 	_rsvd_09[  10];	// 0x0298 ~ 0x02bc
	M14B0_LED_T_SF                         		led_t_sf                         ;	// 0x02c0 : ''
	M14B0_LED_KMODE                        		led_kmode                        ;	// 0x02c4 : ''
	M14B0_LED_HVKMASK                      	led_hvkmask                      ;	// 0x02c8 : ''
	UINT32                          	                 	_rsvd_10[  13];	// 0x02cc ~ 0x02fc
	M14B0_LED_TF_OPMODE                    	led_tf_opmode                    ;	// 0x0300 : ''
	M14B0_LED_A_PARA                       		led_a_para                       ;	// 0x0304 : ''
	M14B0_LED_SC_ADJ_EN                    	led_sc_adj_en                    ;	// 0x0308 : ''
	M14B0_LED_MD_ADJ_EN                    	led_md_adj_en                    ;	// 0x030c : ''
	M14B0_LED_MD_X1                        		led_md_x1                        ;	// 0x0310 : ''
	M14B0_LED_MD_X2                        		led_md_x2                        ;	// 0x0314 : ''
	M14B0_LED_MD_X3                        		led_md_x3                        ;	// 0x0318 : ''
	M14B0_LED_MD_X4                        		led_md_x4                        ;	// 0x031c : ''
	M14B0_LED_MD_Y0                        		led_md_y0                        ;	// 0x0320 : ''
	M14B0_LED_MD_Y1                        		led_md_y1                        ;	// 0x0324 : ''
	M14B0_LED_MD_Y2                        		led_md_y2                        ;	// 0x0328 : ''
	M14B0_LED_MD_Y3                        		led_md_y3                        ;	// 0x032c : ''
	M14B0_LED_MD_Y4                        		led_md_y4                        ;	// 0x0330 : ''
	M14B0_LED_MD_Y5                        		led_md_y5                        ;	// 0x0334 : ''
	UINT32                          	                 	_rsvd_11[   2];	// 0x0338 ~ 0x033c
	M14B0_LED_LED_MODE                     	led_led_mode                     ;	// 0x0340 : ''
	M14B0_LED_LRES_BNH_BNV                 	led_lres_bnh_bnv                 ;	// 0x0344 : ''
	M14B0_LED_LRES_BSH_BSV                 	led_lres_bsh_bsv                 ;	// 0x0348 : ''
	M14B0_LED_SBI_BNH_BNV                  	led_sbi_bnh_bnv                  ;	// 0x034c : ''
	M14B0_LED_SBI_BSH_BSV                  	led_sbi_bsh_bsv                  ;	// 0x0350 : ''
	M14B0_LED_TAB1_RD_SEL                  	led_tab1_rd_sel                  ;	// 0x0354 : ''
	M14B0_LED_TAB1_RDATA                   	led_tab1_rdata                   ;	// 0x0358 : ''
	M14B0_LED_TAB5_RD_SEL                  	led_tab5_rd_sel                  ;	// 0x035c : ''
	M14B0_LED_TAB5_RDATA                   	led_tab5_rdata                   ;	// 0x0360 : ''
	M14B0_LED_HFC_RD_SEL                   	led_hfc_rd_sel                   ;	// 0x0364 : ''
	M14B0_LED_HFC_RDATA                    	led_hfc_rdata                    ;	// 0x0368 : ''
	M14B0_LED_VFC_RD_SEL                   	led_vfc_rd_sel                   ;	// 0x036c : ''
	M14B0_LED_VFC_RDATA                    	led_vfc_rdata                    ;	// 0x0370 : ''
	M14B0_LED_POLARIS_MODE                 	led_polaris_mode                 ;	// 0x0374 : ''
	UINT32                          	                 	_rsvd_12[   2];	// 0x0378 ~ 0x037c
	M14B0_LED_COMP_EN                      	led_comp_en                      ;	// 0x0380 : ''
	M14B0_LED_CONT_GAIN                    	led_cont_gain                    ;	// 0x0384 : ''
	M14B0_LED_COMP_IN                      		led_comp_in                      ;	// 0x0388 : ''
	M14B0_LED_PC_RADDR                     	led_pc_raddr                     ;	// 0x038c : ''
	M14B0_LED_PC_RDATA                     	led_pc_rdata                     ;	// 0x0390 : ''
	UINT32                          	                 	_rsvd_13[  27];	// 0x0394 ~ 0x03fc
	M14B0_LED_GBL                          		led_gbl                          ;	// 0x0400 : ''
	M14B0_LED_ABV_CMP_VALUE                	led_abv_cmp_value                ;	// 0x0404 : ''
	M14B0_LED_BV_DLY                       		led_bv_dly                       ;	// 0x0408 : ''
	M14B0_LED_BLU_BV_SEL                   	led_blu_bv_sel                   ;	// 0x040c : ''
	UINT32                          	                 	_rsvd_14[  12];	// 0x0410 ~ 0x043c
	M14B0_LED_INSTR_WR_REQ                 	led_instr_wr_req                 ;	// 0x0440 : ''
	M14B0_LED_INSTR_WDATA                  	led_instr_wdata                  ;	// 0x0444 : ''
	M14B0_LED_INSTR_RDATA                  	led_instr_rdata                  ;	// 0x0448 : ''
	M14B0_LED_INSTR_DGB                    	led_instr_dgb                    ;	// 0x044c : ''
	UINT32                          	                 	_rsvd_15[  12];	// 0x0450 ~ 0x047c
	M14B0_LED_BLC_MODE                     	led_blc_mode                     ;	// 0x0480 : ''
	M14B0_LED_BSF_C0                       		led_bsf_c0                       ;	// 0x0484 : ''
	M14B0_LED_BSF_C1                       		led_bsf_c1                       ;	// 0x0488 : ''
	M14B0_LED_BSF_C2                       		led_bsf_c2                       ;	// 0x048c : ''
	M14B0_LED_BSF_RATIO0                   	led_bsf_ratio0                   ;	// 0x0490 : ''
	M14B0_LED_BSF_RATIO1                   	led_bsf_ratio1                   ;	// 0x0494 : ''
	M14B0_LED_BSF_RATIO2                   	led_bsf_ratio2                   ;	// 0x0498 : ''
	M14B0_LED_A0_GN                        		led_a0_gn                        ;	// 0x049c : ''
	M14B0_LED_A1_GN                        		led_a1_gn                        ;	// 0x04a0 : ''
	M14B0_LED_A2_GN                        		led_a2_gn                        ;	// 0x04a4 : ''
	M14B0_LED_A0_RATIO                     		led_a0_ratio                     ;	// 0x04a8 : ''
	M14B0_LED_A1_RATIO                     		led_a1_ratio                     ;	// 0x04ac : ''
	M14B0_LED_DRV_MAX                      	led_drv_max                      ;	// 0x04b0 : ''
	M14B0_LED_BLC_EN                       		led_blc_en                       ;	// 0x04b4 : ''
	M14B0_LED_BLC_TEMPO_TH                 	led_blc_tempo_th                 ;	// 0x04b8 : ''
	M14B0_LED_BLC_FRAME_NUM                	led_blc_frame_num                ;	// 0x04bc : ''
	M14B0_LED_MEM_ADDR_CLR                 	led_mem_addr_clr                 ;	// 0x04c0 : ''
	M14B0_LED_MEM_DL_SBI_HCOEFF            	led_mem_dl_sbi_hcoeff            ;	// 0x04c4 : ''
	M14B0_LED_MEM_DL_SBI_VCOEFF            	led_mem_dl_sbi_vcoeff            ;	// 0x04c8 : ''
	M14B0_LED_MEM_DL_PIXEL_COMP_A         led_mem_dl_pixel_comp_a          ;	// 0x04cc : ''
	M14B0_LED_MEM_DL_PIXEL_COMP_B         led_mem_dl_pixel_comp_b          ;	// 0x04d0 : ''
	M14B0_LED_MEM_DL_PIXEL_COMP_C         led_mem_dl_pixel_comp_c          ;	// 0x04d4 : ''
	M14B0_LED_MEM_DL_PIXEL_COMP_D         led_mem_dl_pixel_comp_d          ;	// 0x04d8 : ''
	M14B0_LED_UPPER_DC_LUT                 	led_upper_dc_lut                 ;	// 0x04dc : ''
	M14B0_LED_LOWER_DC_LUT                 	led_lower_dc_lut                 ;	// 0x04e0 : ''
	M14B0_LED_FC_TAB1                      		led_fc_tab1                      ;	// 0x04e4 : ''
	M14B0_LED_FC_TAB5                      		led_fc_tab5                      ;	// 0x04e8 : ''
	UINT32                          	                 	_rsvd_16[   5];	// 0x04ec ~ 0x04fc
	M14B0_LED_MEAN_IN_SEL                  	led_mean_in_sel                  ;	// 0x0500 : ''
	M14B0_LED_MEAN                         		led_mean                         ;	// 0x0504 : ''
	UINT32                          	                 	_rsvd_17[  14];	// 0x0508 ~ 0x053c
	M14B0_LED_RP_HV_POS                    	led_rp_hv_pos                    ;	// 0x0540 : ''
	M14B0_LED_RP_MAKE_EN                   	led_rp_make_en                   ;	// 0x0544 : ''
	M14B0_LED_RP_R_VALUE                   	led_rp_r_value                   ;	// 0x0548 : ''
	M14B0_LED_RP_G_VALUE                   	led_rp_g_value                   ;	// 0x054c : ''
	M14B0_LED_RP_B_VALUE                   	led_rp_b_value                   ;	// 0x0550 : ''
	UINT32                          	                 	_rsvd_18[   1];	// 0x0554
	M14B0_LED_ALEF2_MODE                   	led_alef2_mode                   ;	// 0x0558 : ''
	M14B0_LED_ALEF2_BLOCK_NUM              	led_alef2_block_num              ;	// 0x055c : ''
	M14B0_LED_ALEF2_ADDR_CLR               	led_alef2_addr_clr               ;	// 0x0560 : ''
	M14B0_LED_ALEF2_CFG_LUT                	led_alef2_cfg_lut                ;	// 0x0564 : ''
	M14B0_LED_ALEF2_CFG_LUT_RD             	led_alef2_cfg_lut_rd             ;	// 0x0568 : ''
	M14B0_LED_ALEF2_GAIN_LUT               	led_alef2_gain_lut               ;	// 0x056c : ''
	M14B0_LED_ALEF2_GAIN_LUT_RD            	led_alef2_gain_lut_rd            ;	// 0x0570 : ''
	M14B0_LED_ALEF2_MAXOPT_LUT             	led_alef2_maxopt_lut             ;	// 0x0574 : ''
	M14B0_LED_ALEF2_MAXOPT_LUT_RD         led_alef2_maxopt_lut_rd          ;	// 0x0578 : ''
	M14B0_LED_ALEF2_MAXVALUE_EN            	led_alef2_maxvalue_en            ;	// 0x057c : ''
	M14B0_LED_DISP_BV_EN                   	led_disp_bv_en                   ;	// 0x0580 : ''
	M14B0_LED_DSIP_BV_ADDR                 	led_dsip_bv_addr                 ;	// 0x0584 : ''
	UINT32                          	                 	_rsvd_19[  14];	// 0x0588 ~ 0x05bc
	M14B0_LED_DITHER_EN                    	led_dither_en                    ;	// 0x05c0 : ''
	UINT32                          	                 	_rsvd_20[   3];	// 0x05c4 ~ 0x05cc
	M14B0_LED_BLU_GAIN_EN                  	led_blu_gain_en                  ;	// 0x05d0 : ''
	M14B0_LED_BLU_GAIN_ADDR_CLR            	led_blu_gain_addr_clr            ;	// 0x05d4 : ''
	M14B0_LED_BLU_GAIN_WD                  	led_blu_gain_wd                  ;	// 0x05d8 : ''
	M14B0_LED_BLU_GAIN_RD                  	led_blu_gain_rd                  ;	// 0x05dc : ''
	UINT32                          	                 	_rsvd_21[  88];	// 0x05e0 ~ 0x073c
	M14B0_LED_WCG_EN                       		led_wcg_en                       ;	// 0x0740 : ''
	M14B0_LED_WCG_DBG_EN                   	led_wcg_dbg_en                   ;	// 0x0744 : ''
	M14B0_LED_WCG_MEM_WR_MODE            	led_wcg_mem_wr_mode              ;	// 0x0748 : ''
	M14B0_LED_WCG_MEM_SEL                  	led_wcg_mem_sel                  ;	// 0x074c : ''
	M14B0_LED_WCG_MEM_WADDR                led_wcg_mem_waddr                ;	// 0x0750 : ''
	M14B0_LED_WCG_MEM_WDATA                led_wcg_mem_wdata                ;	// 0x0754 : ''
	M14B0_LED_WCG_MEM_REN                  	led_wcg_mem_ren                  ;	// 0x0758 : ''
	M14B0_LED_WCG_MEM_RADDR                	led_wcg_mem_raddr                ;	// 0x075c : ''
	M14B0_LED_WCG_MEM_RDATA                	led_wcg_mem_rdata                ;	// 0x0760 : ''
	M14B0_LED_WCG_MISS_MATCH_IND         	led_wcg_miss_match_ind           ;	// 0x0764 : ''
	UINT32                                          	_rsvd_22[1574]				;       // 0x0768 ~ 0x1FFC"
	M14B0_LED_BLU_BLK_NUM_HV               	led_blu_blk_num_hv               ;	// 0x2000 : ''
	M14B0_LED_VS_MODE                      	led_vs_mode                      ;	// 0x2004 : ''
	M14B0_LED_BLU_VS_NUM                   	led_blu_vs_num                   ;	// 0x2008 : ''
	M14B0_LED_BLU_VS_T0                    	led_blu_vs_t0                    ;	// 0x200c : ''
	M14B0_LED_VS_DLY                       		led_vs_dly                       ;	// 0x2010 : ''
	M14B0_LED_I2C_SLAVE_ADDR               	led_i2c_slave_addr               ;	// 0x2014 : ''
	M14B0_LED_I2C_CONF                     		led_i2c_conf                     ;	// 0x2018 : ''
	M14B0_LED_VERSION                      		led_version                      ;	// 0x201c : ''
	M14B0_LED_GENERAL_REG0                 	led_general_reg0                 ;	// 0x2020 : ''
	M14B0_LED_GENERAL_REG1                 	led_general_reg1                 ;	// 0x2024 : ''
	M14B0_LED_GENERAL_REG2                 	led_general_reg2                 ;	// 0x2028 : ''
	M14B0_LED_GENERAL_REG3                 	led_general_reg3                 ;	// 0x202c : ''
	UINT32                          	                 	_rsvd_23[   4];	// 0x2030 ~ 0x203c
	M14B0_LED_I2C_RD_ON                    	led_i2c_rd_on                    ;	// 0x2040 : ''
	M14B0_LED_I2C_RD_ADDR                  	led_i2c_rd_addr                  ;	// 0x2044 : ''
	M14B0_LED_I2C_RD_DATA                  	led_i2c_rd_data                  ;	// 0x2048 : ''
	UINT32                          	                 	_rsvd_24[  13];	// 0x204c ~ 0x207c
	M14B0_LED_SPI_CFG0                     		led_spi_cfg0                     ;	// 0x2080 : ''
	M14B0_LED_SPI_CMD_MODE                 	led_spi_cmd_mode                 ;	// 0x2084 : ''
	M14B0_LED_M_SPI_CH_MASK                	led_m_spi_ch_mask                ;	// 0x2088 : ''
	M14B0_LED_SPI_IDC01                    		led_spi_idc01                    ;	// 0x208c : ''
	M14B0_LED_SPI_IDC23                    		led_spi_idc23                    ;	// 0x2090 : ''
	M14B0_LED_SPI_CMD01                    	led_spi_cmd01                    ;	// 0x2094 : ''
	M14B0_LED_SPI_CMD23                    	led_spi_cmd23                    ;	// 0x2098 : ''
	M14B0_LED_SCLK_T1                      		led_sclk_t1                      ;	// 0x209c : ''
	M14B0_LED_SCLK_T2                      		led_sclk_t2                      ;	// 0x20a0 : ''
	M14B0_LED_SCLK_T3                      		led_sclk_t3                      ;	// 0x20a4 : ''
	M14B0_LED_SCLK_T4                      		led_sclk_t4                      ;	// 0x20a8 : ''
	M14B0_LED_SCLK_T5                      		led_sclk_t5                      ;	// 0x20ac : ''
	UINT32                          	                 	_rsvd_25[   4];	// 0x20b0 ~ 0x20bc
	M14B0_LED_BLK_SP0                      		led_blk_sp0                      ;	// 0x20c0 : ''
	M14B0_LED_BLK_SP1                      		led_blk_sp1                      ;	// 0x20c4 : ''
	M14B0_LED_BLK_SP2                      		led_blk_sp2                      ;	// 0x20c8 : ''
	M14B0_LED_BLK_SP3                      		led_blk_sp3                      ;	// 0x20cc : ''
	M14B0_LED_BNH_SEG0                     	led_bnh_seg0                     ;	// 0x20d0 : ''
	M14B0_LED_BNH_SEG1                     	led_bnh_seg1                     ;	// 0x20d4 : ''
	M14B0_LED_BNH_SEG2                     	led_bnh_seg2                     ;	// 0x20d8 : ''
	M14B0_LED_BNH_SEG3                     	led_bnh_seg3                     ;	// 0x20dc : ''
	M14B0_LED_BNV_SEG0                     	led_bnv_seg0                     ;	// 0x20e0 : ''
	M14B0_LED_BNV_SEG1                     	led_bnv_seg1                     ;	// 0x20e4 : ''
	M14B0_LED_BNV_SEG2                     	led_bnv_seg2                     ;	// 0x20e8 : ''
	M14B0_LED_BNV_SEG3                     	led_bnv_seg3                     ;	// 0x20ec : ''
	M14B0_LED_REVERSE                      		led_reverse                      ;	// 0x20f0 : ''
	UINT32                          	                 	_rsvd_26[   3];	// 0x20f4 ~ 0x20fc
	M14B0_LED_PWM_VALUE                    	led_pwm_value                    ;	// 0x2100 : ''
	UINT32                          				led_blu_maxval_en                ;	// 0x2104 : ''
	M14B0_LED_SPI_ALEF2_EN                 	led_spi_alef2_en                 ;	// 0x2108 : ''
	M14B0_LED_SPI_ALEF2_CLR                	led_spi_alef2_clr                ;	// 0x210c : ''
	M14B0_LED_SPI0_ALEF2_LUT               	led_spi0_alef2_lut               ;	// 0x2110 : ''
	M14B0_LED_SPI0_ALEF2_LUT_RD            	led_spi0_alef2_lut_rd            ;	// 0x2114 : ''
	M14B0_LED_SPI1_ALEF2_LUT               	led_spi1_alef2_lut               ;	// 0x2118 : ''
	M14B0_LED_SPI1_ALEF2_LUT_RD            	led_spi1_alef2_lut_rd            ;	// 0x211c : ''
	M14B0_LED_SPI2_ALEF2_LUT               	led_spi2_alef2_lut               ;	// 0x2120 : ''
	M14B0_LED_SPI2_ALEF2_LUT_RD            	led_spi2_alef2_lut_rd            ;	// 0x2124 : ''
	M14B0_LED_SPI3_ALEF2_LUT               	led_spi3_alef2_lut               ;	// 0x2128 : ''
	M14B0_LED_SPI3_ALEF2_LUT_RD            	led_spi3_alef2_lut_rd            ;	// 0x212c : ''
	UINT32                          	                 	_rsvd_27[   4];	// 0x2130 ~ 0x213c
	M14B0_LED_EXT_INT_EN                   	led_ext_int_en                   ;	// 0x2140 : ''
	M14B0_LED_EXT_INT_STATUS               	led_ext_int_status               ;	// 0x2144 : ''
	M14B0_LED_EXT_INT_RAW_STATUS          led_ext_int_raw_status           ;	// 0x2148 : ''
	M14B0_LED_EXT_INT_CLR                  	led_ext_int_clr                  ;	// 0x214c : ''
	M14B0_LED_EXT_INT_LINE_NUM             	led_ext_int_line_num             ;	// 0x2150 : ''
} DPPB_LED_REG_M14B0_T;

/*
 * for HDR control
 */

/*-----------------------------------------------------------------------------
		0xc00248c0L pe1_fsw_ctrl_00 '
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_s_status_0                     : 8 ;  //  7: 0
	UINT32 reg_s_status_1                     : 8 ;  // 15: 8
	UINT32 reg_s_apl_0                        : 8 ;  // 23:16
	UINT32 reg_fmd_en_0                       : 1 ;  //    24
	UINT32 reg_fmd_en_1                       : 1 ;  //    25
	UINT32 reg_tnr_auto_en                    : 1 ;  //    26
	UINT32 cl_filter_en_stat                  : 1 ;  //    27
	UINT32 clc_detection_en_stat              : 1 ;  //    28
	UINT32 reg_color_filter_status            : 2 ;  // 30:29
	UINT32 reg_drc_use_shp                    : 1 ;  //    31
} M14B0_PE1_FSW_CTRL_00_T;

/*-----------------------------------------------------------------------------
		0xc00248c4L pe1_fsw_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_drc_store_mode                 : 1 ;  //     0
	UINT32 reg_drc_dc_bypass                  : 1 ;  //     1
	UINT32 reg_drc_dc_sc                      : 1 ;  //     2
	UINT32 reg_shp_fw_en                      : 1 ;  //     3
} M14B0_PE1_FSW_CTRL_01_T;

typedef struct {
	M14B0_PE1_FSW_CTRL_00_T         	pe1_fsw_ctrl_00;              //0xc00248c0L
	M14B0_PE1_FSW_CTRL_01_T         	pe1_fsw_ctrl_01;              //0xc00248c4L
} PE1_HDR_REG_M14B0_T;

#endif //#ifndef _REG_DPPB_M14B0_h
