/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
	GNU General Public License for more details.
*/

#ifndef _REG_OVI_H15A0_h
#define _REG_OVI_H15A0_h

/*
	OVI_OIF (DPE OIF) : Base Addr 0xC8010000
*/

/*-----------------------------------------------------------------------------
	0x0000 oif_vch_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vch_hb_width                    :12,	//  0:11
	vch_out_h_width                 :12,	// 12:23
	vch_out_port                    : 2,	// 24:25
	vch_in_port						: 2,	// 26:27
	vch_h_reverse                   : 1,	//    28
	vch_line_delay                  : 1;	//    29
} H15A0_OVI_OIF_VCH_CONFIG;

/*-----------------------------------------------------------------------------
	0x0004 oif_och_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	och_hb_width                    :12,	//  0:11
	och_out_h_width                 :12,	// 12:23
	och_out_port                    : 2,	// 24:25
	och_h_reverse                   : 1,	//    26
	och_line_delay                  : 1;	//    27
} H15A0_OVI_OIF_OCH_CONFIG;

/*-----------------------------------------------------------------------------
	0x0008 oif_vx1_config0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_sel_v0                      :25,	//  0:24
	vx1_out_mode                    : 1,	//    25
	vx1_en                          : 1;	//    26
} H15A0_OVI_OIF_VX1_CONFIG0;

/*-----------------------------------------------------------------------------
	0x000c oif_vx1_config1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_sel_v1			          	:23;	//  0:22
} H15A0_OVI_OIF_VX1_CONFIG1;

/*-----------------------------------------------------------------------------
	0x0010 oif_vx1_config2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_sel_o              			:13,	//  0:12
	vx1_resv7              			:2,		// 13:14
	vx1_resv6              			:2,		// 15:16
	vx1_resv5              			:2,		// 17:18
	vx1_resv4              			:2,		// 19:20
	vx1_resv3              			:2,		// 21:22
	vx1_resv2              			:2,		// 23:24
	vx1_resv1              			:2,		// 25:26
	vx1_resv0              			:2,		// 27:28
	vx1_resv_sel              		:3;		// 29:31
} H15A0_OVI_OIF_VX1_CONFIG2;

/*-----------------------------------------------------------------------------
	0x0014 oif_vx1_config3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_force_even_data          	:31;	//  0:30
} H15A0_OVI_OIF_VX1_CONFIG3;

/*-----------------------------------------------------------------------------
	0x0018 oif_vx1_config4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vx1_force_odd_data          	:31;	//  0:30
} H15A0_OVI_OIF_VX1_CONFIG4;

/*-----------------------------------------------------------------------------
	0x001c oif_lvds_config0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_sel                        :15,	//  0:14
	lvds_swap                       : 1,	//    15
	lvds_8bit_mode                  : 1,	//    16
	lvds_lsb_first                  : 1;	//    17
} H15A0_OVI_OIF_LVDS_CONFIG0;

/*-----------------------------------------------------------------------------
	0x0020 oif_lvds_config1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_even_data            :31;	//  0:30
} H15A0_OVI_OIF_LVDS_CONFIG1;

/*-----------------------------------------------------------------------------
	0x0024 oif_lvds_config2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_odd_data             :31;	//  0:30
} H15A0_OVI_OIF_LVDS_CONFIG2;

/*-----------------------------------------------------------------------------
	0x0028 oif_lvds_config3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lvds_force_data                 :16,	//  0:15
	lvds_force_en                   :16;	// 16:31
} H15A0_OVI_OIF_LVDS_CONFIG3;

/*-----------------------------------------------------------------------------
	0x0040 oif_p2i_config ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_sync_ctrl                   : 3,	//  0: 2
	p2i_top_reset                   : 1,	//     3
	p2i_enable                      : 1;	//     4
} H15A0_OVI_OIF_P2I_CONFIG;

/*-----------------------------------------------------------------------------
	0x0044 oif_p2i_hfp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_hfp                         :12;	//  0:11
} H15A0_OVI_OIF_P2I_HFP;

/*-----------------------------------------------------------------------------
	0x0048 oif_p2i_hsync ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_hsync                       :12;	//  0:11
} H15A0_OVI_OIF_P2I_HSYNC;

/*-----------------------------------------------------------------------------
	0x004c oif_p2i_hbp ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_hbp                         :12;	//  0:11
} H15A0_OVI_OIF_P2I_HBP;

/*-----------------------------------------------------------------------------
	0x0050 oif_p2i_ha ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_ha                          :12;	//  0:11
} H15A0_OVI_OIF_P2I_HA;

/*-----------------------------------------------------------------------------
	0x0054 oif_p2i_hn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_hn                          :12;	//  0:11
} H15A0_OVI_OIF_P2I_HN;

/*-----------------------------------------------------------------------------
	0x0058 oif_p2i_vsync ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vsync                       :12;	//  0:11
} H15A0_OVI_OIF_P2I_VSYNC;

/*-----------------------------------------------------------------------------
	0x005c oif_p2i_vbp0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vbp0                        :12;	//  0:11
} H15A0_OVI_OIF_P2I_VBP0;

/*-----------------------------------------------------------------------------
	0x0060 oif_p2i_vbp1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vbp1                        :12;	//  0:11
} H15A0_OVI_OIF_P2I_VBP1;

/*-----------------------------------------------------------------------------
	0x0064 oif_p2i_va ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_va                          :12;	//  0:11
} H15A0_OVI_OIF_P2I_VA;

/*-----------------------------------------------------------------------------
	0x0068 oif_p2i_vn ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vn                          :12;	//  0:11
} H15A0_OVI_OIF_P2I_VN;

/*-----------------------------------------------------------------------------
	0x006c oif_p2i_vris0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vris0                       :12;	//  0:11
} H15A0_OVI_OIF_P2I_VRIS0;

/*-----------------------------------------------------------------------------
	0x0070 oif_p2i_vris1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	p2i_vris1                       :12;	//  0:11
} H15A0_OVI_OIF_P2I_VRIS1;

/*-----------------------------------------------------------------------------
	0x0074 oif_comp_ctrl0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_gen_mode                    : 2,	//  0: 1
	_rsvd_00                                : 1,	//     2 reserved
	reg_pattern                     : 1,	//     3
	reg_mv_mode                     : 1,	//     4
	reg_csc_disable                 : 1,	//     5
	reg_csc_mode                    : 1,	//     6
	_rsvd_01                                : 1,	//     7 reserved
	reg_hsync                       : 8,	//  8:15
	reg_hfp                         :10;	// 16:25
} H15A0_OVI_OIF_COMP_CTRL0;

/*-----------------------------------------------------------------------------
	0x0078 oif_comp_ctrl1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_hbp                         :10,	//  0: 9
	_rsvd                                : 6,	// 10:15 reserved
	reg_vsync                       : 8;	// 16:23
} H15A0_OVI_OIF_COMP_CTRL1;

/*-----------------------------------------------------------------------------
	0x007c oif_comp_ctrl2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_tri_pos_level               : 8,	//  0: 7
	reg_tri_clm_level               : 8,	//  8:15
	reg_tri_neg_level               : 8;	// 16:23
} H15A0_OVI_OIF_COMP_CTRL2;

/*-----------------------------------------------------------------------------
	0x0080 oif_comp_ctrl3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_mv_win_v_start              : 8,	//  0: 7
	reg_mv_win_v_end                : 8,	//  8:15
	reg_mv_pseudo_start             :10;	// 16:25
} H15A0_OVI_OIF_COMP_CTRL3;

/*-----------------------------------------------------------------------------
	0x0084 oif_comp_ctrl4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_mv_pseudo_sync              :10,	//  0: 9
	_rsvd                                : 6,	// 10:15 reserved
	reg_mv_pseudo_agc               :10;	// 16:25
} H15A0_OVI_OIF_COMP_CTRL4;

/*-----------------------------------------------------------------------------
	0x0088 oif_comp_ctrl5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_mv_pseudo_period            :10,	//  0: 9
	_rsvd                                : 6,	// 10:15 reserved
	reg_mv_high_level               :10;	// 16:25
} H15A0_OVI_OIF_COMP_CTRL5;

/*-----------------------------------------------------------------------------
	0x008c oif_comp_ctrl6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_mv_low_level                :10,	//  0: 9
	_rsvd                                : 6,	// 10:15 reserved
	reg_ramp_level                  : 8;	// 16:23
} H15A0_OVI_OIF_COMP_CTRL6;

/*-----------------------------------------------------------------------------
	0x0090 oif_comp_ctrl7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_mv_vfp                      :10,	//  0: 9
	_rsvd                               : 6,	// 10:15 reserved
	reg_mv_vsync                    :10;	// 16:25
} H15A0_OVI_OIF_COMP_CTRL7;

/*-----------------------------------------------------------------------------
	0x0094 oif_comp_ctrl8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_mv_va                       :10;	//  0: 9
} H15A0_OVI_OIF_COMP_CTRL8;

/*-----------------------------------------------------------------------------
	0x0098 oif_comp_ctrl9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_black_level_y               :10,	//  0: 9
	_rsvd                                : 6,	// 10:15 reserved
	reg_map_slope_y                 : 8;	// 16:23
} H15A0_OVI_OIF_COMP_CTRL9;

/*-----------------------------------------------------------------------------
	0x009c oif_comp_ctrl10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_black_level_c               :10,	//  0: 9
	_rsvd                                : 6,	// 10:15 reserved
	reg_map_slope_c                 : 8;	// 16:23
} H15A0_OVI_OIF_COMP_CTRL10;

/*-----------------------------------------------------------------------------
	0x00a0 oif_comp_ctrl11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_hn                          :12,	//  0:11
	_rsvd                       		: 4,	// 12:15 reserved
	reg_vn                          :11;	// 16:26
} H15A0_OVI_OIF_COMP_CTRL11;

/*-----------------------------------------------------------------------------
	0x00a4 oif_comp_enable ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	s2d_en                          : 1,	//     0
	comp_en                         : 1;	//     1
} H15A0_OVI_OIF_COMP_ENABLE;

/*-----------------------------------------------------------------------------
	0x00c0 oif_vx1_lane_sel0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lane_sel3						: 5,  	//  0: 4
	_rsvd_00						: 3,  	//  5: 7     reserved
	lane_sel2						: 5,  	// 8: 12
	_rsvd_01						: 3,  	// 13:15     reserved
	lane_sel1						: 5,  	// 16:20
	_rsvd_02						: 3,  	// 21:23     reserved
	lane_sel0						: 5;  	// 24:28
} H15A0_OVI_OIF_VX1_LANE_SEL0;

/*-----------------------------------------------------------------------------
	0x00c4 oif_vx1_lane_sel1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lane_sel7						: 5,  	//  0: 4
	_rsvd_00						: 3,  	//  5: 7     reserved
	lane_sel6						: 5,  	// 8: 12
	_rsvd_01						: 3,  	// 13:15     reserved
	lane_sel5						: 5,  	// 16:20
	_rsvd_02						: 3,  	// 21:23     reserved
	lane_sel4						: 5;  	// 24:28
} H15A0_OVI_OIF_VX1_LANE_SEL1;

/*-----------------------------------------------------------------------------
	0x00c8 oif_vx1_lane_sel2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lane_sel11						: 5,  	//  0: 4
	_rsvd_00						: 3,  	//  5: 7     reserved
	lane_sel10						: 5,  	// 8: 12
	_rsvd_01						: 3,  	// 13:15     reserved
	lane_sel9						: 5,  	// 16:20
	_rsvd_02						: 3,  	// 21:23     reserved
	lane_sel8						: 5;  	// 24:28
} H15A0_OVI_OIF_VX1_LANE_SEL2;

/*-----------------------------------------------------------------------------
	0x00cc oif_lvds_link_sel0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	link_sel0						: 32;  	// 0: 31
} H15A0_OVI_OIF_LVDS_LINK_SEL0;

/*-----------------------------------------------------------------------------
	0x00d0 oif_lvds_link_sel1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	line_sel1						: 32;  	// 0: 31
} H15A0_OVI_OIF_LVDS_LINK_SEL1;

typedef struct {
	H15A0_OVI_OIF_VCH_CONFIG                  	oif_vch_config                  ;	// 0x0000 : ''
	H15A0_OVI_OIF_OCH_CONFIG                  	oif_och_config                  ;	// 0x0004 : ''
	H15A0_OVI_OIF_VX1_CONFIG0                 	oif_vx1_config0                 ;	// 0x0008 : ''
	H15A0_OVI_OIF_VX1_CONFIG1                 	oif_vx1_config1                 ;	// 0x000c : ''
	H15A0_OVI_OIF_VX1_CONFIG2                 	oif_vx1_config2                 ;	// 0x0010 : ''
	H15A0_OVI_OIF_VX1_CONFIG3                 	oif_vx1_config3                 ;	// 0x0014 : ''
	H15A0_OVI_OIF_VX1_CONFIG4					oif_vx1_config4					;	// 0x0018 : ''
	H15A0_OVI_OIF_LVDS_CONFIG0                	oif_lvds_config0                ;	// 0x001c : ''
	H15A0_OVI_OIF_LVDS_CONFIG1                	oif_lvds_config1                ;	// 0x0020 : ''
	H15A0_OVI_OIF_LVDS_CONFIG2                	oif_lvds_config2                ;	// 0x0024 : ''
	H15A0_OVI_OIF_LVDS_CONFIG3                	oif_lvds_config3                ;	// 0x0028 : ''
	UINT32                          	        _rsvd_00[   5]					;	// 0x002c ~ 0x003c
	H15A0_OVI_OIF_P2I_CONFIG                  	oif_p2i_config                  ;	// 0x0040 : ''
	H15A0_OVI_OIF_P2I_HFP                     	oif_p2i_hfp                     ;	// 0x0044 : ''
	H15A0_OVI_OIF_P2I_HSYNC                   	oif_p2i_hsync                   ;	// 0x0048 : ''
	H15A0_OVI_OIF_P2I_HBP                     	oif_p2i_hbp                     ;	// 0x004c : ''
	H15A0_OVI_OIF_P2I_HA                      	oif_p2i_ha                      ;	// 0x0050 : ''
	H15A0_OVI_OIF_P2I_HN                      	oif_p2i_hn                      ;	// 0x0054 : ''
	H15A0_OVI_OIF_P2I_VSYNC                   	oif_p2i_vsync                   ;	// 0x0058 : ''
	H15A0_OVI_OIF_P2I_VBP0                    	oif_p2i_vbp0                    ;	// 0x005c : ''
	H15A0_OVI_OIF_P2I_VBP1                    	oif_p2i_vbp1                    ;	// 0x0060 : ''
	H15A0_OVI_OIF_P2I_VA                      	oif_p2i_va                      ;	// 0x0064 : ''
	H15A0_OVI_OIF_P2I_VN                      	oif_p2i_vn                      ;	// 0x0068 : ''
	H15A0_OVI_OIF_P2I_VRIS0                   	oif_p2i_vris0                   ;	// 0x006c : ''
	H15A0_OVI_OIF_P2I_VRIS1                   	oif_p2i_vris1                   ;	// 0x0070 : ''
	H15A0_OVI_OIF_COMP_CTRL0                  	oif_comp_ctrl0                  ;	// 0x0074 : ''
	H15A0_OVI_OIF_COMP_CTRL1                  	oif_comp_ctrl1                  ;	// 0x0078 : ''
	H15A0_OVI_OIF_COMP_CTRL2                  	oif_comp_ctrl2                  ;	// 0x007c : ''
	H15A0_OVI_OIF_COMP_CTRL3                  	oif_comp_ctrl3                  ;	// 0x0080 : ''
	H15A0_OVI_OIF_COMP_CTRL4                  	oif_comp_ctrl4                  ;	// 0x0084 : ''
	H15A0_OVI_OIF_COMP_CTRL5                  	oif_comp_ctrl5                  ;	// 0x0088 : ''
	H15A0_OVI_OIF_COMP_CTRL6                  	oif_comp_ctrl6                  ;	// 0x008c : ''
	H15A0_OVI_OIF_COMP_CTRL7                  	oif_comp_ctrl7                  ;	// 0x0090 : ''
	H15A0_OVI_OIF_COMP_CTRL8                  	oif_comp_ctrl8                  ;	// 0x0094 : ''
	H15A0_OVI_OIF_COMP_CTRL9                  	oif_comp_ctrl9                  ;	// 0x0098 : ''
	H15A0_OVI_OIF_COMP_CTRL10                 	oif_comp_ctrl10                 ;	// 0x009c : ''
	H15A0_OVI_OIF_COMP_CTRL11                 	oif_comp_ctrl11                 ;	// 0x00a0 : ''
	H15A0_OVI_OIF_COMP_ENABLE                 	oif_comp_enable                 ;	// 0x00a4 : ''
	UINT32                          	        _rsvd_01[   6]					;	// 0x00a8 ~ 0x00bc
	H15A0_OVI_OIF_VX1_LANE_SEL0					oif_vx1_lane_sel0				;	// 0x00c0 : "
	H15A0_OVI_OIF_VX1_LANE_SEL1					oif_vx1_lane_sel1				;	// 0x00c4 : "
	H15A0_OVI_OIF_VX1_LANE_SEL2					oif_vx1_lane_sel2				;	// 0x00c8 : "
	H15A0_OVI_OIF_LVDS_LINK_SEL0				oif_lvds_link_sel0				;	// 0x00cc : "
	H15A0_OVI_OIF_LVDS_LINK_SEL1				oif_lvds_link_sel1				; 	// 0x00d0 : "
} OVI_OIF_REG_H15A0_T;

/*
	OVI_LED (DPE LED) : Base Addr 0xC8020000
*/


/*-----------------------------------------------------------------------------
	0x0600 led_dpg_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_en					: 1,	//     0
	_rsvd					: 3,	//  1: 3     reserved
	dpg_rd_sel				: 1;  	//     4
} H15A0_OVI_LED_DPG_EN;

/*-----------------------------------------------------------------------------
	0x0604 led_dpg_lut_wr_done ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_lut_wr_done			: 1,	//     0
	_rsvd					: 3,	//  1: 3     reserved
	dpg_lut_wr_status		: 1;	//     4
} H15A0_OVI_LED_DPG_LUT_WR_DONE;

/*-----------------------------------------------------------------------------
	0x0608 led_dpg_lut_wdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_wdata				: 12,	// 0: 11
	_rsvd_00				: 4,	// 12:15     reserved
	dpg_waddr				: 10,	// 16:25
	_rsvd_01				: 2,	// 26:27     reserved
	dpg_we					: 3;	// 28:30
} H15A0_OVI_LED_DPG_LUT_WDATA;

/*-----------------------------------------------------------------------------
	0x060c led_dpg_lut_rdata ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_rdata				: 12,	// 11: 0
	_rsvd_00				: 4,	// 15:12     reserved
	dpg_raddr				: 10,	// 25:16
	_rsvd_01				: 2,	// 27:26     reserved
	dpg_re					: 3;	// 30:28
} H15A0_OVI_LED_DPG_LUT_RDATA;

/*-----------------------------------------------------------------------------
	0x0610 led_dpg_upload_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_upload_en			: 1;  //     0
} H15A0_OVI_LED_DPG_UPLOH15A0_LED_EN;

/*-----------------------------------------------------------------------------
	0x0614 led_dpg_upload_lut_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_upload_lut_sel		: 2;  // 0: 1
} H15A0_OVI_LED_DPG_UPLOH15A0_LED_LUT_SEL;

/*-----------------------------------------------------------------------------
	0x0618 led_dpg_upload_wr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_upload_wdata		: 12,	// 0: 11
	_rsvd_00				: 4,  	// 12:15     reserved
	dpg_upload_waddr		: 10,  	// 16:25
	_rsvd_01				: 2,  	// 26:27     reserved
	dpg_upload_wen			: 3;  	// 28:30
} H15A0_OVI_LED_DPG_UPLOH15A0_LED_WR;

/*-----------------------------------------------------------------------------
	0x061c led_dpg_upload_rd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_upload_rdata		: 12,  	// 0: 11
	_rsvd_00				: 4,  	// 12:15     reserved
	dpg_upload_raddr		: 10,  	// 16:25
	_rsvd_01				: 2,  	// 26:27     reserved
	dpg_upload_ren			: 3;  	// 28:30
} H15A0_OVI_LED_DPG_UPLOH15A0_LED_RD;

/*-----------------------------------------------------------------------------
	0x0620 led_dpg_wb_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_wb_mode				: 2,  	//  0: 1
	_rsvd_00				: 2,  	//  2: 3     reserved
	dpg_wb_load				: 1,  	//     4
	_rsvd_01				: 3,  	//  5: 7     reserved
	dpg_wb_load_status		: 1;  	//     8
} H15A0_OVI_LED_DPG_WB_MODE;

/*-----------------------------------------------------------------------------
	0x0624 led_dpg_direct_acc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dpg_direct_acc			: 1;  	//     0
} H15A0_OVI_LED_DPG_DIRECT_ACC;

/*-----------------------------------------------------------------------------
	0x0640 led_wb_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_en0					: 1,  	//     0
	wb_en1					: 1,  	//     1
	_rsvd_00				: 2,  	//  2: 3     reserved
	wb_mode					: 1,  	//     4
	_rsvd_01				: 11, 	// 5: 15     reserved
	wb_dbg_disp				: 5;  	// 16:20
} H15A0_OVI_LED_WB_EN;

/*-----------------------------------------------------------------------------
	0x0644 led_wb_x1_x2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_x2					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_x1					: 10;  	// 16:25
} H15A0_OVI_LED_WB_X1_X2;

/*-----------------------------------------------------------------------------
	0x0648 led_wb_x3_x4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_x4					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_x3					: 10;  	// 16:25
} H15A0_OVI_LED_WB_X3_X4;

/*-----------------------------------------------------------------------------
	0x064c led_wb_x5_x6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_x6					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_x5					: 10;  	// 16:25
} H15A0_OVI_LED_WB_X5_X6;

/*-----------------------------------------------------------------------------
	0x0650 led_wb_x7_x8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_x8					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_x7					: 10;  	// 16:25
} H15A0_OVI_LED_WB_X7_X8;

/*-----------------------------------------------------------------------------
	0x0654 led_wb_r0_r1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgain1					: 16,  	// 0: 15
	rgain0					: 16;  	// 16:31
} H15A0_OVI_LED_WB_R0_R1;

/*-----------------------------------------------------------------------------
	0x0658 led_wb_r2_r3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgain3					: 16,  	// 0: 15
	rgain2					: 16;  	// 16:31
} H15A0_OVI_LED_WB_R2_R3;

/*-----------------------------------------------------------------------------
	0x065c led_wb_r4_r5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgain5					: 16,  	// 0: 15
	rgain4					: 16;  	// 16:31
} H15A0_OVI_LED_WB_R4_R5;

/*-----------------------------------------------------------------------------
	0x0660 led_wb_r6_r7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgain7					: 16,  // 0: 15
	rgain6					: 16;  // 16:31
} H15A0_OVI_LED_WB_R6_R7;

/*-----------------------------------------------------------------------------
	0x0664 led_wb_r8_r9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	rgain9					: 16,  	// 0: 15
	rgain8					: 16;  	// 16:31
} H15A0_OVI_LED_WB_R8_R9;

/*-----------------------------------------------------------------------------
	0x0668 led_wb_g0_g1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ggain1					: 16,  	// 0: 15
	ggain0					: 16;  	// 16:31
} H15A0_OVI_LED_WB_G0_G1;

/*-----------------------------------------------------------------------------
	0x066c led_wb_g2_g3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ggain3					: 16,  	// 0: 15
	ggain2					: 16;  	// 16:31
} H15A0_OVI_LED_WB_G2_G3;

/*-----------------------------------------------------------------------------
	0x0670 led_wb_g4_g5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ggain5					: 16,  	// 0: 15
	ggain4					: 16;  	// 16:31
} H15A0_OVI_LED_WB_G4_G5;

/*-----------------------------------------------------------------------------
	0x0674 led_wb_g6_g7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ggain7					: 16,  	// 0: 15
	ggain6					: 16;  	// 16:31
} H15A0_OVI_LED_WB_G6_G7;

/*-----------------------------------------------------------------------------
	0x0678 led_wb_g8_g9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ggain9					: 16,  	// 0: 15
	ggain8					: 16;  	// 16:31
} H15A0_OVI_LED_WB_G8_G9;

/*-----------------------------------------------------------------------------
	0x067c led_wb_b0_b1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bgain1					: 16,  	// 0: 15
	bgain0					: 16;  	// 16:31
} H15A0_OVI_LED_WB_B0_B1;

/*-----------------------------------------------------------------------------
	0x0680 led_wb_b2_b3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bgain3					: 16,  	// 0: 15
	bgain2					: 16;  	// 16:31
} H15A0_OVI_LED_WB_B2_B3;

/*-----------------------------------------------------------------------------
	0x0684 led_wb_b4_b5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bgain5					: 16,  	// 0: 15
	bgain4					: 16;  	// 16:31
} H15A0_OVI_LED_WB_B4_B5;

/*-----------------------------------------------------------------------------
	0x0688 led_wb_b6_b7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bgain7					: 16,  	// 0: 15
	bgain6					: 16;  	// 16:31
} H15A0_OVI_LED_WB_B6_B7;

/*-----------------------------------------------------------------------------
	0x068c led_wb_b8_b9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bgain9					: 16,  	// 0: 15
	bgain8					: 16;  	// 16:31
} H15A0_OVI_LED_WB_B8_B9;

/*-----------------------------------------------------------------------------
	0x0690 led_wb_r_offset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_offset				: 18;  	// 0: 17
} H15A0_OVI_LED_WB_R_OFFSET;

/*-----------------------------------------------------------------------------
	0x0694 led_wb_g_offset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	g_offset				: 18;  	// 0: 17
} H15A0_OVI_LED_WB_G_OFFSET;

/*-----------------------------------------------------------------------------
	0x0698 led_wb_b_offset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	b_offset				: 18;  	// 0: 17
} H15A0_OVI_LED_WB_B_OFFSET;

/*-----------------------------------------------------------------------------
	0x069c led_wb_s1_s2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_s2					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_s1					: 10;  	// 16:25
} H15A0_OVI_LED_WB_S1_S2;

/*-----------------------------------------------------------------------------
	0x06a0 led_wb_s3_s4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_s4					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_s3					: 10;  	// 16:25
} H15A0_OVI_LED_WB_S3_S4;

/*-----------------------------------------------------------------------------
	0x06a4 led_wb_s5_s6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_s6					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_s5					: 10;  	// 16:25
} H15A0_OVI_LED_WB_S5_S6;

/*-----------------------------------------------------------------------------
	0x06a8 led_wb_s7_s8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_s8					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_s7					: 10;  	// 16:25
} H15A0_OVI_LED_WB_S7_S8;

/*-----------------------------------------------------------------------------
	0x06ac led_wb_a0_a1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_a1					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_a0					: 10;  	// 16:25
} H15A0_OVI_LED_WB_A0_A1;

/*-----------------------------------------------------------------------------
	0x06b0 led_wb_a2_a3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_s3					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_s2					: 10;  	// 16:25
} H15A0_OVI_LED_WB_A2_A3;

/*-----------------------------------------------------------------------------
	0x06b4 led_wb_a4_a5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_s5					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_s4					: 10;  	// 16:25
} H15A0_OVI_LED_WB_A4_A5;

/*-----------------------------------------------------------------------------
	0x06b8 led_wb_a6_a7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_s7					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_s6					: 10;  	// 16:25
} H15A0_OVI_LED_WB_A6_A7;

/*-----------------------------------------------------------------------------
	0x06bc led_wb_a8_a9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_s9					: 10,  	//  0: 9
	_rsvd					: 6,  	// 10:15     reserved
	wb_s8					: 10;  	// 16:25
} H15A0_OVI_LED_WB_A8_A9;

typedef struct {
	H15A0_OVI_LED_DPG_EN                  	led_dpg_en                  ;	// 0x0600 : ''
	H15A0_OVI_LED_DPG_LUT_WR_DONE                  	led_dpg_lut_wr_done                  ;	// 0x0604 : ''
	H15A0_OVI_LED_DPG_LUT_WDATA                  	led_dpg_lut_wdata                  ;	// 0x0608 : ''
	H15A0_OVI_LED_DPG_LUT_RDATA                  	led_dpg_lut_rdata                  ;	// 0x060c : ''
	H15A0_OVI_LED_DPG_UPLOH15A0_LED_EN                  	led_dpg_upload_en                  ;	// 0x0610 : ''
	H15A0_OVI_LED_DPG_UPLOH15A0_LED_LUT_SEL                  	led_dpg_upload_lut_sel                  ;	// 0x0614 : ''
	H15A0_OVI_LED_DPG_UPLOH15A0_LED_WR                  	led_dpg_upload_wr                  ;	// 0x0618 : ''
	H15A0_OVI_LED_DPG_UPLOH15A0_LED_RD                  	led_dpg_upload_rd                  ;	// 0x061c : ''
	H15A0_OVI_LED_DPG_WB_MODE                  	led_dpg_wb_mode                  ;	// 0x0620 : ''
	H15A0_OVI_LED_DPG_DIRECT_ACC                  	led_dpg_direct_acc                  ;	// 0x0624 : ''
	UINT32                          	                 	_rsvd_00[  6];	// 0x0628 ~ 0x063c
	H15A0_OVI_LED_WB_EN                  		led_wb_en                  	;	// 0x0640 : ''
	H15A0_OVI_LED_WB_X1_X2                  	led_wb_x1_x2                  ;	// 0x0644 : ''
	H15A0_OVI_LED_WB_X3_X4                  	led_wb_x3_x4                  ;	// 0x0648 : ''
	H15A0_OVI_LED_WB_X5_X6                  	led_wb_x5_x6                  ;	// 0x064c : ''
	H15A0_OVI_LED_WB_X7_X8                  	led_wb_x7_x8                  ;	// 0x0650 : ''
	H15A0_OVI_LED_WB_R0_R1                  	led_wb_r0_r1                  ;	// 0x0654 : ''
	H15A0_OVI_LED_WB_R2_R3                  	led_wb_r2_r3                  ;	// 0x0658 : ''
	H15A0_OVI_LED_WB_R4_R5                  	led_wb_r4_r5                  ;	// 0x065c : ''
	H15A0_OVI_LED_WB_R6_R7                  	led_wb_r6_r7                  ;	// 0x0660 : ''
	H15A0_OVI_LED_WB_R8_R9                  	led_wb_r8_r9                  ;	// 0x0664 : ''
	H15A0_OVI_LED_WB_G0_G1                  	led_wb_g0_g1                  ;	// 0x0668 : ''
	H15A0_OVI_LED_WB_G2_G3                  	led_wb_g2_g3                  ;	// 0x066c : ''
	H15A0_OVI_LED_WB_G4_G5                  	led_wb_g4_g5                  ;	// 0x0670 : ''
	H15A0_OVI_LED_WB_G6_G7                  	led_wb_g6_g7                  ;	// 0x0674 : ''
	H15A0_OVI_LED_WB_G8_G9                  	led_wb_g8_g9                  ;	// 0x0678 : ''
	H15A0_OVI_LED_WB_B0_B1                  	led_wb_b0_b1                  ;	// 0x067c : ''
	H15A0_OVI_LED_WB_B2_B3                  	led_wb_b2_b3                  ;	// 0x0680 : ''
	H15A0_OVI_LED_WB_B4_B5                  	led_wb_b4_b5                  ;	// 0x0684 : ''
	H15A0_OVI_LED_WB_B6_B7                  	led_wb_b6_b7                  ;	// 0x0688 : ''
	H15A0_OVI_LED_WB_B8_B9                  	led_wb_b8_b9                  ;	// 0x068c : ''
	H15A0_OVI_LED_WB_R_OFFSET                  	led_wb_r_offset                  ;	// 0x0690 : ''
	H15A0_OVI_LED_WB_G_OFFSET                  	led_wb_g_offset                  ;	// 0x0694 : ''
	H15A0_OVI_LED_WB_B_OFFSET                  	led_wb_b_offset                  ;	// 0x0698 : ''
	H15A0_OVI_LED_WB_S1_S2                  	led_wb_s1_s2                  ;	// 0x069c : ''
	H15A0_OVI_LED_WB_S3_S4                  	led_wb_s3_s4                  ;	// 0x06a0 : ''
	H15A0_OVI_LED_WB_S5_S6                  	led_wb_s5_s6                  ;	// 0x06a4 : ''
	H15A0_OVI_LED_WB_S7_S8                  	led_wb_s7_s8                  ;	// 0x06a8 : ''
	H15A0_OVI_LED_WB_A0_A1                  	led_wb_a0_a1                  ;	// 0x06ac : ''
	H15A0_OVI_LED_WB_A2_A3                  	led_wb_a2_a3                  ;	// 0x06b0 : ''
	H15A0_OVI_LED_WB_A4_A5                  	led_wb_a4_a5                  ;	// 0x06b4 : ''
	H15A0_OVI_LED_WB_A6_A7                  	led_wb_a6_a7                  ;	// 0x06b8 : ''
	H15A0_OVI_LED_WB_A8_A9                  	led_wb_a8_a9                  ;	// 0x06bc : ''
} OVI_LED_REG_H15A0_T;

#endif //#ifndef _REG_OVI_H15A0_h

