/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 


/** @demod_kadp_reg_Bx.h
 *
 *  L9 B0 DEMOD register details. ( used only within kdriver )
 *
 *  author     jeongpil.yun (jeongpil.yun@lge.com)
 *  version    1.0
 *  date       2011.08.22
 *
 */

#ifndef __DEMOD_REG_BX_H_
#define __DEMOD_REG_BX_H_


/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/
#include "demod_impl.h"


#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************************/
/**************************************************************************************/
/*************    Common Register (0x00000 ~ 0x00ff)  *********************************/
/**************************************************************************************/
/**************************************************************************************/
/*-----------------------------------------------------------------------------
	0x0000 common_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	gbbpdb                          : 1,	//     0
	pllpdb                          : 1,	//     1
	adcqpdb                         : 1,	//     2
	adcipdb                         : 1,	//     3
	softrstfecb                     : 1,	//     4
	softrsteqb                      : 1,	//     5
	softrstsyncb                    : 1,	//     6
	softrstb                        : 1;	//     7
} COMMON_CTRL0;

/*-----------------------------------------------------------------------------
	0x0001 common_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	simfastenb                      : 1,	//     0
	eqfbfrstenb                     : 1,	//     1
	eqfffrstenb                     : 1,	//     2
	autorptrsten                    : 1,	//     3
	                                : 1,	//     4 reserved
	eqdoneen                        : 1,	//     5
	syncdoneen                      : 1,	//     6
	sysctrldoneen                   : 1;	//     7
} COMMON_CTRL1;

/*-----------------------------------------------------------------------------
	0x0002 common_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	syslocktimemode_1_0             : 2,	//  0: 1
	specinv                         : 1,	//     2
	specinvauto                     : 1,	//     3
	                                : 1,	//     4 reserved
	cpxtunen                        : 1,	//     5
	zeroifen                        : 1,	//     6
	ni2crpten                       : 1;	//     7
} COMMON_CTRL2;

/*-----------------------------------------------------------------------------
	0x0003 common_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	iqmcstepsize_2_0                : 3,	//  0: 2
	iqmcen                          : 1,	//     3
	agcoutpol                       : 1,	//     4
	agcmode                         : 1,	//     5
	agcifoutenb                     : 1,	//     6
	agcrfoutenb                     : 1;	//     7
} COMMON_CTRL3;

/*-----------------------------------------------------------------------------
	0x0004 common_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	adcmsbinv                       : 1,	//     0
	adcsamfsel                      : 1,	//     1
	adcoutsel                       : 1,	//     2
	adcclkpllsel                    : 1,	//     3
	adccns                          : 1,	//     4
	adccnf                          : 1,	//     5
	adccnt                          : 1,	//     6
	adcsel1v                        : 1;	//     7
} COMMON_CTRL4;

/*-----------------------------------------------------------------------------
	0x0005 common_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	pllctrl_13_8                    : 6,	//  0: 5
	pllsetauto                      : 1,	//     6
	pllindivsel                     : 1;	//     7
} COMMON_CTRL5;

/*-----------------------------------------------------------------------------
	0x0006 common_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	pllctrl_7_0                     ;   	//  7: 0
} COMMON_CTRL6;

/*-----------------------------------------------------------------------------
	0x0008 common_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stdopmode_7_0                   ;   	//  7: 0
} COMMON_CTRL7;

/*-----------------------------------------------------------------------------
	0x0009 common_ctrl[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stdopdetcmode_1_0               : 2,	//  0: 1
	stdopdettmode_2_0               : 3,	//  2: 4
	stdopcalcnum_2_0                : 3;	//  5: 7
} COMMON_CTRL8;

/*-----------------------------------------------------------------------------
	0x000a common_ctrl[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 1,	//     0 reserved
	srd1stchken                     : 1,	//     1
	srdsinglestdrstcon              : 1,	//     2
	scsyslockchken                  : 1,	//     3
	                                : 2,	//  4: 5 reserved
	qmden                           : 1,	//     6
	daften                          : 1;	//     7
} COMMON_CTRL9;

/*-----------------------------------------------------------------------------
	0x000b common_ctrl[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	scmonsel_3_0                    : 4;	//  0: 3
} COMMON_CTRL10;

/*-----------------------------------------------------------------------------
	0x000d common_ctrl[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samfreq_21_16                   : 6,	//  0: 5
	sampling4xfen                   : 1,	//     6
	samclkauto                      : 1;	//     7
} COMMON_CTRL11;

/*-----------------------------------------------------------------------------
	0x000e common_ctrl[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samfreq_15_8                    ;   	//  7: 0
} COMMON_CTRL12;

/*-----------------------------------------------------------------------------
	0x000f common_ctrl[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samfreq_7_0                     ;   	//  7: 0
} COMMON_CTRL13;

/*-----------------------------------------------------------------------------
	0x0010 common_ctrl[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	iffreq_15_8                     ;   	//  7: 0
} COMMON_CTRL14;

/*-----------------------------------------------------------------------------
	0x0011 common_ctrl[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	iffreq_7_0                      ;   	//  7: 0
} COMMON_CTRL15;

/*-----------------------------------------------------------------------------
	0x0012 agc_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcinsel                        : 1,	//     0
	agcfastdnenb                    : 1,	//     1
	agcfastupenb                    : 1,	//     2
	agcfastalwayson                 : 1,	//     3
	agcgearshen                     : 1,	//     4
	agcerraccen                     : 1,	//     5
	agcrefmode                      : 1,	//     6
	agcen                           : 1;	//     7
} AGC_CTRL0;

/*-----------------------------------------------------------------------------
	0x0013 agc_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcdsmstep_3_0                  : 4,	//  0: 3
	agclockdetrngsel_1_0            : 2,	//  4: 5
	agciffixb                       : 1,	//     6
	agcrffixb                       : 1;	//     7
} AGC_CTRL1;

/*-----------------------------------------------------------------------------
	0x0014 agc_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcfixvalue_7_0                 ;   	//  7: 0
} AGC_CTRL2;

/*-----------------------------------------------------------------------------
	0x0015 agc_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcref_15_8                     ;   	//  7: 0
} AGC_CTRL3;

/*-----------------------------------------------------------------------------
	0x0016 agc_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcref_7_0                      ;   	//  7: 0
} AGC_CTRL4;

/*-----------------------------------------------------------------------------
	0x0017 agc_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcdelay_7_0                    ;   	//  7: 0
} AGC_CTRL5;

/*-----------------------------------------------------------------------------
	0x0018 agc_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcifbw_3_0                     : 4,	//  0: 3
	agcrfbw_3_0                     : 4;	//  4: 7
} AGC_CTRL6;

/*-----------------------------------------------------------------------------
	0x0019 agc_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcuddeadzone_2_0               : 3,	//  0: 2
	agcudctrldir                    : 1,	//     3
	agcudctrllen_1_0                : 2,	//  4: 5
	agcudoutmode_1_0                : 2;	//  6: 7
} AGC_CTRL7;

/*-----------------------------------------------------------------------------
	0x001c mdp_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 2,	//  0: 1 reserved
	dcrealsel                       : 1,	//     2
	                                : 2,	//  3: 4 reserved
	mfen                            : 1,	//     5
	pfen                            : 1,	//     6
	dcrmven                         : 1;	//     7
} MDP_CTRL0;

/*-----------------------------------------------------------------------------
	0x001d mdp_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfadeoutstepsel_3_0          : 4,	//  0: 3
	aiccfadeouten                   : 1,	//     4
	                                : 1,	//     5 reserved
	aiccscanstep_1_0                : 2;	//  6: 7
} MDP_CTRL1;

/*-----------------------------------------------------------------------------
	0x001e mdp_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccalphastop_3_0               : 4,	//  0: 3
	aiccalpha_3_0                   : 4;	//  4: 7
} MDP_CTRL2;

/*-----------------------------------------------------------------------------
	0x001f mdp_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccoffth_19_16                 : 4,	//  0: 3
	aiccdetth_19_16                 : 4;	//  4: 7
} MDP_CTRL3;

/*-----------------------------------------------------------------------------
	0x0020 mdp_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccdetth_15_8                  ;   	//  7: 0
} MDP_CTRL4;

/*-----------------------------------------------------------------------------
	0x0021 mdp_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccdetth_7_0                   ;   	//  7: 0
} MDP_CTRL5;

/*-----------------------------------------------------------------------------
	0x0022 mdp_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccoffth_15_8                  ;   	//  7: 0
} MDP_CTRL6;

/*-----------------------------------------------------------------------------
	0x0023 mdp_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccoffth_7_0                   ;   	//  7: 0
} MDP_CTRL7;

/*-----------------------------------------------------------------------------
	0x0024 mdp_ctrl[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccopmode0_1_0                 : 2,	//  0: 1
	aiccopmode1_1_0                 : 2,	//  2: 3
	aiccopmode2_1_0                 : 2,	//  4: 5
	aiccopmode3_1_0                 : 2;	//  6: 7
} MDP_CTRL8;

/*-----------------------------------------------------------------------------
	0x0025 mdp_ctrl[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq3_23_16              ;   	//  7: 0
} MDP_CTRL9;

/*-----------------------------------------------------------------------------
	0x0026 mdp_ctrl[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq3_15_8               ;   	//  7: 0
} MDP_CTRL10;

/*-----------------------------------------------------------------------------
	0x0027 mdp_ctrl[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq3_7_0                ;   	//  7: 0
} MDP_CTRL11;

/*-----------------------------------------------------------------------------
	0x0028 mdp_ctrl[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq2_23_16              ;   	//  7: 0
} MDP_CTRL12;

/*-----------------------------------------------------------------------------
	0x0029 mdp_ctrl[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq2_15_8               ;   	//  7: 0
} MDP_CTRL13;

/*-----------------------------------------------------------------------------
	0x002a mdp_ctrl[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq2_7_0                ;   	//  7: 0
} MDP_CTRL14;

/*-----------------------------------------------------------------------------
	0x002b mdp_ctrl[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq1_23_16              ;   	//  7: 0
} MDP_CTRL15;

/*-----------------------------------------------------------------------------
	0x002c mdp_ctrl[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq1_15_8               ;   	//  7: 0
} MDP_CTRL16;

/*-----------------------------------------------------------------------------
	0x002d mdp_ctrl[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq1_7_0                ;   	//  7: 0
} MDP_CTRL17;

/*-----------------------------------------------------------------------------
	0x002e mdp_ctrl[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq0_23_16              ;   	//  7: 0
} MDP_CTRL18;

/*-----------------------------------------------------------------------------
	0x002f mdp_ctrl[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq0_15_8               ;   	//  7: 0
} MDP_CTRL19;

/*-----------------------------------------------------------------------------
	0x0030 mdp_ctrl[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccfixfreq0_7_0                ;   	//  7: 0
} MDP_CTRL20;

/*-----------------------------------------------------------------------------
	0x0032 mdp_ctrl[21] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dagc1stbw_3_0                   : 4,	//  0: 3
	dagc1strefmode                  : 1,	//     4
	dagc1stgearshen                 : 1,	//     5
	dagc1sterraccen                 : 1,	//     6
	dagc1sten                       : 1;	//     7
} MDP_CTRL21;

/*-----------------------------------------------------------------------------
	0x0033 mdp_ctrl[22] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dagc1stref_15_8                 ;   	//  7: 0
} MDP_CTRL22;

/*-----------------------------------------------------------------------------
	0x0034 mdp_ctrl[23] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dagc1stref_7_0                  ;   	//  7: 0
} MDP_CTRL23;

/*-----------------------------------------------------------------------------
	0x0035 mdp_ctrl[24] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dagc2ndbw_3_0                   : 4,	//  0: 3
	dagc2ndrefmode                  : 1,	//     4
	dagc2ndgearshen                 : 1,	//     5
	dagc2nderraccen                 : 1,	//     6
	dagc2nden                       : 1;	//     7
} MDP_CTRL24;

/*-----------------------------------------------------------------------------
	0x0036 mdp_ctrl[25] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dagc2ndref_15_8                 ;   	//  7: 0
} MDP_CTRL25;

/*-----------------------------------------------------------------------------
	0x0037 mdp_ctrl[26] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dagc2ndref_7_0                  ;   	//  7: 0
} MDP_CTRL26;

/*-----------------------------------------------------------------------------
	0x0038 mdp_ctrl[27] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dagc2nddcrmven                  : 1,	//     0
	dagc2ndqsen                     : 1,	//     1
	                                : 4,	//  2: 5 reserved
	dagc2ndlockdetrngsel_1_0        : 2;	//  6: 7
} MDP_CTRL27;

/*-----------------------------------------------------------------------------
	0x0039 mdp_ctrl[28] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	mdpmonsel_3_0                   : 4;	//  0: 3
} MDP_CTRL28;

/*-----------------------------------------------------------------------------
	0x003a gpo_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	gposel_3_0                      : 4,	//  0: 3
	gpoctrl_1_0                     : 2;	//  4: 5
} GPO_CTRL0;

/*-----------------------------------------------------------------------------
	0x003d sampling_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfbw_3_0                     : 4,	//  0: 3
	                                : 1,	//     4 reserved
	samlfreinitenb                  : 1,	//     5
	samgearshen                     : 1,	//     6
	samen                           : 1;	//     7
} SAMPLING_CTRL0;

/*-----------------------------------------------------------------------------
	0x0044 carrier_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfbw_3_0                      : 4,	//  0: 3
	                                : 1,	//     4 reserved
	crlfreinitenb                   : 1,	//     5
	crgearshen                      : 1,	//     6
	cren                            : 1;	//     7
} CARRIER_CTRL0;

/*-----------------------------------------------------------------------------
	0x0050 eq_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirresol_2_0                    : 3,	//  0: 2
	                                : 1,	//     3 reserved
	msecalcintsel_1_0               : 2,	//  4: 5
	syncfrmsel_1_0                  : 2;	//  6: 7
} EQ_CTRL0;

/*-----------------------------------------------------------------------------
	0x0053 eq_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	mdgimode_di_1_0                 : 2,	//  0: 1
	mdfftmode_di_1_0                : 2,	//  2: 3
	mdholdb_di                      : 1,	//     4
	mdauto_di                       : 1,	//     5
	gaincompen_di                   : 1,	//     6
	fftwindowenb_di                 : 1;	//     7
} EQ_CTRL1;

/*-----------------------------------------------------------------------------
	0x0054 eq_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	mdcfmaxth_di_2_0                : 3,	//  0: 2
	                                : 1,	//     3 reserved
	mdlockth_di_1_0                 : 2;	//  4: 5
} EQ_CTRL2;

/*-----------------------------------------------------------------------------
	0x0057 eq_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	txpswth_di_2_0                  : 3,	//  0: 2
	                                : 1,	//     3 reserved
	txpblkcodeon_di                 : 1,	//     4
	txphdacc_di                     : 1,	//     5
	txplockfastenb_di               : 1,	//     6
	txpauto_di                      : 1;	//     7
} EQ_CTRL3;

/*-----------------------------------------------------------------------------
	0x0058 eq_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	txplockth4eq_di_3_0             : 4,	//  0: 3
	txplockth4sync_di_3_0           : 4;	//  4: 7
} EQ_CTRL4;

/*-----------------------------------------------------------------------------
	0x0059 eq_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	txpswlockth_di_3_0              : 4;	//  0: 3
} EQ_CTRL5;

/*-----------------------------------------------------------------------------
	0x005a eq_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	txpccth_di_7_0                  ;   	//  7: 0
} EQ_CTRL6;

/*-----------------------------------------------------------------------------
	0x005b eq_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	txpccmax_di_7_0                 ;   	//  7: 0
} EQ_CTRL7;

/*-----------------------------------------------------------------------------
	0x005c eq_ctrl[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	txpccinc_di_7_0                 ;   	//  7: 0
} EQ_CTRL8;

/*-----------------------------------------------------------------------------
	0x005f eq_ctrl[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpshiermode_d_2_0               : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tpsqammode_d_1_0                : 2;	//  4: 5
} EQ_CTRL9;

/*-----------------------------------------------------------------------------
	0x0060 eq_ctrl[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpslpcoderate_d_2_0             : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tpshpcoderate_d_2_0             : 3;	//  4: 6
} EQ_CTRL10;

/*-----------------------------------------------------------------------------
	0x0061 eq_ctrl[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccqammodea_i_2_0              : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmccnumsega_i_3_0               : 4;	//  4: 7
} EQ_CTRL11;

/*-----------------------------------------------------------------------------
	0x0062 eq_ctrl[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmcctimeintlena_i_2_0           : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmcccoderatea_i_2_0             : 3,	//  4: 6
	tmccpr_i                        : 1;	//     7
} EQ_CTRL12;

/*-----------------------------------------------------------------------------
	0x0063 eq_ctrl[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccqammodeb_i_2_0              : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmccnumsegb_i_3_0               : 4;	//  4: 7
} EQ_CTRL13;

/*-----------------------------------------------------------------------------
	0x0064 eq_ctrl[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmcctimeintlenb_i_2_0           : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmcccoderateb_i_2_0             : 3;	//  4: 6
} EQ_CTRL14;

/*-----------------------------------------------------------------------------
	0x0065 eq_ctrl[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccqammodec_i_2_0              : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmccnumsegc_i_3_0               : 4;	//  4: 7
} EQ_CTRL15;

/*-----------------------------------------------------------------------------
	0x0066 eq_ctrl[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmcctimeintlenc_i_2_0           : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmcccoderatec_i_2_0             : 3;	//  4: 6
} EQ_CTRL16;

/*-----------------------------------------------------------------------------
	0x0070 tp_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpsoppol                        : 1,	//     0
	tpvalpol                        : 1,	//     1
	tpclkpol                        : 1,	//     2
	tpdataouten                     : 1,	//     3
	tpclksupb                       : 1,	//     4
	tpclkouten                      : 1,	//     5
	tpifen                          : 1,	//     6
	tpouten                         : 1;	//     7
} TP_CTRL0;

/*-----------------------------------------------------------------------------
	0x0071 tp_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 1,	//     0 reserved
	tperrmrkins                     : 1,	//     1
	tpvalmasken                     : 1,	//     2
	tpval47chken                    : 1,	//     3
	tpsdatalsben                    : 1,	//     4
	tpsmsb1st                       : 1,	//     5
	tpssopbiten                     : 1,	//     6
	tpsenb                          : 1;	//     7
} TP_CTRL1;

/*-----------------------------------------------------------------------------
	0x0072 tp_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpifbw_3_0                      : 4,	//  0: 3
	tpifctrl_3_0                    : 4;	//  4: 7
} TP_CTRL2;

/*-----------------------------------------------------------------------------
	0x0073 fec_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	perint_1_0                      : 2,	//  0: 1
	permode_1_0                     : 2,	//  2: 3
	chberint                        : 1,	//     4
	                                : 2,	//  5: 6 reserved
	tp47ins                         : 1;	//     7
} FEC_CTRL0;

/*-----------------------------------------------------------------------------
	0x0075 fec_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	iqswapctrl_2_0                  : 3,	//  0: 2
	                                : 1,	//     3 reserved
	layersel_i_1_0                  : 2,	//  4: 5
	hierhpsel_d                     : 1;	//     6
} FEC_CTRL1;

/*-----------------------------------------------------------------------------
	0x0076 fec_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 2,	//  0: 1 reserved
	nberclr                         : 1,	//     2
	nberrun                         : 1,	//     3
	nberwsync                       : 1,	//     4
	nberpol                         : 1,	//     5
	nberst                          : 1,	//     6
	nbercon                         : 1;	//     7
} FEC_CTRL2;

/*-----------------------------------------------------------------------------
	0x0077 fec_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberacqth_3_0                   : 4,	//  0: 3
	nberlosth_2_0                   : 3;	//  4: 6
} FEC_CTRL3;

/*-----------------------------------------------------------------------------
	0x0078 fec_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberpoly_31_24                  ;   	//  7: 0
} FEC_CTRL4;

/*-----------------------------------------------------------------------------
	0x0079 fec_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberpoly_23_16                  ;   	//  7: 0
} FEC_CTRL5;

/*-----------------------------------------------------------------------------
	0x007a fec_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberpoly_15_8                   ;   	//  7: 0
} FEC_CTRL6;

/*-----------------------------------------------------------------------------
	0x007b fec_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberpoly_7_0                    ;   	//  7: 0
} FEC_CTRL7;

/*-----------------------------------------------------------------------------
	0x007c fec_ctrl[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberped_31_24                   ;   	//  7: 0
} FEC_CTRL8;

/*-----------------------------------------------------------------------------
	0x007d fec_ctrl[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberped_23_16                   ;   	//  7: 0
} FEC_CTRL9;

/*-----------------------------------------------------------------------------
	0x007e fec_ctrl[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberped_15_8                    ;   	//  7: 0
} FEC_CTRL10;

/*-----------------------------------------------------------------------------
	0x007f fec_ctrl[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nberped_7_0                     ;   	//  7: 0
} FEC_CTRL11;

/*-----------------------------------------------------------------------------
	0x0080 common_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	neverlock_1_0                   : 2,	//  0: 1
	qmdlock                         : 1,	//     2
	srdlock                         : 1,	//     3
	syslock                         : 1,	//     4
	dagclock                        : 1,	//     5
	agclock                         : 1,	//     6
	stdopctrldone                   : 1;	//     7
} COMMON_MON0;

/*-----------------------------------------------------------------------------
	0x0081 stdopmode_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	detstdopmode_7_0                ;   	//  7: 0
} STDOPMODE_MON0;

/*-----------------------------------------------------------------------------
	0x0082 common_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	isolflag                        : 1,	//     0
	sam4xflag                       : 1,	//     1
	mansymrateflag                  : 1,	//     2
	manstdopflag                    : 1,	//     3
	adcqpdbflag                     : 1,	//     4
	adcipdbflag                     : 1,	//     5
	pllpdbflag                      : 1,	//     6
	gbbpdbflag                      : 1;	//     7
} COMMON_MON1;

/*-----------------------------------------------------------------------------
	0x0083 common_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	pllctrlvalue_13_8               : 6;	//  0: 5
} COMMON_MON2;

/*-----------------------------------------------------------------------------
	0x0084 common_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	pllctrlvalue_7_0                ;   	//  7: 0
} COMMON_MON3;

/*-----------------------------------------------------------------------------
	0x0085 common_mon[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	detsymrate_16                   : 1,	//     0
	                                : 3,	//  1: 3 reserved
	detrfbw_1_0                     : 2,	//  4: 5
	                                : 1,	//     6 reserved
	specinvstatus                   : 1;	//     7
} COMMON_MON4;

/*-----------------------------------------------------------------------------
	0x0086 common_mon[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	detsymrate_15_8                 ;   	//  7: 0
} COMMON_MON5;

/*-----------------------------------------------------------------------------
	0x0087 common_mon[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	detsymrate_7_0                  ;   	//  7: 0
} COMMON_MON6;

/*-----------------------------------------------------------------------------
	0x0088 common_mon[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	syslocktime_15_8                ;   	//  7: 0
} COMMON_MON7;

/*-----------------------------------------------------------------------------
	0x0089 common_mon[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	syslocktime_7_0                 ;   	//  7: 0
} COMMON_MON8;

/*-----------------------------------------------------------------------------
	0x008a common_mon[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	eqlocktime_15_8                 ;   	//  7: 0
} COMMON_MON9;

/*-----------------------------------------------------------------------------
	0x008b common_mon[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	eqlocktime_7_0                  ;   	//  7: 0
} COMMON_MON10;

/*-----------------------------------------------------------------------------
	0x008c common_mon[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	feclocktime_15_8                ;   	//  7: 0
} COMMON_MON11;

/*-----------------------------------------------------------------------------
	0x008d common_mon[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	feclocktime_7_0                 ;   	//  7: 0
} COMMON_MON12;

/*-----------------------------------------------------------------------------
	0x008e sync_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcaccout_15_8                  ;   	//  7: 0
} SYNC_MON0;

/*-----------------------------------------------------------------------------
	0x008f sync_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	agcaccout_7_0                   ;   	//  7: 0
} SYNC_MON1;

/*-----------------------------------------------------------------------------
	0x0090 sync_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	aiccrejbusy_3_0                 : 4,	//  0: 3
	aiccrejstatus_3_0               : 4;	//  4: 7
} SYNC_MON2;

/*-----------------------------------------------------------------------------
	0x0091 sync_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	scmonout_19_16                  : 4;	//  0: 3
} SYNC_MON3;

/*-----------------------------------------------------------------------------
	0x0092 sync_mon[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	scmonout_15_8                   ;   	//  7: 0
} SYNC_MON4;

/*-----------------------------------------------------------------------------
	0x0093 sync_mon[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	scmonout_7_0                    ;   	//  7: 0
} SYNC_MON5;

/*-----------------------------------------------------------------------------
	0x0094 sync_mon[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	mdpmonout_19_16                 : 4;	//  0: 3
} SYNC_MON6;

/*-----------------------------------------------------------------------------
	0x0095 sync_mon[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	mdpmonout_15_8                  ;   	//  7: 0
} SYNC_MON7;

/*-----------------------------------------------------------------------------
	0x0096 sync_mon[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	mdpmonout_7_0                   ;   	//  7: 0
} SYNC_MON8;

/*-----------------------------------------------------------------------------
	0x0097 sync_mon[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftoffset_15_8                 ;   	//  7: 0
} SYNC_MON9;

/*-----------------------------------------------------------------------------
	0x0098 sync_mon[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftoffset_7_0                  ;   	//  7: 0
} SYNC_MON10;

/*-----------------------------------------------------------------------------
	0x0099 sync_mon[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	croffset_23_16                  ;   	//  7: 0
} SYNC_MON11;

/*-----------------------------------------------------------------------------
	0x009a sync_mon[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	croffset_15_8                   ;   	//  7: 0
} SYNC_MON12;

/*-----------------------------------------------------------------------------
	0x009b sync_mon[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	croffset_7_0                    ;   	//  7: 0
} SYNC_MON13;

/*-----------------------------------------------------------------------------
	0x009c sync_mon[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	carrfreqoffset_15_8             ;   	//  7: 0
} SYNC_MON14;

/*-----------------------------------------------------------------------------
	0x009d sync_mon[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	carrfreqoffset_7_0              ;   	//  7: 0
} SYNC_MON15;

/*-----------------------------------------------------------------------------
	0x009e sync_mon[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samoffset_23_16                 ;   	//  7: 0
} SYNC_MON16;

/*-----------------------------------------------------------------------------
	0x009f sync_mon[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samoffset_15_8                  ;   	//  7: 0
} SYNC_MON17;

/*-----------------------------------------------------------------------------
	0x00a0 sync_mon[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samoffset_7_0                   ;   	//  7: 0
} SYNC_MON18;

/*-----------------------------------------------------------------------------
	0x00a1 sync_mon[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samfreqoffset_23_16             ;   	//  7: 0
} SYNC_MON19;

/*-----------------------------------------------------------------------------
	0x00a2 sync_mon[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samfreqoffset_15_8              ;   	//  7: 0
} SYNC_MON20;

/*-----------------------------------------------------------------------------
	0x00a3 sync_mon[21] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samfreqoffset_7_0               ;   	//  7: 0
} SYNC_MON21;

/*-----------------------------------------------------------------------------
	0x00a6 eqcommon_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	qammode_2_0                     : 3,	//  0: 2
	                                : 4,	//  3: 6 reserved
	synclock                        : 1;	//     7
} SYNC_MON22;

/*-----------------------------------------------------------------------------
	0x00aa dieq_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	gimoder_di_1_0                  : 2,	//  0: 1
	fftmoder_di_1_0                 : 2,	//  2: 3
	                                : 3,	//  4: 6 reserved
	modelock_di                     : 1;	//     7
} DIEQ_MON0;

/*-----------------------------------------------------------------------------
	0x00ab dieq_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	txpswlock_di                    : 1;	//     7
} DIEQ_MON1;

/*-----------------------------------------------------------------------------
	0x00ad deq_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpsgimoder_d_1_0                : 2,	//  0: 1
	tpsfftmoder_d_1_0               : 2,	//  2: 3
	tpssynclock_d                   : 1,	//     4
	tpslockeq_d                     : 1,	//     5
	tpslocksync_d                   : 1,	//     6
	splock_d                        : 1;	//     7
} DEQ_MON0;

/*-----------------------------------------------------------------------------
	0x00ae deq_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpslengthr_d_5_0                : 6,	//  0: 5
	tpsmpefecinfor_d                : 1,	//     6
	tpstimesliceinfor_d             : 1;	//     7
} DEQ_MON1;

/*-----------------------------------------------------------------------------
	0x00af deq_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpshiermoder_d_2_0              : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tpsqammoder_d_1_0               : 2;	//  4: 5
} DEQ_MON2;

/*-----------------------------------------------------------------------------
	0x00b0 deq_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpslpcoderater_d_2_0            : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tpshpcoderater_d_2_0            : 3;	//  4: 6
} DEQ_MON3;

/*-----------------------------------------------------------------------------
	0x00b1 deq_mon[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpscellidr_d_15_8               ;   	//  7: 0
} DEQ_MON4;

/*-----------------------------------------------------------------------------
	0x00b2 deq_mon[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpscellidr_d_7_0                ;   	//  7: 0
} DEQ_MON5;

/*-----------------------------------------------------------------------------
	0x00b5 ieq_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccpcvr_i_2_0                  : 3,	//  0: 2
	tmccsysidr_i_1_0                : 2,	//  3: 4
	                                : 1,	//     5 reserved
	tmcclock_i                      : 1,	//     6
	tmccflock_i                     : 1;	//     7
} IEQ_MON0;

/*-----------------------------------------------------------------------------
	0x00b6 ieq_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccdiffsegr_i_12_8             : 5,	//  0: 4
	                                : 1,	//     5 reserved
	tmccprr_i                       : 1,	//     6
	tmccealarmr_i                   : 1;	//     7
} IEQ_MON1;

/*-----------------------------------------------------------------------------
	0x00b7 ieq_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccdiffsegr_i_7_0              ;   	//  7: 0
} IEQ_MON2;

/*-----------------------------------------------------------------------------
	0x00b8 ieq_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccqammodear_i_2_0             : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmccnumsegar_i_3_0              : 4;	//  4: 7
} IEQ_MON3;

/*-----------------------------------------------------------------------------
	0x00b9 ieq_mon[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmcctimeintlenar_i_2_0          : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmcccoderatear_i_2_0            : 3;	//  4: 6
} IEQ_MON4;

/*-----------------------------------------------------------------------------
	0x00ba ieq_mon[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccqammodebr_i_2_0             : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmccnumsegbr_i_3_0              : 4;	//  4: 7
} IEQ_MON5;

/*-----------------------------------------------------------------------------
	0x00bb ieq_mon[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmcctimeintlenbr_i_2_0          : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmcccoderatebr_i_2_0            : 3;	//  4: 6
} IEQ_MON6;

/*-----------------------------------------------------------------------------
	0x00bc ieq_mon[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccqammodecr_i_2_0             : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmccnumsegcr_i_3_0              : 4;	//  4: 7
} IEQ_MON7;

/*-----------------------------------------------------------------------------
	0x00bd ieq_mon[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmcctimeintlencr_i_2_0          : 3,	//  0: 2
	                                : 1,	//     3 reserved
	tmcccoderatecr_i_2_0            : 3;	//  4: 6
} IEQ_MON8;

/*-----------------------------------------------------------------------------
	0x00c6 cir_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dlyspread_11_8                  : 4,	//  0: 3
	                                : 1,	//     4 reserved
	circpdensity_1_0                : 2,	//  5: 6
	cirlock                         : 1;	//     7
} CIR_MON0;

/*-----------------------------------------------------------------------------
	0x00c7 cir_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dlyspread_7_0                   ;   	//  7: 0
} CIR_MON1;

/*-----------------------------------------------------------------------------
	0x00c8 cir_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly0_7_0                     ;   	//  7: 0
} CIR_MON2;

/*-----------------------------------------------------------------------------
	0x00c9 cir_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly1_7_0                     ;   	//  7: 0
} CIR_MON3;

/*-----------------------------------------------------------------------------
	0x00ca cir_mon[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly2_7_0                     ;   	//  7: 0
} CIR_MON4;

/*-----------------------------------------------------------------------------
	0x00cb cir_mon[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly3_7_0                     ;   	//  7: 0
} CIR_MON5;

/*-----------------------------------------------------------------------------
	0x00cc cir_mon[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly4_7_0                     ;   	//  7: 0
} CIR_MON6;

/*-----------------------------------------------------------------------------
	0x00cd cir_mon[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly5_7_0                     ;   	//  7: 0
} CIR_MON7;

/*-----------------------------------------------------------------------------
	0x00ce cir_mon[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly6_7_0                     ;   	//  7: 0
} CIR_MON8;

/*-----------------------------------------------------------------------------
	0x00cf cir_mon[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly7_7_0                     ;   	//  7: 0
} CIR_MON9;

/*-----------------------------------------------------------------------------
	0x00d0 cir_mon[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly8_7_0                     ;   	//  7: 0
} CIR_MON10;

/*-----------------------------------------------------------------------------
	0x00d1 cir_mon[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly9_7_0                     ;   	//  7: 0
} CIR_MON11;

/*-----------------------------------------------------------------------------
	0x00d2 cir_mon[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly10_7_0                    ;   	//  7: 0
} CIR_MON12;

/*-----------------------------------------------------------------------------
	0x00d3 cir_mon[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly11_7_0                    ;   	//  7: 0
} CIR_MON13;

/*-----------------------------------------------------------------------------
	0x00d4 cir_mon[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly12_7_0                    ;   	//  7: 0
} CIR_MON14;

/*-----------------------------------------------------------------------------
	0x00d5 cir_mon[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly13_7_0                    ;   	//  7: 0
} CIR_MON15;

/*-----------------------------------------------------------------------------
	0x00d6 cir_mon[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly14_7_0                    ;   	//  7: 0
} CIR_MON16;

/*-----------------------------------------------------------------------------
	0x00d7 cir_mon[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirdly15_7_0                    ;   	//  7: 0
} CIR_MON17;

/*-----------------------------------------------------------------------------
	0x00d8 cir_mon[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr0_7_0                     ;   	//  7: 0
} CIR_MON18;

/*-----------------------------------------------------------------------------
	0x00d9 cir_mon[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr1_7_0                     ;   	//  7: 0
} CIR_MON19;

/*-----------------------------------------------------------------------------
	0x00da cir_mon[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr2_7_0                     ;   	//  7: 0
} CIR_MON20;

/*-----------------------------------------------------------------------------
	0x00db cir_mon[21] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr3_7_0                     ;   	//  7: 0
} CIR_MON21;

/*-----------------------------------------------------------------------------
	0x00dc cir_mon[22] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr4_7_0                     ;   	//  7: 0
} CIR_MON22;

/*-----------------------------------------------------------------------------
	0x00dd cir_mon[23] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr5_7_0                     ;   	//  7: 0
} CIR_MON23;

/*-----------------------------------------------------------------------------
	0x00de cir_mon[24] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr6_7_0                     ;   	//  7: 0
} CIR_MON24;

/*-----------------------------------------------------------------------------
	0x00df cir_mon[25] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr7_7_0                     ;   	//  7: 0
} CIR_MON25;

/*-----------------------------------------------------------------------------
	0x00e0 cir_mon[26] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr8_7_0                     ;   	//  7: 0
} CIR_MON26;

/*-----------------------------------------------------------------------------
	0x00e1 cir_mon[27] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr9_7_0                     ;   	//  7: 0
} CIR_MON27;

/*-----------------------------------------------------------------------------
	0x00e2 cir_mon[28] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr10_7_0                    ;   	//  7: 0
} CIR_MON28;

/*-----------------------------------------------------------------------------
	0x00e3 cir_mon[29] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr11_7_0                    ;   	//  7: 0
} CIR_MON29;

/*-----------------------------------------------------------------------------
	0x00e4 cir_mon[30] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr12_7_0                    ;   	//  7: 0
} CIR_MON30;

/*-----------------------------------------------------------------------------
	0x00e5 cir_mon[31] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr13_7_0                    ;   	//  7: 0
} CIR_MON31;

/*-----------------------------------------------------------------------------
	0x00e6 cir_mon[32] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr14_7_0                    ;   	//  7: 0
} CIR_MON32;

/*-----------------------------------------------------------------------------
	0x00e7 cir_mon[33] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwr15_7_0                    ;   	//  7: 0
} CIR_MON33;

/*-----------------------------------------------------------------------------
	0x00e8 eqcommon_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	constpwr_15_8                   ;   	//  7: 0
} EQCOMMON_MON0;

/*-----------------------------------------------------------------------------
	0x00e9 eqcommon_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	constpwr_7_0                    ;   	//  7: 0
} EQCOMMON_MON1;

/*-----------------------------------------------------------------------------
	0x00ea eqcommon_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	bmse_15_8                       ;   	//  7: 0
} EQCOMMON_MON2;

/*-----------------------------------------------------------------------------
	0x00eb eqcommon_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	bmse_7_0                        ;   	//  7: 0
} EQCOMMON_MON3;

/*-----------------------------------------------------------------------------
	0x00ec eqcommon_mon[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	mse_15_8                        ;   	//  7: 0
} EQCOMMON_MON4;

/*-----------------------------------------------------------------------------
	0x00ed eqcommon_mon[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	mse_7_0                         ;   	//  7: 0
} EQCOMMON_MON5;

/*-----------------------------------------------------------------------------
	0x00ee eqcommon_mon[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	consti_7_0                      ;   	//  7: 0
} EQCOMMON_MON6;

/*-----------------------------------------------------------------------------
	0x00ef eqcommon_mon[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	constq_7_0                      ;   	//  7: 0
} EQCOMMON_MON7;

/*-----------------------------------------------------------------------------
	0x00f0 tp_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpclkconnum_11_8                : 4,	//  0: 3
	                                : 1,	//     4 reserved
	tpifmemunderflag                : 1,	//     5
	tpifmemoverflag                 : 1,	//     6
	tpiflock                        : 1;	//     7
} TP_MON0;

/*-----------------------------------------------------------------------------
	0x00f1 tp_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpclkconnum_7_0                 ;   	//  7: 0
} TP_MON1;

/*-----------------------------------------------------------------------------
	0x00f2 tp_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpclkdivnum_15_8                ;   	//  7: 0
} TP_MON2;

/*-----------------------------------------------------------------------------
	0x00f3 tp_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpclkdivnum_7_0                 ;   	//  7: 0
} TP_MON3;

/*-----------------------------------------------------------------------------
	0x00f5 fec_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	iqswapstatus_2_0                : 3,	//  0: 2
	                                : 4,	//  3: 6 reserved
	tpcorrect                       : 1;	//     7
} FEC_MON0;

/*-----------------------------------------------------------------------------
	0x00f6 fec_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vbber_15_8                      ;   	//  7: 0
} FEC_MON1;

/*-----------------------------------------------------------------------------
	0x00f7 fec_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vbber_7_0                       ;   	//  7: 0
} FEC_MON2;

/*-----------------------------------------------------------------------------
	0x00f8 fec_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vaber_15_8                      ;   	//  7: 0
} FEC_MON3;

/*-----------------------------------------------------------------------------
	0x00f9 fec_mon[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vaber_7_0                       ;   	//  7: 0
} FEC_MON4;

/*-----------------------------------------------------------------------------
	0x00fa fec_mon[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tperrcnt_7_0                    ;   	//  7: 0
} FEC_MON5;

/*-----------------------------------------------------------------------------
	0x00fb fec_mon[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	nberlock                        : 1;	//     7
} FEC_MON6;

/*-----------------------------------------------------------------------------
	0x00fc fec_mon[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nbervalue_31_24                 ;   	//  7: 0
} FEC_MON7;

/*-----------------------------------------------------------------------------
	0x00fd fec_mon[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nbervalue_23_16                 ;   	//  7: 0
} FEC_MON8;

/*-----------------------------------------------------------------------------
	0x00fe fec_mon[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nbervalue_15_8                  ;   	//  7: 0
} FEC_MON9;

/*-----------------------------------------------------------------------------
	0x00ff fec_mon[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nbervalue_7_0                   ;   	//  7: 0
} FEC_MON10;

/**************************************************************************************/
/**************************************************************************************/
/*************   Sync Register (0x10000 ~ 0x10ff)  ************************************/
/**************************************************************************************/
/**************************************************************************************/


/*-----------------------------------------------------------------------------
	0x1000 daft_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftopmode_4_0                  : 5,	//  0: 4
	                                : 1,	//     5 reserved
	sccalcpi4bypass                 : 1,	//     6
	scneverlock1shoten              : 1;	//     7
} DAFT_CTRL0;

/*-----------------------------------------------------------------------------
	0x1001 daft_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftdeltastep_1_0               : 2;	//  0: 1
} DAFT_CTRL1;

/*-----------------------------------------------------------------------------
	0x1002 daft_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftpi2waittime_3_0             : 4,	//  0: 3
	daftpi4waittime_3_0             : 4;	//  4: 7
} DAFT_CTRL2;

/*-----------------------------------------------------------------------------
	0x1003 daft_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftcalcwaittime_3_0            : 4;	//  0: 3
} DAFT_CTRL3;

/*-----------------------------------------------------------------------------
	0x1004 daft_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftzeroth_13_8                 : 6;	//  0: 5
} DAFT_CTRL4;

/*-----------------------------------------------------------------------------
	0x1005 daft_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftzeroth_7_0                  ;   	//  7: 0
} DAFT_CTRL5;

/*-----------------------------------------------------------------------------
	0x1006 daft_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftupth_13_8                   : 6;	//  0: 5
} DAFT_CTRL6;

/*-----------------------------------------------------------------------------
	0x1007 daft_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftupth_7_0                    ;   	//  7: 0
} DAFT_CTRL7;

/*-----------------------------------------------------------------------------
	0x1008 daft_ctrl[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daft1stpwrokth_15_8             ;   	//  7: 0
} DAFT_CTRL8;

/*-----------------------------------------------------------------------------
	0x1009 daft_ctrl[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daft1stpwrokth_7_0              ;   	//  7: 0
} DAFT_CTRL9;

/*-----------------------------------------------------------------------------
	0x100a daft_ctrl[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftpwrokth_15_8                ;   	//  7: 0
} DAFT_CTRL10;

/*-----------------------------------------------------------------------------
	0x100b daft_ctrl[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftpwrokth_7_0                 ;   	//  7: 0
} DAFT_CTRL11;

/*-----------------------------------------------------------------------------
	0x100c daft_ctrl[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftpwrmaxth_15_8               ;   	//  7: 0
} DAFT_CTRL12;

/*-----------------------------------------------------------------------------
	0x100d daft_ctrl[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	daftpwrmaxth_7_0                ;   	//  7: 0
} DAFT_CTRL13;

/*-----------------------------------------------------------------------------
	0x1010 srd_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdfbsymrate3_15_8              ;   	//  7: 0
} SRD_CTRL0;

/*-----------------------------------------------------------------------------
	0x1011 srd_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdfbsymrate3_7_0               ;   	//  7: 0
} SRD_CTRL1;

/*-----------------------------------------------------------------------------
	0x1012 srd_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdfbsymrate2_15_8              ;   	//  7: 0
} SRD_CTRL2;

/*-----------------------------------------------------------------------------
	0x1013 srd_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdfbsymrate2_7_0               ;   	//  7: 0
} SRD_CTRL3;

/*-----------------------------------------------------------------------------
	0x1014 srd_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdfbsymrate1_15_8              ;   	//  7: 0
} SRD_CTRL4;

/*-----------------------------------------------------------------------------
	0x1015 srd_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdfbsymrate1_7_0               ;   	//  7: 0
} SRD_CTRL5;

/*-----------------------------------------------------------------------------
	0x1016 srd_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdfbsymrate0_15_8              ;   	//  7: 0
} SRD_CTRL6;

/*-----------------------------------------------------------------------------
	0x1017 srd_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdfbsymrate0_7_0               ;   	//  7: 0
} SRD_CTRL7;

/*-----------------------------------------------------------------------------
	0x1018 srd_ctrl[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdscanstopsel_3_0              : 4,	//  0: 3
	srdscanstep_1_0                 : 2,	//  4: 5
	                                : 1,	//     6 reserved
	srdsymrateauto                  : 1;	//     7
} SRD_CTRL8;

/*-----------------------------------------------------------------------------
	0x1019 srd_ctrl[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	srdwaittime_7_0                 ;   	//  7: 0
} SRD_CTRL9;

/*-----------------------------------------------------------------------------
	0x101c qmd_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	qmdchknum_3_0                   : 4;	//  0: 3
} QMD_CTRL0;

/*-----------------------------------------------------------------------------
	0x101d qmd_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	qmdwaittime_7_0                 ;   	//  7: 0
} QMD_CTRL1;

/*-----------------------------------------------------------------------------
	0x101e qmd_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	qmdqammode4_2_0                 : 3;	//  0: 2
} QMD_CTRL2;

/*-----------------------------------------------------------------------------
	0x101f qmd_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	qmdqammode2_2_0                 : 3,	//  0: 2
	                                : 1,	//     3 reserved
	qmdqammode3_2_0                 : 3;	//  4: 6
} QMD_CTRL3;

/*-----------------------------------------------------------------------------
	0x1020 qmd_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	qmdqammode0_2_0                 : 3,	//  0: 2
	                                : 1,	//     3 reserved
	qmdqammode1_2_0                 : 3;	//  4: 6
} QMD_CTRL4;

/*-----------------------------------------------------------------------------
	0x1024 v_top_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 1,	//     0 reserved
	scrstcnton_v                    : 1,	//     1
	scunlocknrsten_v                : 1,	//     2
	sceqchken_v                     : 1,	//     3
	scsyncchken_v                   : 1,	//     4
	scmsethsel_v                    : 1,	//     5
	scavgmseon_v                    : 1,	//     6
	scselfconen_v                   : 1;	//     7
} V_TOP_CTRL0;

/*-----------------------------------------------------------------------------
	0x1025 v_top_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	scmaxsynccnf_v_6_0              : 7;	//  0: 6
} V_TOP_CTRL1;

/*-----------------------------------------------------------------------------
	0x1026 v_top_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	scmaxeqcnf_v_6_0                : 7;	//  0: 6
} V_TOP_CTRL2;

/*-----------------------------------------------------------------------------
	0x1027 v_top_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	sclockcheck_v_23_16             ;   	//  7: 0
} V_TOP_CTRL3;

/*-----------------------------------------------------------------------------
	0x1028 v_top_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	sclockcheck_v_15_8              ;   	//  7: 0
} V_TOP_CTRL4;

/*-----------------------------------------------------------------------------
	0x1029 v_top_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	sclockcheck_v_7_0               ;   	//  7: 0
} V_TOP_CTRL5;

/*-----------------------------------------------------------------------------
	0x102a v_top_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	scfastrstcntth_v_2_0            : 3,	//  0: 2
	                                : 4,	//  3: 6 reserved
	mdppolauto_v                    : 1;	//     7
} V_TOP_CTRL6;

/*-----------------------------------------------------------------------------
	0x1030 sampling_ctrl_com[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	samerrgain_3_0                  : 4;	//  4: 7
} SAMPLING_CTRL_COM0;

/*-----------------------------------------------------------------------------
	0x1031 sampling_ctrl_com[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samerrdispsel_3_0               : 4,	//  0: 3
	samlfdispsel_1_0                : 2;	//  4: 5
} SAMPLING_CTRL_COM1;

/*-----------------------------------------------------------------------------
	0x1032 sampling_ctrl_di[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	aiccrejautosync_di              : 1,	//     4
	sampalmaskthen_di               : 1,	//     5
	sampalmasken_di                 : 1,	//     6
	sampalmaskauto_di               : 1;	//     7
} SAMPLING_CTRL_DI0;

/*-----------------------------------------------------------------------------
	0x1033 sampling_ctrl_di[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	sampalmaskth_di_7_0             ;   	//  7: 0
} SAMPLING_CTRL_DI1;

/*-----------------------------------------------------------------------------
	0x1034 sampling_ctrl_di[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	samlfupmode_di                  : 1;	//     7
} SAMPLING_CTRL_DI2;

/*-----------------------------------------------------------------------------
	0x1035 sampling_ctrl_di[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfki_di_14_8                 : 7,	//  0: 6
	samlfbwman_di                   : 1;	//     7
} SAMPLING_CTRL_DI3;

/*-----------------------------------------------------------------------------
	0x1036 sampling_ctrl_di[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfki_di_7_0                  ;   	//  7: 0
} SAMPLING_CTRL_DI4;

/*-----------------------------------------------------------------------------
	0x1037 sampling_ctrl_di[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfkp_di_14_8                 : 7;	//  0: 6
} SAMPLING_CTRL_DI5;

/*-----------------------------------------------------------------------------
	0x1038 sampling_ctrl_di[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfkp_di_7_0                  ;   	//  7: 0
} SAMPLING_CTRL_DI6;

/*-----------------------------------------------------------------------------
	0x103b sampling_ctrl_cqs[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samteddelta_cqs_7_0             ;   	//  7: 0
} SAMPLING_CTRL_CQS0;

/*-----------------------------------------------------------------------------
	0x103c sampling_ctrl_cqs[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samacpwrgain_cqs_2_0            : 3;	//  0: 2
} SAMPLING_CTRL_CQS1;

/*-----------------------------------------------------------------------------
	0x103d sampling_ctrl_cqs[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	samlockstep_cqs_2_0             : 3,	//  4: 6
	samstepmode_cqs                 : 1;	//     7
} SAMPLING_CTRL_CQS2;

/*-----------------------------------------------------------------------------
	0x103e sampling_ctrl_cqs[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samhumcnt_cqs_2_0               : 3,	//  0: 2
	                                : 1,	//     3 reserved
	samhumstep_cqs_2_0              : 3,	//  4: 6
	samhumen_cqs                    : 1;	//     7
} SAMPLING_CTRL_CQS3;

/*-----------------------------------------------------------------------------
	0x103f sampling_ctrl_cqs[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samhumupth_cqs_7_0              ;   	//  7: 0
} SAMPLING_CTRL_CQS4;

/*-----------------------------------------------------------------------------
	0x1040 sampling_ctrl_cqs[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samhumdnth_cqs_7_0              ;   	//  7: 0
} SAMPLING_CTRL_CQS5;

/*-----------------------------------------------------------------------------
	0x1041 sampling_ctrl_cqs[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfki_cqs_14_8                : 7,	//  0: 6
	samlfbwman_cqs                  : 1;	//     7
} SAMPLING_CTRL_CQS6;

/*-----------------------------------------------------------------------------
	0x1042 sampling_ctrl_cqs[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfki_cqs_7_0                 ;   	//  7: 0
} SAMPLING_CTRL_CQS7;

/*-----------------------------------------------------------------------------
	0x1043 sampling_ctrl_cqs[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfkp_cqs_14_8                : 7;	//  0: 6
} SAMPLING_CTRL_CQS8;

/*-----------------------------------------------------------------------------
	0x1044 sampling_ctrl_cqs[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfkp_cqs_7_0                 ;   	//  7: 0
} SAMPLING_CTRL_CQS9;

/*-----------------------------------------------------------------------------
	0x1047 sampling_ctrl_v[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	sammodesel_v_1_0                : 2,	//  0: 1
	                                : 3,	//  2: 4 reserved
	samcnormbp_v                    : 1,	//     5
	samcpsel_v                      : 1,	//     6
	samcdsel_v                      : 1;	//     7
} SAMPLING_CTRL_V0;

/*-----------------------------------------------------------------------------
	0x1048 sampling_ctrl_v[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samgsautoedl_v_1_0              : 2,	//  0: 1
	samgsautostl_v_1_0              : 2,	//  2: 3
	samgsbymse_v                    : 1;	//     4
} SAMPLING_CTRL_V1;

/*-----------------------------------------------------------------------------
	0x1049 sampling_ctrl_v[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samzgsel_v_1_0                  : 2,	//  0: 1
	samzpolauto_v                   : 1,	//     2
	samztedoneg_v                   : 1;	//     3
} SAMPLING_CTRL_V2;

/*-----------------------------------------------------------------------------
	0x104a sampling_ctrl_v[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfki_v_14_8                  : 7,	//  0: 6
	samlfbwman_v                    : 1;	//     7
} SAMPLING_CTRL_V3;

/*-----------------------------------------------------------------------------
	0x104b sampling_ctrl_v[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfki_v_7_0                   ;   	//  7: 0
} SAMPLING_CTRL_V4;

/*-----------------------------------------------------------------------------
	0x104c sampling_ctrl_v[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfkp_v_14_8                  : 7;	//  0: 6
} SAMPLING_CTRL_V5;

/*-----------------------------------------------------------------------------
	0x104d sampling_ctrl_v[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samlfkp_v_7_0                   ;   	//  7: 0
} SAMPLING_CTRL_V6;

/*-----------------------------------------------------------------------------
	0x1050 carrier_ctrl_com[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfdispsel_1_0                 : 2;	//  0: 1
} CARRIER_CTRL_COM0;

/*-----------------------------------------------------------------------------
	0x1052 carrier_ctrl_di[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crfgain_di_1_0                  : 2,	//  0: 1
	crtgain_di_1_0                  : 2,	//  2: 3
	                                : 2,	//  4: 5 reserved
	crtfedsel_di                    : 1,	//     6
	crtfauto_di                     : 1;	//     7
} CARRIER_CTRL_DI0;

/*-----------------------------------------------------------------------------
	0x1053 carrier_ctrl_di[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 3,	//  0: 2 reserved
	crlfupmode_di                   : 1,	//     3
	crtfedsumlen_di_2_0             : 3;	//  4: 6
} CARRIER_CTRL_DI1;

/*-----------------------------------------------------------------------------
	0x1054 carrier_ctrl_di[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfki_di_14_8                  : 7,	//  0: 6
	crlfbwman_di                    : 1;	//     7
} CARRIER_CTRL_DI2;

/*-----------------------------------------------------------------------------
	0x1055 carrier_ctrl_di[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfki_di_7_0                   ;   	//  7: 0
} CARRIER_CTRL_DI3;

/*-----------------------------------------------------------------------------
	0x1056 carrier_ctrl_di[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfkp_di_14_8                  : 7;	//  0: 6
} CARRIER_CTRL_DI4;

/*-----------------------------------------------------------------------------
	0x1057 carrier_ctrl_di[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfkp_di_7_0                   ;   	//  7: 0
} CARRIER_CTRL_DI5;

/*-----------------------------------------------------------------------------
	0x1058 carrier_ctrl_di[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crifooffset_di_9_8              : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	crifogain_di_1_0                : 2,	//  4: 5
	criforeiniten_di                : 1,	//     6
	crifoauto_di                    : 1;	//     7
} CARRIER_CTRL_DI6;

/*-----------------------------------------------------------------------------
	0x1059 carrier_ctrl_di[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crifooffset_di_7_0              ;   	//  7: 0
} CARRIER_CTRL_DI7;

/*-----------------------------------------------------------------------------
	0x105a carrier_ctrl_di[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crifolockcc_di_5_0              : 6;	//  0: 5
} CARRIER_CTRL_DI8;

/*-----------------------------------------------------------------------------
	0x105b carrier_ctrl_di[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crifoth_di_7_0                  ;   	//  7: 0
} CARRIER_CTRL_DI9;

/*-----------------------------------------------------------------------------
	0x105c carrier_ctrl_di[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 2,	//  0: 1 reserved
	crifopatternsel_i_1_0           : 2,	//  2: 3
	crifoloopsel_di                 : 1,	//     4
	crifoaccen_di                   : 1,	//     5
	crifohold_di                    : 1,	//     6
	crifoen_di                      : 1;	//     7
} CARRIER_CTRL_DI10;

/*-----------------------------------------------------------------------------
	0x105d carrier_ctrl_cqs[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfki_cqs_14_8                 : 7,	//  0: 6
	crlfbwman_cqs                   : 1;	//     7
} CARRIER_CTRL_CQS0;

/*-----------------------------------------------------------------------------
	0x105e carrier_ctrl_cqs[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfki_cqs_7_0                  ;   	//  7: 0
} CARRIER_CTRL_CQS1;

/*-----------------------------------------------------------------------------
	0x105f carrier_ctrl_cqs[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfkp_cqs_14_8                 : 7;	//  0: 6
} CARRIER_CTRL_CQS2;

/*-----------------------------------------------------------------------------
	0x1060 carrier_ctrl_cqs[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfkp_cqs_7_0                  ;   	//  7: 0
} CARRIER_CTRL_CQS3;

/*-----------------------------------------------------------------------------
	0x1061 carrier_ctrl_v[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfbwlockdet_v_1_0             : 2,	//  0: 1
	crmapbwauto_v                   : 1,	//     2
	crpolauto_v                     : 1,	//     3
	crmapgsel_v_2_0                 : 3,	//  4: 6
	crlockmd_v                      : 1;	//     7
} CARRIER_CTRL_V0;

/*-----------------------------------------------------------------------------
	0x1062 carrier_ctrl_v[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crmapbwedl_v_2_0                : 3,	//  0: 2
	                                : 1,	//     3 reserved
	crmapbwstl_v_2_0                : 3;	//  4: 6
} CARRIER_CTRL_V1;

/*-----------------------------------------------------------------------------
	0x1063 carrier_ctrl_v[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crgcon1th_v_7_0                 ;   	//  7: 0
} CARRIER_CTRL_V2;

/*-----------------------------------------------------------------------------
	0x1064 carrier_ctrl_v[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crgcon2th_v_7_0                 ;   	//  7: 0
} CARRIER_CTRL_V3;

/*-----------------------------------------------------------------------------
	0x1065 carrier_ctrl_v[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crgcon3th_v_7_0                 ;   	//  7: 0
} CARRIER_CTRL_V4;

/*-----------------------------------------------------------------------------
	0x1066 carrier_ctrl_v[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dmapdly_v                       : 1,	//     0
	syncigsel_v                     : 1,	//     1
	                                : 1,	//     2 reserved
	crgainmulsel_v                  : 1,	//     3
	crmode_v_1_0                    : 2,	//  4: 5
	                                : 1,	//     6 reserved
	cragcciren_v                    : 1;	//     7
} CARRIER_CTRL_V5;

/*-----------------------------------------------------------------------------
	0x1067 carrier_ctrl_v[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crgainrange1_v_7_0              ;   	//  7: 0
} CARRIER_CTRL_V6;

/*-----------------------------------------------------------------------------
	0x1068 carrier_ctrl_v[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crgainrange2_v_7_0              ;   	//  7: 0
} CARRIER_CTRL_V7;

/*-----------------------------------------------------------------------------
	0x1069 carrier_ctrl_v[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crgainrange3_v_7_0              ;   	//  7: 0
} CARRIER_CTRL_V8;

/*-----------------------------------------------------------------------------
	0x106a carrier_ctrl_v[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 2,	//  0: 1 reserved
	crdelfcsel_v                    : 1,	//     2
	crdeltafcen_v                   : 1,	//     3
	crdcestweight_v_2_0             : 3;	//  4: 6
} CARRIER_CTRL_V9;

/*-----------------------------------------------------------------------------
	0x106b carrier_ctrl_v[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crdeltafcp2x_v_4_0              : 5;	//  0: 4
} CARRIER_CTRL_V10;

/*-----------------------------------------------------------------------------
	0x106c carrier_ctrl_v[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crdeltafcp1x_v_4_0              : 5;	//  0: 4
} CARRIER_CTRL_V11;

/*-----------------------------------------------------------------------------
	0x106d carrier_ctrl_v[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crdeltafcm2x_v_4_0              : 5;	//  0: 4
} CARRIER_CTRL_V12;

/*-----------------------------------------------------------------------------
	0x106e carrier_ctrl_v[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crdeltafcm1x_v_4_0              : 5;	//  0: 4
} CARRIER_CTRL_V13;

/*-----------------------------------------------------------------------------
	0x106f carrier_ctrl_v[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 3,	//  0: 2 reserved
	crephnautooff_v                 : 1,	//     3
	                                : 2,	//  4: 5 reserved
	crephngain_v                    : 1,	//     6
	crephnen_v                      : 1;	//     7
} CARRIER_CTRL_V14;

/*-----------------------------------------------------------------------------
	0x1070 carrier_ctrl_v[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crephnth_v_7_0                  ;   	//  7: 0
} CARRIER_CTRL_V15;

/*-----------------------------------------------------------------------------
	0x1071 carrier_ctrl_v[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crephnthhighlow_v_7_0           ;   	//  7: 0
} CARRIER_CTRL_V16;

/*-----------------------------------------------------------------------------
	0x1072 carrier_ctrl_v[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crephnth10high_v_7_0            ;   	//  7: 0
} CARRIER_CTRL_V17;

/*-----------------------------------------------------------------------------
	0x1073 carrier_ctrl_v[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crephnth01low_v_7_0             ;   	//  7: 0
} CARRIER_CTRL_V18;

/*-----------------------------------------------------------------------------
	0x1074 carrier_ctrl_v[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crdmselowthsel_v_2_0            : 3,	//  0: 2
	                                : 1,	//     3 reserved
	crdmsethsel_v_2_0               : 3;	//  4: 6
} CARRIER_CTRL_V19;

/*-----------------------------------------------------------------------------
	0x1075 carrier_ctrl_v[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crdmselowthsela_v_2_0           : 3;	//  0: 2
} CARRIER_CTRL_V20;

/*-----------------------------------------------------------------------------
	0x1076 carrier_ctrl_v[21] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crdmselowthselbu_v_3_0          : 4,	//  0: 3
	crdmselowthselbd_v_2_0          : 3;	//  4: 6
} CARRIER_CTRL_V21;

/*-----------------------------------------------------------------------------
	0x1077 carrier_ctrl_v[22] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crdmselowthselcu_v_2_0          : 3,	//  0: 2
	                                : 1,	//     3 reserved
	crdmselowthselcd_v_2_0          : 3;	//  4: 6
} CARRIER_CTRL_V22;

/*-----------------------------------------------------------------------------
	0x1078 carrier_ctrl_v[23] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crptmsesela_v_2_0               : 3,	//  0: 2
	crphndetmode_v                  : 1,	//     3
	crptmsethsel_v_1_0              : 2,	//  4: 5
	crphnsearchlen_v_1_0            : 2;	//  6: 7
} CARRIER_CTRL_V23;

/*-----------------------------------------------------------------------------
	0x1079 carrier_ctrl_v[24] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crfastsweepcntth_v_2_0          : 3,	//  0: 2
	                                : 1,	//     3 reserved
	crsweepcntth_v_2_0              : 3,	//  4: 6
	crsweepnum_v                    : 1;	//     7
} CARRIER_CTRL_V24;

/*-----------------------------------------------------------------------------
	0x107a carrier_ctrl_v[25] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	crpgain_v_2_0                   : 3,	//  4: 6
	crpgainauto_v                   : 1;	//     7
} CARRIER_CTRL_V25;

/*-----------------------------------------------------------------------------
	0x107b carrier_ctrl_v[26] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crplfbw_v_1_0                   : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	crpbw_v_2_0                     : 3,	//  4: 6
	crpbwauto_v                     : 1;	//     7
} CARRIER_CTRL_V26;

/*-----------------------------------------------------------------------------
	0x107c carrier_ctrl_v[27] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfki_v_14_8                   : 7,	//  0: 6
	crlfbwman_v                     : 1;	//     7
} CARRIER_CTRL_V27;

/*-----------------------------------------------------------------------------
	0x107d carrier_ctrl_v[28] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfki_v_7_0                    ;   	//  7: 0
} CARRIER_CTRL_V28;

/*-----------------------------------------------------------------------------
	0x107e carrier_ctrl_v[29] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfkp_v_14_8                   : 7;	//  0: 6
} CARRIER_CTRL_V29;

/*-----------------------------------------------------------------------------
	0x107f carrier_ctrl_v[30] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crlfkp_v_7_0                    ;   	//  7: 0
} CARRIER_CTRL_V30;

/*-----------------------------------------------------------------------------
	0x1080 sys_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 6,	//  0: 5 reserved
	srdstatus_1_0                   : 2;	//  6: 7
} SYS_MON0;

/*-----------------------------------------------------------------------------
	0x1081 sys_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 6,	//  0: 5 reserved
	qmdstatus_1_0                   : 2;	//  6: 7
} SYS_MON1;

/*-----------------------------------------------------------------------------
	0x1094 sampling_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samhumstatus_cqs                : 1,	//     0
	                                : 3,	//  1: 3 reserved
	samlockstatus_cqs_2_0           : 3,	//  4: 6
	samlock_cqs                     : 1;	//     7
} SAMPLING_MON0;

/*-----------------------------------------------------------------------------
	0x1095 sampling_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samhumfreqdiff_v_7_0            ;   	//  7: 0
} SAMPLING_MON1;

/*-----------------------------------------------------------------------------
	0x1097 sampling_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	samgsstatus_v_2_0               : 3;	//  0: 2
} SAMPLING_MON2;

/*-----------------------------------------------------------------------------
	0x10a3 carrier_mon[[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crifolock_di                    : 1,	//     0
	                                : 6,	//  1: 6 reserved
	crfedstatus_di                  : 1;	//     7
} CARRIER_MON0;

/*-----------------------------------------------------------------------------
	0x10a4 carrier_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crifo_di_9_8                    : 2;	//  0: 1
} CARRIER_MON1;

/*-----------------------------------------------------------------------------
	0x10a5 carrier_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crifo_di_7_0                    ;   	//  7: 0
} CARRIER_MON2;

/*-----------------------------------------------------------------------------
	0x10b0 carrier_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crcfooob_v                      : 1,	//     0
	crptsnrhigh_v                   : 1,	//     1
	crptsnrlow_v                    : 1,	//     2
	crdemodsnrhigh_v                : 1,	//     3
	crdemodsnrlow_v                 : 1,	//     4
	crephnmodedisable_v             : 1,	//     5
	crphnheavy_v                    : 1,	//     6
	crephnmode_v                    : 1;	//     7
} CARRIER_MON3;

/*-----------------------------------------------------------------------------
	0x10b1 carrier_mon[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crpedovarest_v_7_0              ;   	//  7: 0
} CARRIER_MON4;

/*-----------------------------------------------------------------------------
	0x10b2 carrier_mon[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crphnphaseerr_v_13_8            : 6;	//  0: 5
} CARRIER_MON5;

/*-----------------------------------------------------------------------------
	0x10b3 carrier_mon[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crphnphaseerr_v_7_0             ;   	//  7: 0
} CARRIER_MON6;

/*-----------------------------------------------------------------------------
	0x10b4 carrier_mon[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	crgainautoqped_v_2_0            : 3,	//  0: 2
	                                : 1,	//     3 reserved
	crbwautoqped_v_2_0              : 3;	//  4: 6
} CARRIER_MON7;

/*-----------------------------------------------------------------------------
	0x10b5 carrier_mon[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	demodmse_v_12_8                 : 5,	//  0: 4
	demodsnrc_v                     : 1,	//     5
	demodsnrb_v                     : 1,	//     6
	demodsnra_v                     : 1;	//     7
} CARRIER_MON8;

/*-----------------------------------------------------------------------------
	0x10b6 carrier_mon[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	demodmse_v_7_0                  ;   	//  7: 0
} CARRIER_MON9;

/*-----------------------------------------------------------------------------
	0x10c0 carrier_mon[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	msetovgd_v                      : 1;	//     7
} CARRIER_MON10;


/**************************************************************************************/
/**************************************************************************************/
/***********    EQ_V Register (0x21000 ~ 0x21ff)  *************************************/
/**************************************************************************************/
/**************************************************************************************/


/*-----------------------------------------------------------------------------
	0x2100 cir[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cmasksel_1_0                    : 2,	//  0: 1
	cmaskwinsel                     : 1,	//     2
	                                : 1,	//     3 reserved
	cwpasel                         : 1,	//     4
	cwsasel                         : 1,	//     5
	vconfsel_1_0                    : 2;	//  6: 7
} CIR0;

/*-----------------------------------------------------------------------------
	0x2101 cir[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fbconf_3_0                      : 4,	//  0: 3
	eqinitmseconf_1_0               : 2,	//  4: 5
	antctrleqb                      : 1,	//     6
	fbtracken                       : 1;	//     7
} CIR1;

/*-----------------------------------------------------------------------------
	0x2102 cir[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	refmaxsel_1_0                   : 2,	//  0: 1
	mindiff_1_0                     : 2,	//  2: 3
	multiconf_1_0                   : 2,	//  4: 5
	ghostnum_1_0                    : 2;	//  6: 7
} CIR2;

/*-----------------------------------------------------------------------------
	0x2103 cir[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thcirvalid_7_0                  ;   	//  7: 0
} CIR3;

/*-----------------------------------------------------------------------------
	0x2104 cir[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thfbon_7_0                      ;   	//  7: 0
} CIR4;

/*-----------------------------------------------------------------------------
	0x2105 cir[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thfboff_7_0                     ;   	//  7: 0
} CIR5;

/*-----------------------------------------------------------------------------
	0x2106 cir[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thmultion_7_0                   ;   	//  7: 0
} CIR6;

/*-----------------------------------------------------------------------------
	0x2107 cir[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thmultioff_7_0                  ;   	//  7: 0
} CIR7;

/*-----------------------------------------------------------------------------
	0x2108 cir[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thmulticnton_7_0                ;   	//  7: 0
} CIR8;

/*-----------------------------------------------------------------------------
	0x2109 cir[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thmulticntoff_7_0               ;   	//  7: 0
} CIR9;

/*-----------------------------------------------------------------------------
	0x210a cir[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thcleanon_7_0                   ;   	//  7: 0
} CIR10;

/*-----------------------------------------------------------------------------
	0x210b cir[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thcleanoff_7_0                  ;   	//  7: 0
} CIR11;

/*-----------------------------------------------------------------------------
	0x210c cir[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	swphncirmode_1_0                : 2,	//  4: 5
	                                : 1,	//     6 reserved
	swcragcmode                     : 1;	//     7
} CIR12;

/*-----------------------------------------------------------------------------
	0x210d cir[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thmainphnon_7_0                 ;   	//  7: 0
} CIR13;

/*-----------------------------------------------------------------------------
	0x210e cir[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thmainphnoff_7_0                ;   	//  7: 0
} CIR14;

/*-----------------------------------------------------------------------------
	0x210f cir[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thphnenciron_7_0                ;   	//  7: 0
} CIR15;

/*-----------------------------------------------------------------------------
	0x2110 cir[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thphnenciroff_7_0               ;   	//  7: 0
} CIR16;

/*-----------------------------------------------------------------------------
	0x2111 cir[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thphnencirdiff_7_0              ;   	//  7: 0
} CIR17;

/*-----------------------------------------------------------------------------
	0x2112 cir[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thmaxpwrcragchigh_7_0           ;   	//  7: 0
} CIR18;

/*-----------------------------------------------------------------------------
	0x2113 cir[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thmaxpwrcragclow_7_0            ;   	//  7: 0
} CIR19;

/*-----------------------------------------------------------------------------
	0x2114 cir[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nsyncholdfield_5_0              : 6,	//  0: 5
	nsynchold                       : 1,	//     6
	nsyncholden                     : 1;	//     7
} CIR20;

/*-----------------------------------------------------------------------------
	0x2115 cir[21] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	ptmseth4nsync_2_0               : 3;	//  0: 2
} CIR21;

/*-----------------------------------------------------------------------------
	0x2116 cir[22] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	distance_2_0                    : 3,	//  0: 2
	                                : 1,	//     3 reserved
	vconfselssd_2_0                 : 3,	//  4: 6
	dsspos                          : 1;	//     7
} CIR22;

/*-----------------------------------------------------------------------------
	0x2117 cir[23] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	ghosttnum                       : 3,	//  0: 2
	                                : 1,	//     3 reserved
	noghostcnt_1_0                  : 2,	//  4: 5
	                                : 1,	//     6 reserved
	ghostdirect                     : 1;	//     7
} CIR23;

/*-----------------------------------------------------------------------------
	0x2118 cir[24] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thdfb5us_7_0                    ;   	//  7: 0
} CIR24;

/*-----------------------------------------------------------------------------
	0x2119 cir[25] ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x211a cir[26] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	cirlockhold                     : 1,	//     4
	                                : 1,	//     5 reserved
	th5usdiff_1_0                   : 2;	//  6: 7
} CIR26;

/*-----------------------------------------------------------------------------
	0x211c eq_control[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	eqauto                          : 1;	//     0
} EQ_CONTROL0;

/*-----------------------------------------------------------------------------
	0x211d eq_control[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fdeqstep_3_0                    : 4,	//  0: 3
	msedynthd_1_0                   : 2,	//  4: 5
	msestaticthd_1_0                : 2;	//  6: 7
} EQ_CONTROL1;

/*-----------------------------------------------------------------------------
	0x211e eq_control[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fbfstep_2_0                     : 3,	//  0: 2
	                                : 1,	//     3 reserved
	usepregflag                     : 1,	//     4
	blindalgsel                     : 1,	//     5
	npblindon                       : 1,	//     6
	npnpon                          : 1;	//     7
} EQ_CONTROL2;

/*-----------------------------------------------------------------------------
	0x211f eq_control[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	phderotbwsel_3_0                : 4;	//  0: 3
} EQ_CONTROL3;

/*-----------------------------------------------------------------------------
	0x2120 eq_control[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	chmask_7_0                      ;   	//  7: 0
} EQ_CONTROL4;

/*-----------------------------------------------------------------------------
	0x2121 eq_control[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	chfast_7_0                      ;   	//  7: 0
} EQ_CONTROL5;

/*-----------------------------------------------------------------------------
	0x2122 eq_control[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	chslow_7_0                      ;   	//  7: 0
} EQ_CONTROL6;

/*-----------------------------------------------------------------------------
	0x2123 eq_control[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	acqfbf_2_0                      : 3,	//  0: 2
	                                : 1,	//     3 reserved
	acqfdeq_3_0                     : 4;	//  4: 7
} EQ_CONTROL7;

/*-----------------------------------------------------------------------------
	0x2124 eq_control[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	staticacqfbf_2_0                : 3,	//  0: 2
	                                : 1,	//     3 reserved
	staticacqfdeq_3_0               : 4;	//  4: 7
} EQ_CONTROL8;

/*-----------------------------------------------------------------------------
	0x2125 eq_control[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	statictrackfbf_2_0              : 3,	//  0: 2
	                                : 1,	//     3 reserved
	statictrackfdeq_3_0             : 4;	//  4: 7
} EQ_CONTROL9;

/*-----------------------------------------------------------------------------
	0x2126 eq_control[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	badsinglestatictrackfdeq_3_0    : 4,	//  0: 3
	badstatictrackfdeq_3_0          : 4;	//  4: 7
} EQ_CONTROL10;

/*-----------------------------------------------------------------------------
	0x2127 eq_control[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	badstatictrackfbf_2_0           : 3,	//  0: 2
	                                : 1,	//     3 reserved
	baddynphderotbwsel_3_0          : 4;	//  4: 7
} EQ_CONTROL11;

/*-----------------------------------------------------------------------------
	0x2128 eq_control[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	phnboost                        : 1,	//     0
	phnboosten                      : 1;	//     1
} EQ_CONTROL12;

/*-----------------------------------------------------------------------------
	0x2129 eq_control[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dyntrackfbf_2_0                 : 3,	//  0: 2
	                                : 1,	//     3 reserved
	dyntrackfdeq_3_0                : 4;	//  4: 7
} EQ_CONTROL13;

/*-----------------------------------------------------------------------------
	0x212a eq_control[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	baddyntrackfbf_2_0              : 3,	//  0: 2
	                                : 1,	//     3 reserved
	baddyntrackfdeq_3_0             : 4;	//  4: 7
} EQ_CONTROL14;

/*-----------------------------------------------------------------------------
	0x212b eeq_control[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	phnboostphderotbwsel_3_0        : 4,	//  0: 3
	badphderotbwsel_3_0             : 4;	//  4: 7
} EEQ_CONTROL15;

/*-----------------------------------------------------------------------------
	0x212c eq_control[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	staticgo2gdcnt_3_0              : 4,	//  0: 3
	staticgo2badcnt_3_0             : 4;	//  4: 7
} EQ_CONTROL16;

/*-----------------------------------------------------------------------------
	0x212d eq_control[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	dyngo2gdcnt_3_0                 : 4,	//  0: 3
	dyngo2badcnt_3_0                : 4;	//  4: 7
} EQ_CONTROL17;

/*-----------------------------------------------------------------------------
	0x212e eq_control[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	diffmainphthd_17_16             : 2,	//  0: 1
	                                : 4,	//  2: 5 reserved
	trkexit_1_0                     : 2;	//  6: 7
} EQ_CONTROL18;

/*-----------------------------------------------------------------------------
	0x212f eq_control[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	diffmainphthd_15_8              ;   	//  7: 0
} EQ_CONTROL19;

/*-----------------------------------------------------------------------------
	0x2130 eq_control[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	diffmainphthd_7_0               ;   	//  7: 0
} EQ_CONTROL20;

/*-----------------------------------------------------------------------------
	0x2131 fdlms[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	pnormthd_1_0                    : 2,	//  0: 1
	pnormsel                        : 1,	//     2
	                                : 1,	//     3 reserved
	nautoload                       : 1,	//     4
	ncirload                        : 1,	//     5
	eqbypass                        : 1,	//     6
	eqfreeze                        : 1;	//     7
} FDLMS0;

/*-----------------------------------------------------------------------------
	0x2132 fdlms[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	cirqen                          : 1,	//     4
	pwrsel                          : 1,	//     5
	cpxwinen                        : 1,	//     6
	cpxeqen                         : 1;	//     7
} FDLMS1;

/*-----------------------------------------------------------------------------
	0x2135 error_gen[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	npstep_1_0                      : 2,	//  0: 1
	nptrmode_1_0                    : 2,	//  2: 3
	npbalgosel1                     : 1,	//     4
	npenedd                         : 1,	//     5
	initnpeq                        : 1,	//     6
	fbcason                         : 1;	//     7
} ERROR_GEN0;

/*-----------------------------------------------------------------------------
	0x2136 error_gen[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 3,	//  0: 2 reserved
	nnpfrz                          : 1,	//     3
	npcmastep                       : 1,	//     4
	npisfdlmsrston                  : 1,	//     5
	npspon                          : 1,	//     6
	npusemlse                       : 1;	//     7
} ERROR_GEN1;

/*-----------------------------------------------------------------------------
	0x2137 error_gen[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	npspth_5_0                      : 6;	//  0: 5
} ERROR_GEN2;

/*-----------------------------------------------------------------------------
	0x2138 error_gen[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	npvsbnprstth_3_0                : 4,	//  0: 3
	npvsbmsegdth_3_0                : 4;	//  4: 7
} ERROR_GEN3;

/*-----------------------------------------------------------------------------
	0x213b phase_derotator ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 3,	//  0: 2 reserved
	derotdden                       : 1,	//     3
	derotblen                       : 1,	//     4
	phderothold                     : 1,	//     5
	pedsel                          : 1,	//     6
	phderoten                       : 1;	//     7
} PHASE_DEROTATOR;

/*-----------------------------------------------------------------------------
	0x213e comb[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 5,	//  0: 4 reserved
	autocombrev                     : 1,	//     5
	npextncomb                      : 1,	//     6
	npncombw                        : 1;	//     7
} COMB0;

/*-----------------------------------------------------------------------------
	0x2140 isolation[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	posnslisol_17_16                : 2;	//  0: 1
} ISOLATION0;

/*-----------------------------------------------------------------------------
	0x2141 isolation[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	posnslisol_15_8                 ;   	//  7: 0
} ISOLATION1;

/*-----------------------------------------------------------------------------
	0x2142 isolation[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	posnslisol_7_0                  ;   	//  7: 0
} ISOLATION2;

/*-----------------------------------------------------------------------------
	0x2143 isolation[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	posfoeisol_17_16                : 2;	//  0: 1
} ISOLATION3;

/*-----------------------------------------------------------------------------
	0x2144 isolation[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	posfoeisol_15_8                 ;   	//  7: 0
} ISOLATION4;

/*-----------------------------------------------------------------------------
	0x2145 isolation[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	posfoeisol_7_0                  ;   	//  7: 0
} ISOLATION5;

/*-----------------------------------------------------------------------------
	0x2148 burst_detect[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstdetcnt_3_0                 : 4,	//  0: 3
	                                : 2,	//  4: 5 reserved
	burstwinen                      : 1,	//     6
	burstdeten                      : 1;	//     7
} BURST_DETECT0;

/*-----------------------------------------------------------------------------
	0x2149 burst_detect[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstonmsediff_20_16            : 5;	//  0: 4
} BURST_DETECT1;

/*-----------------------------------------------------------------------------
	0x214a burst_detect[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstonmsediff_15_8             ;   	//  7: 0
} BURST_DETECT2;

/*-----------------------------------------------------------------------------
	0x214b burst_detect[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstonmsediff_7_0              ;   	//  7: 0
} BURST_DETECT3;

/*-----------------------------------------------------------------------------
	0x214c burst_detect[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoffmsediff_20_16           : 5;	//  0: 4
} BURST_DETECT4;

/*-----------------------------------------------------------------------------
	0x214d burst_detect[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoffmsediff_15_8            ;   	//  7: 0
} BURST_DETECT5;

/*-----------------------------------------------------------------------------
	0x214e burst_detect[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoffmsediff_7_0             ;   	//  7: 0
} BURST_DETECT6;

/*-----------------------------------------------------------------------------
	0x214f burst_detect[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoncnf_11_8                 : 4;	//  0: 3
} BURST_DETECT7;

/*-----------------------------------------------------------------------------
	0x2150 burst_detect[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoncnf_7_0                  ;   	//  7: 0
} BURST_DETECT8;

/*-----------------------------------------------------------------------------
	0x2151 burst_detect[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoffcnf_11_8                : 4;	//  0: 3
} BURST_DETECT9;

/*-----------------------------------------------------------------------------
	0x2152 burst_detect[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoffcnf_7_0                 ;   	//  7: 0
} BURST_DETECT10;

/*-----------------------------------------------------------------------------
	0x2153 burst_detect[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstwinmsediff_20_16           : 5;	//  0: 4
} BURST_DETECT11;

/*-----------------------------------------------------------------------------
	0x2154 burst_detect[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstwinmsediff_15_8            ;   	//  7: 0
} BURST_DETECT12;

/*-----------------------------------------------------------------------------
	0x2155 burst_detect[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstwinmsediff_7_0             ;   	//  7: 0
} BURST_DETECT13;

/*-----------------------------------------------------------------------------
	0x2156 eq_dyndet[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	slowdyntrackfbf_2_0             : 3,	//  0: 2
	                                : 1,	//     3 reserved
	slowdyntrackfdeq_3_0            : 4;	//  4: 7
} EQ_DYNDET0;

/*-----------------------------------------------------------------------------
	0x2157 eq_dyndet[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	badslowdyntrackfbf_2_0          : 3,	//  0: 2
	                                : 1,	//     3 reserved
	badslowdyntrackfdeq_3_0         : 4;	//  4: 7
} EQ_DYNDET1;

/*-----------------------------------------------------------------------------
	0x2180 cir[27] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fbdlycir_9_8                    : 2;	//  0: 1
} CIR27;

/*-----------------------------------------------------------------------------
	0x2181 cir[28] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fbdlycir_7_0                    ;   	//  7: 0
} CIR28;

/*-----------------------------------------------------------------------------
	0x2182 cir[29] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thpathcnt_3_0                   : 4,	//  0: 3
	outofwin                        : 1,	//     4
	ncombdet                        : 1,	//     5
	isclean                         : 1,	//     6
	ismulti                         : 1;	//     7
} CIR29;

/*-----------------------------------------------------------------------------
	0x2183 cir[30] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpinlockstate_2_0               : 3,	//  0: 2
	                                : 3,	//  3: 5 reserved
	tpmultimaxpwr                   : 1,	//     6
	tpmulticnt                      : 1;	//     7
} CIR30;

/*-----------------------------------------------------------------------------
	0x2184 cir[31] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	delaydiffcragc_10_8             : 3,	//  0: 2
	tpmaxlocssdreload_1_0           : 2,	//  3: 4
	tpnsrd2rls                      : 1,	//     5
	phnencir                        : 1,	//     6
	tpmainstrongphn                 : 1;	//     7
} CIR31;

/*-----------------------------------------------------------------------------
	0x2185 cir[32] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	delaydiffcragc_7_0              ;   	//  7: 0
} CIR32;

/*-----------------------------------------------------------------------------
	0x2186 cir[33] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	maxpwrmain_12_8                 : 5,	//  0: 4
	                                : 2,	//  5: 6 reserved
	msegoodtot                      : 1;	//     7
} CIR33;

/*-----------------------------------------------------------------------------
	0x2187 cir[34] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	maxpwrmain_7_0                  ;   	//  7: 0
} CIR34;

/*-----------------------------------------------------------------------------
	0x2188 cir[35] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	maxpwrghost_12_8                : 5,	//  0: 4
	                                : 2,	//  5: 6 reserved
	isghost                         : 1;	//     7
} CIR35;

/*-----------------------------------------------------------------------------
	0x2189 cir[36] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	maxpwrghost_7_0                 ;   	//  7: 0
} CIR36;

/*-----------------------------------------------------------------------------
	0x218a cir[37] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 6,	//  0: 5 reserved
	preghost                        : 1,	//     6
	ghost5uson                      : 1;	//     7
} CIR37;

/*-----------------------------------------------------------------------------
	0x218b cir[38] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	delaydiff_7_0                   ;   	//  7: 0
} CIR38;

/*-----------------------------------------------------------------------------
	0x218e eq_control[21] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fbfstepout_2_0                  : 3,	//  0: 2
	                                : 1,	//     3 reserved
	fdeqstepout_3_0                 : 4;	//  4: 7
} EQ_CONTROL21;

/*-----------------------------------------------------------------------------
	0x218f eq_control[22] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	phderotbwselout_3_0             : 4,	//  0: 3
	nponout                         : 1,	//     4
	blindonout                      : 1,	//     5
	blindalgselout                  : 1,	//     6
	phnboostout                     : 1;	//     7
} EQ_CONTROL22;

/*-----------------------------------------------------------------------------
	0x2190 eq_control[23] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	chmode_1_0                      : 2,	//  0: 1
	                                : 4,	//  2: 5 reserved
	msestatic                       : 1,	//     6
	msedyn                          : 1;	//     7
} EQ_CONTROL23;

/*-----------------------------------------------------------------------------
	0x2191 eq_control[24] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	chdiff_7_0                      ;   	//  7: 0
} EQ_CONTROL24;

/*-----------------------------------------------------------------------------
	0x2192 eq_control[25] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	diffmainph_17_16                : 2;	//  0: 1
} EQ_CONTROL25;

/*-----------------------------------------------------------------------------
	0x2193 eq_control[26] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	diffmainph_15_8                 ;   	//  7: 0
} EQ_CONTROL26;

/*-----------------------------------------------------------------------------
	0x2194 eq_control[27] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	diffmainph_7_0                  ;   	//  7: 0
} EQ_CONTROL27;

/*-----------------------------------------------------------------------------
	0x2195 eq_control[28] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	eqstate_2_0                     : 4,	//  0: 3
	stateflow_3_0                   : 4;	//  4: 7
} EQ_CONTROL28;

/*-----------------------------------------------------------------------------
	0x2196 fdlms[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	initeq                          : 1;	//     7
} FDLMS2;

/*-----------------------------------------------------------------------------
	0x2199 error_gen[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 5,	//  0: 4 reserved
	msebad14db                      : 1,	//     5
	msebad12db                      : 1,	//     6
	msegood10db                     : 1;	//     7
} ERROR_GEN4;

/*-----------------------------------------------------------------------------
	0x219c comb[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 5,	//  0: 4 reserved
	ncombcntlsb                     : 1,	//     5
	ncommask                        : 1,	//     6
	ncombstatevsb                   : 1;	//     7
} COMB1;

/*-----------------------------------------------------------------------------
	0x219e burst_detect[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	msediff_19_16                   : 4,	//  0: 3
	                                : 2,	//  4: 5 reserved
	burstwin                        : 1,	//     6
	burston                         : 1;	//     7
} BURST_DETECT14;

/*-----------------------------------------------------------------------------
	0x219f burst_detect[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	msediff_15_8                    ;   	//  7: 0
} BURST_DETECT15;

/*-----------------------------------------------------------------------------
	0x21a0 burst_detect[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	msediff_7_0                     ;   	//  7: 0
} BURST_DETECT16;

/*-----------------------------------------------------------------------------
	0x21a1 burst_detect[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstonconfcnt_11_8             : 4;	//  0: 3
} BURST_DETECT17;

/*-----------------------------------------------------------------------------
	0x21a2 burst_detect[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstonconfcnt_7_0              ;   	//  7: 0
} BURST_DETECT18;

/*-----------------------------------------------------------------------------
	0x21a3 burst_detect[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoffconfcnt_11_8            : 4;	//  0: 3
} BURST_DETECT19;

/*-----------------------------------------------------------------------------
	0x21a4 burst_detect[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstoffconfcnt_7_0             ;   	//  7: 0
} BURST_DETECT20;



/**************************************************************************************/
/**************************************************************************************/
/***********    EQ_DI Register (0x22000 ~ 0x22ff)  ************************************/
/**************************************************************************************/
/**************************************************************************************/


/*-----------------------------------------------------------------------------
	0x2200 sto_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cstoforceen                     : 1,	//     0
	stodlyspadj                     : 1,	//     1
	stochken                        : 1,	//     2
	stoadjen                        : 1,	//     3
	dlyspfzenb                      : 1,	//     4
	cstotrken                       : 1,	//     5
	stoselauto                      : 1,	//     6
	stofzenb                        : 1;	//     7
} STO_CTRL0;

/*-----------------------------------------------------------------------------
	0x2202 sto_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stochkint_1_0                   : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	stochkcc_2_0                    : 3;	//  4: 6
} STO_CTRL1;

/*-----------------------------------------------------------------------------
	0x2203 sto_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stocorrectmode_i_1_0            : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	stoadjwaitcnt_2_0               : 3;	//  4: 6
} STO_CTRL2;

/*-----------------------------------------------------------------------------
	0x2204 sto_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stocirbnd_9_8                   : 2,	//  0: 1
	stocirbndauto                   : 1;	//     2
} STO_CTRL3;

/*-----------------------------------------------------------------------------
	0x2205 sto_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stocirbnd_7_0                   ;   	//  7: 0
} STO_CTRL4;

/*-----------------------------------------------------------------------------
	0x2206 sto_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stoogimargin_7_0                ;   	//  7: 0
} STO_CTRL5;

/*-----------------------------------------------------------------------------
	0x2208 palrej_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	paldetmaskth_1_0                : 2,	//  0: 1
	                                : 4,	//  2: 5 reserved
	paldethold                      : 1,	//     6
	paldeten                        : 1;	//     7
} PALREJ_CTRL0;

/*-----------------------------------------------------------------------------
	0x2209 palrej_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	paldetfiltsel_4_0               : 5;	//  0: 4
} PALREJ_CTRL1;

/*-----------------------------------------------------------------------------
	0x220a palrej_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	paldetth_7_0                    ;   	//  7: 0
} PALREJ_CTRL2;

/*-----------------------------------------------------------------------------
	0x220b beek_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	beekdispsel_1_0                 : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	beekcorrmode_1_0                : 2,	//  4: 5
	                                : 1,	//     6 reserved
	beekdatasel                     : 1;	//     7
} BEEK_CTRL0;

/*-----------------------------------------------------------------------------
	0x220c csto_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cstoposctrlth_2_0               : 3,	//  0: 2
	cstoposctrlen                   : 1,	//     3
	cstostartcnt_1_0                : 2,	//  4: 5
	cstoint_1_0                     : 2;	//  6: 7
} CSTO_CTRL0;

/*-----------------------------------------------------------------------------
	0x220d csto_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cstostth_7_0                    ;   	//  7: 0
} CSTO_CTRL1;

/*-----------------------------------------------------------------------------
	0x2210 fsto_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstostateinfo_2_0               : 3,	//  0: 2
	                                : 1,	//     3 reserved
	fstoposctrl_1_0                 : 2,	//  4: 5
	fstomode_1_0                    : 2;	//  6: 7
} FSTO_CTRL0;

/*-----------------------------------------------------------------------------
	0x2211 fsto_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 2,	//  0: 1 reserved
	fstolpfsel_1_0                  : 2,	//  2: 3
	fstoupcc_2_0                    : 3,	//  4: 6
	fstoupmode                      : 1;	//     7
} FSTO_CTRL1;

/*-----------------------------------------------------------------------------
	0x2212 fsto_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstoogimargin_3_0               : 4;	//  0: 3
} FSTO_CTRL2;

/*-----------------------------------------------------------------------------
	0x2214 cir_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	ciriirctrl_2_0                  : 3,	//  0: 2
	                                : 1,	//     3 reserved
	cirgpctrl_1_0                   : 2,	//  4: 5
	cirautomode_d                   : 1,	//     6
	cirautoen                       : 1;	//     7
} CIR_CTRL0;

/*-----------------------------------------------------------------------------
	0x2215 cir_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwrctrl_3_0                  : 4;	//  0: 3
} CIR_CTRL1;

/*-----------------------------------------------------------------------------
	0x2216 cir_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirth_9_8                       : 2,	//  0: 1
	ciredge_1_0                     : 2,	//  2: 3
	cirdetth_1_0                    : 2,	//  4: 5
	cirlockctrl                     : 1,	//     6
	cirgrmarginen                   : 1;	//     7
} CIR_CTRL2;

/*-----------------------------------------------------------------------------
	0x2217 cir_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirth_7_0                       ;   	//  7: 0
} CIR_CTRL3;

/*-----------------------------------------------------------------------------
	0x2218 cir_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirloopdly_4_0                  : 5;	//  0: 4
} CIR_CTRL4;

/*-----------------------------------------------------------------------------
	0x221c dieq_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 6,	//  0: 5 reserved
	pprauto                         : 1,	//     6
	tien                            : 1;	//     7
} DIEQ_CTRL0;

/*-----------------------------------------------------------------------------
	0x221d dieq_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	fiedgermvmode_1_0               : 2,	//  4: 5
	fiedgehold                      : 1,	//     6
	fiauto                          : 1;	//     7
} DIEQ_CTRL1;

/*-----------------------------------------------------------------------------
	0x221e dieq_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fifiltsel_7_0                   ;   	//  7: 0
} DIEQ_CTRL2;

/*-----------------------------------------------------------------------------
	0x221f dieq_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fiedgermvth_7_0                 ;   	//  7: 0
} DIEQ_CTRL3;

/*-----------------------------------------------------------------------------
	0x2221 dieq_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	aiccrejautoeq_di                : 1;	//     7
} DIEQ_CTRL4;

/*-----------------------------------------------------------------------------
	0x2222 dieq_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	csicoeff_2_0                    : 3,	//  0: 2
	csirngsel                       : 1,	//     3
	csimode                         : 1,	//     4
	csiauto                         : 1,	//     5
	csien                           : 1,	//     6
	eqdcen                          : 1;	//     7
} DIEQ_CTRL5;

/*-----------------------------------------------------------------------------
	0x2223 dieq_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	csitovminth_3_0                 : 4,	//  0: 3
	csitovmaxth_3_0                 : 4;	//  4: 7
} DIEQ_CTRL6;

/*-----------------------------------------------------------------------------
	0x2224 dieq_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	csimaxth_7_0                    ;   	//  7: 0
} DIEQ_CTRL7;

/*-----------------------------------------------------------------------------
	0x2225 dieq_ctrl[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	csiminth_7_0                    ;   	//  7: 0
} DIEQ_CTRL8;

/*-----------------------------------------------------------------------------
	0x2226 dieq_ctrl[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	csictrl_3_0                     : 4,	//  0: 3
	                                : 3,	//  4: 6 reserved
	diffgainctrl                    : 1;	//     7
} DIEQ_CTRL9;

/*-----------------------------------------------------------------------------
	0x2228 dieq_ctrl[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 6,	//  0: 5 reserved
	eqfastmanmode                   : 1,	//     6
	eqfastenb                       : 1;	//     7
} DIEQ_CTRL10;

/*-----------------------------------------------------------------------------
	0x2229 dieq_ctrl[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpsparity_15_8                  ;   	//  7: 0
} DIEQ_CTRL11;

/*-----------------------------------------------------------------------------
	0x222a dieq_ctrl[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tpsparity_7_0                   ;   	//  7: 0
} DIEQ_CTRL12;

/*-----------------------------------------------------------------------------
	0x222b dieq_ctrl[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccparity_15_8                 ;   	//  7: 0
} DIEQ_CTRL13;

/*-----------------------------------------------------------------------------
	0x222c dieq_ctrl[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tmccparity_7_0                  ;   	//  7: 0
} DIEQ_CTRL14;

/*-----------------------------------------------------------------------------
	0x2230 fsto_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstoisiintv1_2_0                : 3,	//  0: 2
	                                : 1,	//     3 reserved
	fstoisiintv0_2_0                : 3,	//  4: 6
	fstoisitrken                    : 1;	//     7
} FSTO_CTRL3;

/*-----------------------------------------------------------------------------
	0x2231 fsto_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstoisithr0_3_0                 : 4,	//  0: 3
	fstoisicnf_2_0                  : 3;	//  4: 6
} FSTO_CTRL4;

/*-----------------------------------------------------------------------------
	0x2232 fsto_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstoisithr2_3_0                 : 4,	//  0: 3
	fstoisithr1_3_0                 : 4;	//  4: 7
} FSTO_CTRL5;

/*-----------------------------------------------------------------------------
	0x2280 sto_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstoisistatus_2_0               : 3,	//  0: 2
	                                : 2,	//  3: 4 reserved
	ogipredet                       : 1,	//     5
	fstostatus                      : 1,	//     6
	cstostartlock                   : 1;	//     7
} STO_MON0;

/*-----------------------------------------------------------------------------
	0x2281 sto_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	palfiltstatus_4_0               : 5;	//  0: 4
} STO_MON1;

/*-----------------------------------------------------------------------------
	0x2282 sto_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stocirbndvalue_9_8              : 2,	//  0: 1
	                                : 3,	//  2: 4 reserved
	stocurstatus_1_0                : 2,	//  5: 6
	stospstatus                     : 1;	//     7
} STO_MON2;

/*-----------------------------------------------------------------------------
	0x2283 sto_mon[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	stocirbndvalue_7_0              ;   	//  7: 0
} STO_MON3;

/*-----------------------------------------------------------------------------
	0x2286 iir_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwrmin_15_8                  ;   	//  7: 0
} IIR_MON0;

/*-----------------------------------------------------------------------------
	0x2287 iir_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cirpwrmin_7_0                   ;   	//  7: 0
} IIR_MON1;

/*-----------------------------------------------------------------------------
	0x228b fi_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fifiltstatus_7_0                ;   	//  7: 0
} FI_MON0;

/*-----------------------------------------------------------------------------
	0x228c fi_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	fiedgecompstatus                : 1;	//     7
} FI_MON1;

/*-----------------------------------------------------------------------------
	0x2290 posteq_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	layerinfo_i_1_0                 : 2;	//  0: 1
} POSTEQ_MON0;

/*-----------------------------------------------------------------------------
	0x2292 fsto_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstoisivalue0_7_0               ;   	//  7: 0
} FSTO_MON0;

/*-----------------------------------------------------------------------------
	0x2293 fsto_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstoisivalue1_7_0               ;   	//  7: 0
} FSTO_MON1;

/*-----------------------------------------------------------------------------
	0x2294 fsto_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fstoisivalue2_7_0               ;   	//  7: 0
} FSTO_MON2;



/**************************************************************************************/
/**************************************************************************************/
/****************   EQ_CQS Register (0x28000 ~ 0x28ff)   ******************************/
/**************************************************************************************/
/**************************************************************************************/


/*-----------------------------------------------------------------------------
	0x2800 cr_derot_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 6,	//  0: 5 reserved
	errorderot                      : 1,	//     6
	crlock_check                    : 1;	//     7
} CR_DEROT_CTRL0;

/*-----------------------------------------------------------------------------
	0x2804 bmse_snr_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	msethvalue_9_8                  : 2,	//  0: 1
	                                : 1,	//     2 reserved
	msethusermode                   : 1,	//     3
	                                : 2,	//  4: 5 reserved
	msegoodthvalue_1_0              : 2;	//  6: 7
} BMSE_SNR_CTRL0;

/*-----------------------------------------------------------------------------
	0x2805 bmse_snr_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	msethvalue_7_0                  ;   	//  7: 0
} BMSE_SNR_CTRL1;

/*-----------------------------------------------------------------------------
	0x2806 bmse_snr_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th16qbsnrhigh                   : 4,	//  0: 3
	th16qbsnrlow                    : 4;	//  4: 7
} BMSE_SNR_CTRL2;

/*-----------------------------------------------------------------------------
	0x2807 bmse_snr_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th32qbsnrhigh                   : 4,	//  0: 3
	th32qbsnrlow                    : 4;	//  4: 7
} BMSE_SNR_CTRL3;

/*-----------------------------------------------------------------------------
	0x2808 bmse_snr_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th64qbsnrhigh                   : 4,	//  0: 3
	th64qbsnrlow                    : 4;	//  4: 7
} BMSE_SNR_CTRL4;

/*-----------------------------------------------------------------------------
	0x2809 bmse_snr_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th128qbsnrhigh                  : 4,	//  0: 3
	th128qbsnrlow                   : 4;	//  4: 7
} BMSE_SNR_CTRL5;

/*-----------------------------------------------------------------------------
	0x280a bmse_snr_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th256qbsnrhigh                  : 4,	//  0: 3
	th256qbsnrlow                   : 4;	//  4: 7
} BMSE_SNR_CTRL6;

/*-----------------------------------------------------------------------------
	0x280b bmse_snr_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	bconstrainten                   : 1;	//     7
} BMSE_SNR_CTRL7;

/*-----------------------------------------------------------------------------
	0x280c bmse_snr_ctrl[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th16qbconstraint                ;   	//  7: 0
} BMSE_SNR_CTRL8;

/*-----------------------------------------------------------------------------
	0x280d bmse_snr_ctrl[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th32qbconstraint                ;   	//  7: 0
} BMSE_SNR_CTRL9;

/*-----------------------------------------------------------------------------
	0x280e bmse_snr_ctrl[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th64qbconstraint                ;   	//  7: 0
} BMSE_SNR_CTRL10;

/*-----------------------------------------------------------------------------
	0x280f bmse_snr_ctrl[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th128qbconstraint               ;   	//  7: 0
} BMSE_SNR_CTRL11;

/*-----------------------------------------------------------------------------
	0x2810 bmse_snr_ctrl[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th256qbconstraint               ;   	//  7: 0
} BMSE_SNR_CTRL12;

/*-----------------------------------------------------------------------------
	0x2811 bmse_snr_ctrl[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th16qbmseng                     : 4,	//  0: 3
	th16qbmsegs                     : 4;	//  4: 7
} BMSE_SNR_CTRL13;

/*-----------------------------------------------------------------------------
	0x2812 bmse_snr_ctrl[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th32qbmseng1                    : 4,	//  0: 3
	th32qbmsegs1                    : 4;	//  4: 7
} BMSE_SNR_CTRL14;

/*-----------------------------------------------------------------------------
	0x2813 bmse_snr_ctrl[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th32qbmseng2                    : 4,	//  0: 3
	th32qbmsegs2                    : 4;	//  4: 7
} BMSE_SNR_CTRL15;

/*-----------------------------------------------------------------------------
	0x2814 bmse_snr_ctrl[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th64qbmseng                     : 4,	//  0: 3
	th64qbmsegs                     : 4;	//  4: 7
} BMSE_SNR_CTRL16;

/*-----------------------------------------------------------------------------
	0x2815 bmse_snr_ctrl[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th128qbmseng1                   : 4,	//  0: 3
	th128qbmsegs1                   : 4;	//  4: 7
} BMSE_SNR_CTRL17;

/*-----------------------------------------------------------------------------
	0x2816 bmse_snr_ctrl[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th128qbmseng2                   : 4,	//  0: 3
	th128qbmsegs2                   : 4;	//  4: 7
} BMSE_SNR_CTRL18;

/*-----------------------------------------------------------------------------
	0x2817 bmse_snr_ctrl[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th256qbmseng                    : 4,	//  0: 3
	th256qbmsegs                    : 4;	//  4: 7
} BMSE_SNR_CTRL19;

/*-----------------------------------------------------------------------------
	0x2818 bmse_snr_ctrl[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	thbmsengcnt                     ;   	//  7: 0
} BMSE_SNR_CTRL20;

/*-----------------------------------------------------------------------------
	0x281c awgn_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	awgnonen                        : 1;	//     7
} AWGN_CTRL0;

/*-----------------------------------------------------------------------------
	0x281d awgn_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	awgnoffcnf                      : 4,	//  0: 3
	awgnoncnf                       : 4;	//  4: 7
} AWGN_CTRL1;

/*-----------------------------------------------------------------------------
	0x281e awgn_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th16qawgnoff                    : 3,	//  0: 2
	                                : 1,	//     3 reserved
	th16qawgnon                     : 3;	//  4: 6
} AWGN_CTRL2;

/*-----------------------------------------------------------------------------
	0x281f awgn_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th32qawgnoff                    : 3,	//  0: 2
	                                : 1,	//     3 reserved
	th32qawgnon                     : 3;	//  4: 6
} AWGN_CTRL3;

/*-----------------------------------------------------------------------------
	0x2820 awgn_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th64qawgnoff                    : 3,	//  0: 2
	                                : 1,	//     3 reserved
	th64qawgnon                     : 3;	//  4: 6
} AWGN_CTRL4;

/*-----------------------------------------------------------------------------
	0x2821 awgn_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th128qawgnoff                   : 3,	//  0: 2
	                                : 1,	//     3 reserved
	th128qawgnon                    : 3;	//  4: 6
} AWGN_CTRL5;

/*-----------------------------------------------------------------------------
	0x2822 awgn_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th256qawgnoff                   : 3,	//  0: 2
	                                : 1,	//     3 reserved
	th256qawgnon                    : 3;	//  4: 6
} AWGN_CTRL6;

/*-----------------------------------------------------------------------------
	0x2823 awgn_ctrl[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	gstatelongawgn                  : 4,	//  0: 3
	gstateshortawgn                 : 3;	//  4: 6
} AWGN_CTRL7;

/*-----------------------------------------------------------------------------
	0x2826 gs_burst_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	burstdeten                      : 1,	//     4
	bursten                         : 1,	//     5
	mgstart                         : 1,	//     6
	gstephold                       : 1;	//     7
} GS_BURST_CTRL0;

/*-----------------------------------------------------------------------------
	0x2827 gs_burst_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	gstateshorted                   : 3,	//  0: 2
	                                : 1,	//     3 reserved
	gstateshortst                   : 3;	//  4: 6
} GS_BURST_CTRL1;

/*-----------------------------------------------------------------------------
	0x2828 gs_burst_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	gstatelonged                    : 4,	//  0: 3
	gstatelongst1                   : 4;	//  4: 7
} GS_BURST_CTRL2;

/*-----------------------------------------------------------------------------
	0x2829 gs_burst_ctrl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	gstatelongst2                   : 4;	//  4: 7
} GS_BURST_CTRL3;

/*-----------------------------------------------------------------------------
	0x282a gs_burst_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	gstatelongburst                 : 4,	//  0: 3
	gstateshortburst                : 3;	//  4: 6
} GS_BURST_CTRL4;

/*-----------------------------------------------------------------------------
	0x282b gs_burst_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th_burston                      ;   	//  7: 0
} GS_BURST_CTRL5;

/*-----------------------------------------------------------------------------
	0x282c gs_burst_ctrl[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th_burstoff                     ;   	//  7: 0
} GS_BURST_CTRL6;

/*-----------------------------------------------------------------------------
	0x2830 radius_ctrl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	rconstrainten                   : 1;	//     7
} RADIUS_CTRL0;

/*-----------------------------------------------------------------------------
	0x2831 radius_ctrl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th16qrconstraint                ;   	//  7: 0
} RADIUS_CTRL1;

/*-----------------------------------------------------------------------------
	0x2832 radius_ctrl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th32qrconstraint                ;   	//  7: 0
} RADIUS_CTRL2;

/*-----------------------------------------------------------------------------
	0x2833 radius_ctrl[31] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th64qrconstraint                ;   	//  7: 0
} RADIUS_CTRL31;

/*-----------------------------------------------------------------------------
	0x2834 radius_ctrl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th128qrconstraint               ;   	//  7: 0
} RADIUS_CTRL4;

/*-----------------------------------------------------------------------------
	0x2835 radius_ctrl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	th256qrconstraint               ;   	//  7: 0
} RADIUS_CTRL5;

/*-----------------------------------------------------------------------------
	0x2839 eq_ctl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	acqfinalstep                    : 2,	//  0: 1
	acqinitialstep                  : 2,	//  2: 3
	acqerrstep                      : 2,	//  4: 5
	eqdonesel                       : 1,	//     6
	acqon                           : 1;	//     7
} EQ_CTL0;

/*-----------------------------------------------------------------------------
	0x283a eq_ctl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cntacq_23_16                    ;   	//  7: 0
} EQ_CTL1;

/*-----------------------------------------------------------------------------
	0x283b eq_ctl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cntacq_15_8                     ;   	//  7: 0
} EQ_CTL2;

/*-----------------------------------------------------------------------------
	0x283c eq_ctl[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	cntacq_7_0                      ;   	//  7: 0
} EQ_CTL3;

/*-----------------------------------------------------------------------------
	0x283f eq_ctl[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	blindfinalstep                  : 2,	//  0: 1
	blindinitialstep                : 2,	//  2: 3
	                                : 2,	//  4: 5 reserved
	blindstep                       : 2;	//  6: 7
} EQ_CTL4;

/*-----------------------------------------------------------------------------
	0x2840 eq_ctl[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	unlockcntvalue                  : 2,	//  0: 1
	unlockthrvalue                  : 2,	//  2: 3
	eqddsel                         : 2,	//  4: 5
	                                : 1,	//     6 reserved
	trackerrstep                    : 1;	//     7
} EQ_CTL5;

/*-----------------------------------------------------------------------------
	0x2844 ff_fb_flt_ctl[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	eqcrinitcon                     : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	fbferrgainsel                   : 1,	//     4
	ffferrgainsel                   : 1,	//     5
	filtgainsel                     : 1,	//     6
	filtstepauto                    : 1;	//     7
} FF_FB_FLT_CTL0;

/*-----------------------------------------------------------------------------
	0x2845 ff_fb_flt_ctl[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fffcentertap                    : 2,	//  0: 1
	fffstep                         : 2,	//  2: 3
	                                : 2,	//  4: 5 reserved
	fffststepgssw                   : 1,	//     6
	ffffreeze                       : 1;	//     7
} FF_FB_FLT_CTL1;

/*-----------------------------------------------------------------------------
	0x2846 ff_fb_flt_ctl[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	fbfcentertap                    : 2,	//  0: 1
	fbfstep                         : 2,	//  2: 3
	fbfgain                         : 2,	//  4: 5
	                                : 1,	//     6 reserved
	fbffreeze                       : 1;	//     7
} FF_FB_FLT_CTL2;

/*-----------------------------------------------------------------------------
	0x2880 cr_derot_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 6,	//  0: 5 reserved
	crunlock                        : 1,	//     6
	crlock_status                   : 1;	//     7
} CR_DEROT_MON0;

/*-----------------------------------------------------------------------------
	0x2886 awgn_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	awgnon                          : 1;	//     7
} AWGN_MON0;

/*-----------------------------------------------------------------------------
	0x2889 gs_burst_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	eq_gearshift                    : 3,	//  0: 2
	                                : 3,	//  3: 5 reserved
	gsdone                          : 1,	//     6
	gstart                          : 1;	//     7
} GS_BURST_MON0;

/*-----------------------------------------------------------------------------
	0x288a gs_burst_mon[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	burston                         : 1;	//     7
} GS_BURST_MON1;

/*-----------------------------------------------------------------------------
	0x288b gs_burst_mon[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	burstacc                        ;   	//  7: 0
} GS_BURST_MON2;

/*-----------------------------------------------------------------------------
	0x288e radius_mon[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 5,	//  0: 4 reserved
	outofboundary                   : 1,	//     5
	outofradius                     : 1,	//     6
	outofbd_eq                      : 1;	//     7
} RADIUS_MON0;



/**************************************************************************************/
/**************************************************************************************/
/******    FEC Register (0x30000 ~ 0x30ff)  *******************************************/
/**************************************************************************************/
/**************************************************************************************/



/*-----------------------------------------------------------------------------
	0x3000 fec_set[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 5,	//  0: 4 reserved
	rson                            : 1,	//     5
	deranon                         : 1,	//     6
	bytedeinton                     : 1;	//     7
} FEC_SET0;

/*-----------------------------------------------------------------------------
	0x3020 fec_set[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	vion_v                          : 1;	//     7
} FEC_SET1;

/*-----------------------------------------------------------------------------
	0x3025 fec_set[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nemrset                         : 1,	//     0
	                                : 3,	//  1: 3 reserved
	softpos_di_1_0                  : 2,	//  4: 5
	softwidth_di_1_0                : 2;	//  6: 7
} FEC_SET2;

/*-----------------------------------------------------------------------------
	0x3026 fec_set[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	bdon_di                         : 1,	//     4
	tdon_i                          : 1,	//     5
	fdon_i                          : 1,	//     6
	sdon_d                          : 1;	//     7
} FEC_SET3;

/*-----------------------------------------------------------------------------
	0x3027 fec_set[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	layermaskenb_i                  : 1;	//     7
} FEC_SET4;

/*-----------------------------------------------------------------------------
	0x302b fec_set[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	selfsyncfinden_cqs              : 1;	//     7
} FEC_SET5;

/*-----------------------------------------------------------------------------
	0x302c fec_set[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	selfsyncfinddetth_cqs_7_0       ;   	//  7: 0
} FEC_SET6;

/*-----------------------------------------------------------------------------
	0x302d fec_set[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	selfsyncfindccth_cqs_7_0        ;   	//  7: 0
} FEC_SET7;

/*-----------------------------------------------------------------------------
	0x302e fec_set[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	selfsyncfindth_cqs_15_8         : 7;	//  0: 6
} FEC_SET8;

/*-----------------------------------------------------------------------------
	0x302f fec_set[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	selfsyncfindth_cqs_7_0          ;   	//  7: 0
} FEC_SET9;

/*-----------------------------------------------------------------------------
	0x3032 fec_set[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	framelockmode_cqs_1_0           : 2,	//  0: 1
	                                : 4,	//  2: 5 reserved
	teichken_cqs                    : 1,	//     6
	feclkbrk_cqs                    : 1;	//     7
} FEC_SET10;

/*-----------------------------------------------------------------------------
	0x3035 fec_set[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nhedlckcdnenb_cqs               : 1,	//     0
	nhedsyncrstenb_cqs              : 1,	//     1
	nheddetlckcenb_cqs              : 1,	//     2
	nheddetsyncenb_cqs              : 1,	//     3
	                                : 3,	//  4: 6 reserved
	nullpktdeten_cqs                : 1;	//     7
} FEC_SET11;

/*-----------------------------------------------------------------------------
	0x303a fec_set[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vdctrset_cqs_3_0                : 4,	//  0: 3
	                                : 3,	//  4: 6 reserved
	vdbrken_cqs                     : 1;	//     7
} FEC_SET12;

/*-----------------------------------------------------------------------------
	0x303b fec_set[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	ilctrset_cqs_3_0                : 4,	//  0: 3
	frctrset_cqs_3_0                : 4;	//  4: 7
} FEC_SET13;

/*-----------------------------------------------------------------------------
	0x303c fec_set[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vdlckped_cqs_7_0                ;   	//  7: 0
} FEC_SET14;

/*-----------------------------------------------------------------------------
	0x303d fec_set[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vdlckth_cqs_15_8                ;   	//  7: 0
} FEC_SET15;

/*-----------------------------------------------------------------------------
	0x303e fec_set[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vdlckth_cqs_7_0                 ;   	//  7: 0
} FEC_SET16;

/*-----------------------------------------------------------------------------
	0x3041 fec_set[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 4,	//  0: 3 reserved
	bshift_cs_2_0                   : 3,	//  4: 6
	bshiftauto_cs                   : 1;	//     7
} FEC_SET17;

/*-----------------------------------------------------------------------------
	0x3042 fec_set[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	bshiftcc_cs_7_0                 ;   	//  7: 0
} FEC_SET18;

/*-----------------------------------------------------------------------------
	0x3043 fec_set[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	energydisb8mode_cs              : 1;	//     7
} FEC_SET19;

/*-----------------------------------------------------------------------------
	0x3093 fec_chk[0] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	tpcorrecta_i                    : 1;	//     7
} FEC_CHK0;

/*-----------------------------------------------------------------------------
	0x3094 fec_chk[1] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vbbera_i_15_8                   ;   	//  7: 0
} FEC_CHK1;

/*-----------------------------------------------------------------------------
	0x3095 fec_chk[2] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vbbera_i_7_0                    ;   	//  7: 0
} FEC_CHK2;

/*-----------------------------------------------------------------------------
	0x3096 fec_chk[3] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vabera_i_15_8                   ;   	//  7: 0
} FEC_CHK3;

/*-----------------------------------------------------------------------------
	0x3097 fec_chk[4] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vabera_i_7_0                    ;   	//  7: 0
} FEC_CHK4;

/*-----------------------------------------------------------------------------
	0x3098 fec_chk[5] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tperrcnta_i                     ;   	//  7: 0
} FEC_CHK5;

/*-----------------------------------------------------------------------------
	0x3099 fec_chk[6] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	tpcorrectb_i                    : 1;	//     7
} FEC_CHK6;

/*-----------------------------------------------------------------------------
	0x309a fec_chk[7] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vbberb_i_15_8                   ;   	//  7: 0
} FEC_CHK7;

/*-----------------------------------------------------------------------------
	0x309b fec_chk[8] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vbberb_i_7_0                    ;   	//  7: 0
} FEC_CHK8;

/*-----------------------------------------------------------------------------
	0x309c fec_chk[9] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vaberb_i_15_8                   ;   	//  7: 0
} FEC_CHK9;

/*-----------------------------------------------------------------------------
	0x309d fec_chk[10] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vaberb_i_7_0                    ;   	//  7: 0
} FEC_CHK10;

/*-----------------------------------------------------------------------------
	0x309e fec_chk[11] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tperrcntb_i_7_0                 ;   	//  7: 0
} FEC_CHK11;

/*-----------------------------------------------------------------------------
	0x309f fec_chk[12] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 7,	//  0: 6 reserved
	tpcorrectc_i                    : 1;	//     7
} FEC_CHK12;

/*-----------------------------------------------------------------------------
	0x30a0 fec_chk[13] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vbberc_i_15_8                   ;   	//  7: 0
} FEC_CHK13;

/*-----------------------------------------------------------------------------
	0x30a1 fec_chk[14] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vbberc_i_7_0                    ;   	//  7: 0
} FEC_CHK14;

/*-----------------------------------------------------------------------------
	0x30a2 fec_chk[15] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vaberc_i_15_8                   ;   	//  7: 0
} FEC_CHK15;

/*-----------------------------------------------------------------------------
	0x30a3 fec_chk[16] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	vaberc_i_7_0                    ;   	//  7: 0
} FEC_CHK16;

/*-----------------------------------------------------------------------------
	0x30a4 fec_chk[17] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	tperrcntc_i_7_0                 ;   	//  7: 0
} FEC_CHK17;

/*-----------------------------------------------------------------------------
	0x30a9 fec_chk[18] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	interleavemode_q_3_0            : 4,	//  0: 3
	                                : 3,	//  4: 6 reserved
	vdlock_q                        : 1;	//     7
} FEC_CHK18;

/*-----------------------------------------------------------------------------
	0x30aa fec_chk[19] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	                                : 2,	//  0: 1 reserved
	tpsrcerr_cqsv                   : 1,	//     2
	abnormtx_cqs                    : 1,	//     3
	                                : 3,	//  4: 6 reserved
	mpeglock_cqs                    : 1;	//     7
} FEC_CHK19;

/*-----------------------------------------------------------------------------
	0x30ab fec_chk[20] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nullout_cqs_15_8                ;   	//  7: 0
} FEC_CHK20;

/*-----------------------------------------------------------------------------
	0x30ac fec_chk[21] ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT8
	nullout_cqs_7_0                 ;   	//  7: 0
} FEC_CHK21;


/**************************************************************************************/
/**************************************************************************************/
/**************************************************************************************/

typedef struct {
	COMMON_CTRL0                    	common_ctrl0                    ;	// 0x0000 : ''
	COMMON_CTRL1                    	common_ctrl1                    ;	// 0x0001 : ''
	COMMON_CTRL2                    	common_ctrl2                    ;	// 0x0002 : ''
	COMMON_CTRL3                    	common_ctrl3                    ;	// 0x0003 : ''
	COMMON_CTRL4                    	common_ctrl4                    ;	// 0x0004 : ''
	COMMON_CTRL5                    	common_ctrl5                    ;	// 0x0005 : ''
	COMMON_CTRL6                    	common_ctrl6                    ;	// 0x0006 : ''
	UINT8                           	                 __rsvd_00[   1];	// 0x0007
	COMMON_CTRL7                    	common_ctrl7                    ;	// 0x0008 : ''
	COMMON_CTRL8                    	common_ctrl8                    ;	// 0x0009 : ''
	COMMON_CTRL9                    	common_ctrl9                    ;	// 0x000a : ''
	COMMON_CTRL10                   	common_ctrl10                   ;	// 0x000b : ''
	UINT8                           	                 __rsvd_01[   1];	// 0x000c
	COMMON_CTRL11                   	common_ctrl11                   ;	// 0x000d : ''
	COMMON_CTRL12                   	common_ctrl12                   ;	// 0x000e : ''
	COMMON_CTRL13                   	common_ctrl13                   ;	// 0x000f : ''
	COMMON_CTRL14                   	common_ctrl14                   ;	// 0x0010 : ''
	COMMON_CTRL15                   	common_ctrl15                   ;	// 0x0011 : ''
	AGC_CTRL0                       	agc_ctrl0                       ;	// 0x0012 : ''
	AGC_CTRL1                       	agc_ctrl1                       ;	// 0x0013 : ''
	AGC_CTRL2                       	agc_ctrl2                       ;	// 0x0014 : ''
	AGC_CTRL3                       	agc_ctrl3                       ;	// 0x0015 : ''
	AGC_CTRL4                       	agc_ctrl4                       ;	// 0x0016 : ''
	AGC_CTRL5                       	agc_ctrl5                       ;	// 0x0017 : ''
	AGC_CTRL6                       	agc_ctrl6                       ;	// 0x0018 : ''
	AGC_CTRL7                       	agc_ctrl7                       ;	// 0x0019 : ''
	UINT8                           	                 __rsvd_02[   2];	// 0x001a ~ 0x001b
	MDP_CTRL0                       	mdp_ctrl0                       ;	// 0x001c : ''
	MDP_CTRL1                       	mdp_ctrl1                       ;	// 0x001d : ''
	MDP_CTRL2                       	mdp_ctrl2                       ;	// 0x001e : ''
	MDP_CTRL3                       	mdp_ctrl3                       ;	// 0x001f : ''
	MDP_CTRL4                       	mdp_ctrl4                       ;	// 0x0020 : ''
	MDP_CTRL5                       	mdp_ctrl5                       ;	// 0x0021 : ''
	MDP_CTRL6                       	mdp_ctrl6                       ;	// 0x0022 : ''
	MDP_CTRL7                       	mdp_ctrl7                       ;	// 0x0023 : ''
	MDP_CTRL8                       	mdp_ctrl8                       ;	// 0x0024 : ''
	MDP_CTRL9                       	mdp_ctrl9                       ;	// 0x0025 : ''
	MDP_CTRL10                      	mdp_ctrl10                      ;	// 0x0026 : ''
	MDP_CTRL11                      	mdp_ctrl11                      ;	// 0x0027 : ''
	MDP_CTRL12                      	mdp_ctrl12                      ;	// 0x0028 : ''
	MDP_CTRL13                      	mdp_ctrl13                      ;	// 0x0029 : ''
	MDP_CTRL14                      	mdp_ctrl14                      ;	// 0x002a : ''
	MDP_CTRL15                      	mdp_ctrl15                      ;	// 0x002b : ''
	MDP_CTRL16                      	mdp_ctrl16                      ;	// 0x002c : ''
	MDP_CTRL17                      	mdp_ctrl17                      ;	// 0x002d : ''
	MDP_CTRL18                      	mdp_ctrl18                      ;	// 0x002e : ''
	MDP_CTRL19                      	mdp_ctrl19                      ;	// 0x002f : ''
	MDP_CTRL20                      	mdp_ctrl20                      ;	// 0x0030 : ''
	UINT8                           	                 __rsvd_03[   1];	// 0x0031
	MDP_CTRL21                      	mdp_ctrl21                      ;	// 0x0032 : ''
	MDP_CTRL22                      	mdp_ctrl22                      ;	// 0x0033 : ''
	MDP_CTRL23                      	mdp_ctrl23                      ;	// 0x0034 : ''
	MDP_CTRL24                      	mdp_ctrl24                      ;	// 0x0035 : ''
	MDP_CTRL25                      	mdp_ctrl25                      ;	// 0x0036 : ''
	MDP_CTRL26                      	mdp_ctrl26                      ;	// 0x0037 : ''
	MDP_CTRL27                      	mdp_ctrl27                      ;	// 0x0038 : ''
	MDP_CTRL28                      	mdp_ctrl28                      ;	// 0x0039 : ''
	GPO_CTRL0                       	gpo_ctrl0                       ;	// 0x003a : ''
	UINT8                           	                 __rsvd_04[   2];	// 0x003b ~ 0x003c
	SAMPLING_CTRL0                  	sampling_ctrl0                  ;	// 0x003d : ''
	UINT8                           	                 __rsvd_05[   6];	// 0x003e ~ 0x0043
	CARRIER_CTRL0                   	carrier_ctrl0                   ;	// 0x0044 : ''
	UINT8                           	                 __rsvd_06[  11];	// 0x0045 ~ 0x004f
	EQ_CTRL0                        	eq_ctrl0                        ;	// 0x0050 : ''
	UINT8                           	                 __rsvd_07[   2];	// 0x0051 ~ 0x0052
	EQ_CTRL1                        	eq_ctrl1                        ;	// 0x0053 : ''
	EQ_CTRL2                        	eq_ctrl2                        ;	// 0x0054 : ''
	UINT8                           	                 __rsvd_08[   2];	// 0x0055 ~ 0x0056
	EQ_CTRL3                        	eq_ctrl3                        ;	// 0x0057 : ''
	EQ_CTRL4                        	eq_ctrl4                        ;	// 0x0058 : ''
	EQ_CTRL5                        	eq_ctrl5                        ;	// 0x0059 : ''
	EQ_CTRL6                        	eq_ctrl6                        ;	// 0x005a : ''
	EQ_CTRL7                        	eq_ctrl7                        ;	// 0x005b : ''
	EQ_CTRL8                        	eq_ctrl8                        ;	// 0x005c : ''
	UINT8                           	                 __rsvd_09[   2];	// 0x005d ~ 0x005e
	EQ_CTRL9                        	eq_ctrl9                        ;	// 0x005f : ''
	EQ_CTRL10                       	eq_ctrl10                       ;	// 0x0060 : ''
	EQ_CTRL11                       	eq_ctrl11                       ;	// 0x0061 : ''
	EQ_CTRL12                       	eq_ctrl12                       ;	// 0x0062 : ''
	EQ_CTRL13                       	eq_ctrl13                       ;	// 0x0063 : ''
	EQ_CTRL14                       	eq_ctrl14                       ;	// 0x0064 : ''
	EQ_CTRL15                       	eq_ctrl15                       ;	// 0x0065 : ''
	EQ_CTRL16                       	eq_ctrl16                       ;	// 0x0066 : ''
	UINT8                           	                 __rsvd_10[   9];	// 0x0067 ~ 0x006f
	TP_CTRL0                        	tp_ctrl0                        ;	// 0x0070 : ''
	TP_CTRL1                        	tp_ctrl1                        ;	// 0x0071 : ''
	TP_CTRL2                        	tp_ctrl2                        ;	// 0x0072 : ''
	FEC_CTRL0                       	fec_ctrl0                       ;	// 0x0073 : ''
	UINT8                           	                 __rsvd_11[   1];	// 0x0074
	FEC_CTRL1                       	fec_ctrl1                       ;	// 0x0075 : ''
	FEC_CTRL2                       	fec_ctrl2                       ;	// 0x0076 : ''
	FEC_CTRL3                       	fec_ctrl3                       ;	// 0x0077 : ''
	FEC_CTRL4                       	fec_ctrl4                       ;	// 0x0078 : ''
	FEC_CTRL5                       	fec_ctrl5                       ;	// 0x0079 : ''
	FEC_CTRL6                       	fec_ctrl6                       ;	// 0x007a : ''
	FEC_CTRL7                       	fec_ctrl7                       ;	// 0x007b : ''
	FEC_CTRL8                       	fec_ctrl8                       ;	// 0x007c : ''
	FEC_CTRL9                       	fec_ctrl9                       ;	// 0x007d : ''
	FEC_CTRL10                      	fec_ctrl10                      ;	// 0x007e : ''
	FEC_CTRL11                      	fec_ctrl11                      ;	// 0x007f : ''
	COMMON_MON0                     	common_mon0                     ;	// 0x0080 : ''
	STDOPMODE_MON0                  	stdopmode_mon0                  ;	// 0x0081 : ''
	COMMON_MON1                     	common_mon1                     ;	// 0x0082 : ''
	COMMON_MON2                     	common_mon2                     ;	// 0x0083 : ''
	COMMON_MON3                     	common_mon3                     ;	// 0x0084 : ''
	COMMON_MON4                     	common_mon4                     ;	// 0x0085 : ''
	COMMON_MON5                     	common_mon5                     ;	// 0x0086 : ''
	COMMON_MON6                     	common_mon6                     ;	// 0x0087 : ''
	COMMON_MON7                     	common_mon7                     ;	// 0x0088 : ''
	COMMON_MON8                     	common_mon8                     ;	// 0x0089 : ''
	COMMON_MON9                     	common_mon9                     ;	// 0x008a : ''
	COMMON_MON10                    	common_mon10                    ;	// 0x008b : ''
	COMMON_MON11                    	common_mon11                    ;	// 0x008c : ''
	COMMON_MON12                    	common_mon12                    ;	// 0x008d : ''
	SYNC_MON0                       	sync_mon0                       ;	// 0x008e : ''
	SYNC_MON1                       	sync_mon1                       ;	// 0x008f : ''
	SYNC_MON2                       	sync_mon2                       ;	// 0x0090 : ''
	SYNC_MON3                       	sync_mon3                       ;	// 0x0091 : ''
	SYNC_MON4                       	sync_mon4                       ;	// 0x0092 : ''
	SYNC_MON5                       	sync_mon5                       ;	// 0x0093 : ''
	SYNC_MON6                       	sync_mon6                       ;	// 0x0094 : ''
	SYNC_MON7                       	sync_mon7                       ;	// 0x0095 : ''
	SYNC_MON8                       	sync_mon8                       ;	// 0x0096 : ''
	SYNC_MON9                       	sync_mon9                       ;	// 0x0097 : ''
	SYNC_MON10                      	sync_mon10                      ;	// 0x0098 : ''
	SYNC_MON11                      	sync_mon11                      ;	// 0x0099 : ''
	SYNC_MON12                      	sync_mon12                      ;	// 0x009a : ''
	SYNC_MON13                      	sync_mon13                      ;	// 0x009b : ''
	SYNC_MON14                      	sync_mon14                      ;	// 0x009c : ''
	SYNC_MON15                      	sync_mon15                      ;	// 0x009d : ''
	SYNC_MON16                      	sync_mon16                      ;	// 0x009e : ''
	SYNC_MON17                      	sync_mon17                      ;	// 0x009f : ''
	SYNC_MON18                      	sync_mon18                      ;	// 0x00a0 : ''
	SYNC_MON19                      	sync_mon19                      ;	// 0x00a1 : ''
	SYNC_MON20                      	sync_mon20                      ;	// 0x00a2 : ''
	SYNC_MON21                      	sync_mon21                      ;	// 0x00a3 : ''
	UINT8                           	                 __rsvd_12[   2];	// 0x00a4 ~ 0x00a5
	SYNC_MON22                   		sync_mon22                   ;	// 0x00a6 : ''
	UINT8                           	                 __rsvd_13[   3];	// 0x00a7 ~ 0x00a9
	DIEQ_MON0                       	dieq_mon0                       ;	// 0x00aa : ''
	DIEQ_MON1                       	dieq_mon1                       ;	// 0x00ab : ''
	UINT8                           	                 __rsvd_14[   1];	// 0x00ac
	DEQ_MON0                        	deq_mon0                        ;	// 0x00ad : ''
	DEQ_MON1                        	deq_mon1                        ;	// 0x00ae : ''
	DEQ_MON2                        	deq_mon2                        ;	// 0x00af : ''
	DEQ_MON3                        	deq_mon3                        ;	// 0x00b0 : ''
	DEQ_MON4                        	deq_mon4                        ;	// 0x00b1 : ''
	DEQ_MON5                        	deq_mon5                        ;	// 0x00b2 : ''
	UINT8                           	                 __rsvd_15[   2];	// 0x00b3 ~ 0x00b4
	IEQ_MON0                        	ieq_mon0                        ;	// 0x00b5 : ''
	IEQ_MON1                        	ieq_mon1                        ;	// 0x00b6 : ''
	IEQ_MON2                        	ieq_mon2                        ;	// 0x00b7 : ''
	IEQ_MON3                        	ieq_mon3                        ;	// 0x00b8 : ''
	IEQ_MON4                        	ieq_mon4                        ;	// 0x00b9 : ''
	IEQ_MON5                        	ieq_mon5                        ;	// 0x00ba : ''
	IEQ_MON6                        	ieq_mon6                        ;	// 0x00bb : ''
	IEQ_MON7                        	ieq_mon7                        ;	// 0x00bc : ''
	IEQ_MON8                        	ieq_mon8                        ;	// 0x00bd : ''
	UINT8                           	                 __rsvd_16[   8];	// 0x00be ~ 0x00c5
	CIR_MON0                        	cir_mon0                        ;	// 0x00c6 : ''
	CIR_MON1                        	cir_mon1                        ;	// 0x00c7 : ''
	CIR_MON2                        	cir_mon2                        ;	// 0x00c8 : ''
	CIR_MON3                        	cir_mon3                        ;	// 0x00c9 : ''
	CIR_MON4                        	cir_mon4                        ;	// 0x00ca : ''
	CIR_MON5                        	cir_mon5                        ;	// 0x00cb : ''
	CIR_MON6                        	cir_mon6                        ;	// 0x00cc : ''
	CIR_MON7                        	cir_mon7                        ;	// 0x00cd : ''
	CIR_MON8                        	cir_mon8                        ;	// 0x00ce : ''
	CIR_MON9                        	cir_mon9                        ;	// 0x00cf : ''
	CIR_MON10                       	cir_mon10                       ;	// 0x00d0 : ''
	CIR_MON11                       	cir_mon11                       ;	// 0x00d1 : ''
	CIR_MON12                       	cir_mon12                       ;	// 0x00d2 : ''
	CIR_MON13                       	cir_mon13                       ;	// 0x00d3 : ''
	CIR_MON14                       	cir_mon14                       ;	// 0x00d4 : ''
	CIR_MON15                       	cir_mon15                       ;	// 0x00d5 : ''
	CIR_MON16                       	cir_mon16                       ;	// 0x00d6 : ''
	CIR_MON17                       	cir_mon17                       ;	// 0x00d7 : ''
	CIR_MON18                       	cir_mon18                       ;	// 0x00d8 : ''
	CIR_MON19                       	cir_mon19                       ;	// 0x00d9 : ''
	CIR_MON20                       	cir_mon20                       ;	// 0x00da : ''
	CIR_MON21                       	cir_mon21                       ;	// 0x00db : ''
	CIR_MON22                       	cir_mon22                       ;	// 0x00dc : ''
	CIR_MON23                       	cir_mon23                       ;	// 0x00dd : ''
	CIR_MON24                       	cir_mon24                       ;	// 0x00de : ''
	CIR_MON25                       	cir_mon25                       ;	// 0x00df : ''
	CIR_MON26                       	cir_mon26                       ;	// 0x00e0 : ''
	CIR_MON27                       	cir_mon27                       ;	// 0x00e1 : ''
	CIR_MON28                       	cir_mon28                       ;	// 0x00e2 : ''
	CIR_MON29                       	cir_mon29                       ;	// 0x00e3 : ''
	CIR_MON30                       	cir_mon30                       ;	// 0x00e4 : ''
	CIR_MON31                       	cir_mon31                       ;	// 0x00e5 : ''
	CIR_MON32                       	cir_mon32                       ;	// 0x00e6 : ''
	CIR_MON33                       	cir_mon33                       ;	// 0x00e7 : ''
	EQCOMMON_MON0                   	eqcommon_mon0                   ;	// 0x00e8 : ''
	EQCOMMON_MON1                   	eqcommon_mon1                   ;	// 0x00e9 : ''
	EQCOMMON_MON2                   	eqcommon_mon2                   ;	// 0x00ea : ''
	EQCOMMON_MON3                   	eqcommon_mon3                   ;	// 0x00eb : ''
	EQCOMMON_MON4                   	eqcommon_mon4                   ;	// 0x00ec : ''
	EQCOMMON_MON5                   	eqcommon_mon5                   ;	// 0x00ed : ''
	EQCOMMON_MON6                   	eqcommon_mon6                   ;	// 0x00ee : ''
	EQCOMMON_MON7                   	eqcommon_mon7                   ;	// 0x00ef : ''
	TP_MON0                         	tp_mon0                         ;	// 0x00f0 : ''
	TP_MON1                         	tp_mon1                         ;	// 0x00f1 : ''
	TP_MON2                         	tp_mon2                         ;	// 0x00f2 : ''
	TP_MON3                         	tp_mon3                         ;	// 0x00f3 : ''
	UINT8                           	                 __rsvd_17[   1];	// 0x00f4
	FEC_MON0                        	fec_mon0                        ;	// 0x00f5 : ''
	FEC_MON1                        	fec_mon1                        ;	// 0x00f6 : ''
	FEC_MON2                        	fec_mon2                        ;	// 0x00f7 : ''
	FEC_MON3                        	fec_mon3                        ;	// 0x00f8 : ''
	FEC_MON4                        	fec_mon4                        ;	// 0x00f9 : ''
	FEC_MON5                        	fec_mon5                        ;	// 0x00fa : ''
	FEC_MON6                        	fec_mon6                        ;	// 0x00fb : ''
	FEC_MON7                        	fec_mon7                        ;	// 0x00fc : ''
	FEC_MON8                        	fec_mon8                        ;	// 0x00fd : ''
	FEC_MON9                        	fec_mon9                        ;	// 0x00fe : ''
	FEC_MON10                       	fec_mon10                       ;	// 0x00ff : ''
} LX_DEMOD_COMMON_REG_T;
/* 199 regs, 199 types */


typedef struct {
	DAFT_CTRL0                      	daft_ctrl0                      ;	// 0x1000 : ''
	DAFT_CTRL1                      	daft_ctrl1                      ;	// 0x1001 : ''
	DAFT_CTRL2                      	daft_ctrl2                      ;	// 0x1002 : ''
	DAFT_CTRL3                      	daft_ctrl3                      ;	// 0x1003 : ''
	DAFT_CTRL4                      	daft_ctrl4                      ;	// 0x1004 : ''
	DAFT_CTRL5                      	daft_ctrl5                      ;	// 0x1005 : ''
	DAFT_CTRL6                      	daft_ctrl6                      ;	// 0x1006 : ''
	DAFT_CTRL7                      	daft_ctrl7                      ;	// 0x1007 : ''
	DAFT_CTRL8                      	daft_ctrl8                      ;	// 0x1008 : ''
	DAFT_CTRL9                      	daft_ctrl9                      ;	// 0x1009 : ''
	DAFT_CTRL10                     	daft_ctrl10                     ;	// 0x100a : ''
	DAFT_CTRL11                     	daft_ctrl11                     ;	// 0x100b : ''
	DAFT_CTRL12                     	daft_ctrl12                     ;	// 0x100c : ''
	DAFT_CTRL13                     	daft_ctrl13                     ;	// 0x100d : ''
	UINT8                           	                 __rsvd_00[   2];	// 0x100e ~ 0x100f
	SRD_CTRL0                       	srd_ctrl0                       ;	// 0x1010 : ''
	SRD_CTRL1                       	srd_ctrl1                       ;	// 0x1011 : ''
	SRD_CTRL2                       	srd_ctrl2                       ;	// 0x1012 : ''
	SRD_CTRL3                       	srd_ctrl3                       ;	// 0x1013 : ''
	SRD_CTRL4                       	srd_ctrl4                       ;	// 0x1014 : ''
	SRD_CTRL5                       	srd_ctrl5                       ;	// 0x1015 : ''
	SRD_CTRL6                       	srd_ctrl6                       ;	// 0x1016 : ''
	SRD_CTRL7                       	srd_ctrl7                       ;	// 0x1017 : ''
	SRD_CTRL8                       	srd_ctrl8                       ;	// 0x1018 : ''
	SRD_CTRL9                       	srd_ctrl9                       ;	// 0x1019 : ''
	UINT8                           	                 __rsvd_01[   2];	// 0x101a ~ 0x101b
	QMD_CTRL0                       	qmd_ctrl0                       ;	// 0x101c : ''
	QMD_CTRL1                       	qmd_ctrl1                       ;	// 0x101d : ''
	QMD_CTRL2                       	qmd_ctrl2                       ;	// 0x101e : ''
	QMD_CTRL3                       	qmd_ctrl3                       ;	// 0x101f : ''
	QMD_CTRL4                       	qmd_ctrl4                       ;	// 0x1020 : ''
	UINT8                           	                 __rsvd_02[   3];	// 0x1021 ~ 0x1023
	V_TOP_CTRL0                     	v_top_ctrl0                     ;	// 0x1024 : ''
	V_TOP_CTRL1                     	v_top_ctrl1                     ;	// 0x1025 : ''
	V_TOP_CTRL2                     	v_top_ctrl2                     ;	// 0x1026 : ''
	V_TOP_CTRL3                     	v_top_ctrl3                     ;	// 0x1027 : ''
	V_TOP_CTRL4                     	v_top_ctrl4                     ;	// 0x1028 : ''
	V_TOP_CTRL5                     	v_top_ctrl5                     ;	// 0x1029 : ''
	V_TOP_CTRL6                     	v_top_ctrl6                     ;	// 0x102a : ''
	UINT8                           	                 __rsvd_03[   5];	// 0x102b ~ 0x102f
	SAMPLING_CTRL_COM0              	sampling_ctrl_com0              ;	// 0x1030 : ''
	SAMPLING_CTRL_COM1              	sampling_ctrl_com1              ;	// 0x1031 : ''
	SAMPLING_CTRL_DI0               	sampling_ctrl_di0               ;	// 0x1032 : ''
	SAMPLING_CTRL_DI1               	sampling_ctrl_di1               ;	// 0x1033 : ''
	SAMPLING_CTRL_DI2               	sampling_ctrl_di2               ;	// 0x1034 : ''
	SAMPLING_CTRL_DI3               	sampling_ctrl_di3               ;	// 0x1035 : ''
	SAMPLING_CTRL_DI4               	sampling_ctrl_di4               ;	// 0x1036 : ''
	SAMPLING_CTRL_DI5               	sampling_ctrl_di5               ;	// 0x1037 : ''
	SAMPLING_CTRL_DI6               	sampling_ctrl_di6               ;	// 0x1038 : ''
	UINT8                           	                 __rsvd_04[   2];	// 0x1039 ~ 0x103a
	SAMPLING_CTRL_CQS0              	sampling_ctrl_cqs0              ;	// 0x103b : ''
	SAMPLING_CTRL_CQS1              	sampling_ctrl_cqs1              ;	// 0x103c : ''
	SAMPLING_CTRL_CQS2              	sampling_ctrl_cqs2              ;	// 0x103d : ''
	SAMPLING_CTRL_CQS3              	sampling_ctrl_cqs3              ;	// 0x103e : ''
	SAMPLING_CTRL_CQS4              	sampling_ctrl_cqs4              ;	// 0x103f : ''
	SAMPLING_CTRL_CQS5              	sampling_ctrl_cqs5              ;	// 0x1040 : ''
	SAMPLING_CTRL_CQS6              	sampling_ctrl_cqs6              ;	// 0x1041 : ''
	SAMPLING_CTRL_CQS7              	sampling_ctrl_cqs7              ;	// 0x1042 : ''
	SAMPLING_CTRL_CQS8              	sampling_ctrl_cqs8              ;	// 0x1043 : ''
	SAMPLING_CTRL_CQS9              	sampling_ctrl_cqs9              ;	// 0x1044 : ''
	UINT8                           	                 __rsvd_05[   2];	// 0x1045 ~ 0x1046
	SAMPLING_CTRL_V0                	sampling_ctrl_v0                ;	// 0x1047 : ''
	SAMPLING_CTRL_V1                	sampling_ctrl_v1                ;	// 0x1048 : ''
	SAMPLING_CTRL_V2                	sampling_ctrl_v2                ;	// 0x1049 : ''
	SAMPLING_CTRL_V3                	sampling_ctrl_v3                ;	// 0x104a : ''
	SAMPLING_CTRL_V4                	sampling_ctrl_v4                ;	// 0x104b : ''
	SAMPLING_CTRL_V5                	sampling_ctrl_v5                ;	// 0x104c : ''
	SAMPLING_CTRL_V6                	sampling_ctrl_v6                ;	// 0x104d : ''
	UINT8                           	                 __rsvd_06[   2];	// 0x104e ~ 0x104f
	CARRIER_CTRL_COM0               	carrier_ctrl_com0               ;	// 0x1050 : ''
	UINT8                           	                 __rsvd_07[   1];	// 0x1051
	CARRIER_CTRL_DI0                	carrier_ctrl_di0                ;	// 0x1052 : ''
	CARRIER_CTRL_DI1                	carrier_ctrl_di1                ;	// 0x1053 : ''
	CARRIER_CTRL_DI2                	carrier_ctrl_di2                ;	// 0x1054 : ''
	CARRIER_CTRL_DI3                	carrier_ctrl_di3                ;	// 0x1055 : ''
	CARRIER_CTRL_DI4                	carrier_ctrl_di4                ;	// 0x1056 : ''
	CARRIER_CTRL_DI5                	carrier_ctrl_di5                ;	// 0x1057 : ''
	CARRIER_CTRL_DI6                	carrier_ctrl_di6                ;	// 0x1058 : ''
	CARRIER_CTRL_DI7                	carrier_ctrl_di7                ;	// 0x1059 : ''
	CARRIER_CTRL_DI8                	carrier_ctrl_di8                ;	// 0x105a : ''
	CARRIER_CTRL_DI9                	carrier_ctrl_di9                ;	// 0x105b : ''
	CARRIER_CTRL_DI10               	carrier_ctrl_di10               ;	// 0x105c : ''
	CARRIER_CTRL_CQS0               	carrier_ctrl_cqs0               ;	// 0x105d : ''
	CARRIER_CTRL_CQS1               	carrier_ctrl_cqs1               ;	// 0x105e : ''
	CARRIER_CTRL_CQS2               	carrier_ctrl_cqs2               ;	// 0x105f : ''
	CARRIER_CTRL_CQS3               	carrier_ctrl_cqs3               ;	// 0x1060 : ''
	CARRIER_CTRL_V0                 	carrier_ctrl_v0                 ;	// 0x1061 : ''
	CARRIER_CTRL_V1                 	carrier_ctrl_v1                 ;	// 0x1062 : ''
	CARRIER_CTRL_V2                 	carrier_ctrl_v2                 ;	// 0x1063 : ''
	CARRIER_CTRL_V3                 	carrier_ctrl_v3                 ;	// 0x1064 : ''
	CARRIER_CTRL_V4                 	carrier_ctrl_v4                 ;	// 0x1065 : ''
	CARRIER_CTRL_V5                 	carrier_ctrl_v5                 ;	// 0x1066 : ''
	CARRIER_CTRL_V6                 	carrier_ctrl_v6                 ;	// 0x1067 : ''
	CARRIER_CTRL_V7                 	carrier_ctrl_v7                 ;	// 0x1068 : ''
	CARRIER_CTRL_V8                 	carrier_ctrl_v8                 ;	// 0x1069 : ''
	CARRIER_CTRL_V9                 	carrier_ctrl_v9                 ;	// 0x106a : ''
	CARRIER_CTRL_V10                	carrier_ctrl_v10                ;	// 0x106b : ''
	CARRIER_CTRL_V11                	carrier_ctrl_v11                ;	// 0x106c : ''
	CARRIER_CTRL_V12                	carrier_ctrl_v12                ;	// 0x106d : ''
	CARRIER_CTRL_V13                	carrier_ctrl_v13                ;	// 0x106e : ''
	CARRIER_CTRL_V14                	carrier_ctrl_v14                ;	// 0x106f : ''
	CARRIER_CTRL_V15                	carrier_ctrl_v15                ;	// 0x1070 : ''
	CARRIER_CTRL_V16                	carrier_ctrl_v16                ;	// 0x1071 : ''
	CARRIER_CTRL_V17                	carrier_ctrl_v17                ;	// 0x1072 : ''
	CARRIER_CTRL_V18                	carrier_ctrl_v18                ;	// 0x1073 : ''
	CARRIER_CTRL_V19                	carrier_ctrl_v19                ;	// 0x1074 : ''
	CARRIER_CTRL_V20                	carrier_ctrl_v20                ;	// 0x1075 : ''
	CARRIER_CTRL_V21                	carrier_ctrl_v21                ;	// 0x1076 : ''
	CARRIER_CTRL_V22                	carrier_ctrl_v22                ;	// 0x1077 : ''
	CARRIER_CTRL_V23                	carrier_ctrl_v23                ;	// 0x1078 : ''
	CARRIER_CTRL_V24                	carrier_ctrl_v24                ;	// 0x1079 : ''
	CARRIER_CTRL_V25                	carrier_ctrl_v25                ;	// 0x107a : ''
	CARRIER_CTRL_V26                	carrier_ctrl_v26                ;	// 0x107b : ''
	CARRIER_CTRL_V27                	carrier_ctrl_v27                ;	// 0x107c : ''
	CARRIER_CTRL_V28                	carrier_ctrl_v28                ;	// 0x107d : ''
	CARRIER_CTRL_V29                	carrier_ctrl_v29                ;	// 0x107e : ''
	CARRIER_CTRL_V30                	carrier_ctrl_v30                ;	// 0x107f : ''
	SYS_MON0                        	sys_mon0                        ;	// 0x1080 : ''
	SYS_MON1                        	sys_mon1                        ;	// 0x1081 : ''
	UINT8                           	                 __rsvd_08[  18];	// 0x1082 ~ 0x1093
	SAMPLING_MON0                   	sampling_mon0                   ;	// 0x1094 : ''
	SAMPLING_MON1                   	sampling_mon1                   ;	// 0x1095 : ''
	UINT8                           	                 __rsvd_09[   1];	// 0x1096
	SAMPLING_MON2                   	sampling_mon2                   ;	// 0x1097 : ''
	UINT8                           	                 __rsvd_10[  11];	// 0x1098 ~ 0x10a2
	CARRIER_MON0                    	carrier_mon0                    ;	// 0x10a3 : ''
	CARRIER_MON1                    	carrier_mon1                    ;	// 0x10a4 : ''
	CARRIER_MON2                    	carrier_mon2                    ;	// 0x10a5 : ''
	UINT8                           	                 __rsvd_11[  10];	// 0x10a6 ~ 0x10af
	CARRIER_MON3                    	carrier_mon3                    ;	// 0x10b0 : ''
	CARRIER_MON4                    	carrier_mon4                    ;	// 0x10b1 : ''
	CARRIER_MON5                    	carrier_mon5                    ;	// 0x10b2 : ''
	CARRIER_MON6                    	carrier_mon6                    ;	// 0x10b3 : ''
	CARRIER_MON7                    	carrier_mon7                    ;	// 0x10b4 : ''
	CARRIER_MON8                    	carrier_mon8                    ;	// 0x10b5 : ''
	CARRIER_MON9                    	carrier_mon9                    ;	// 0x10b6 : ''
	UINT8                           	                 __rsvd_12[   9];	// 0x10b7 ~ 0x10bf
	CARRIER_MON10                   	carrier_mon10                   ;	// 0x10c0 : ''
} LX_DEMOD_SYNC_REG_T;
/* 125 regs, 125 types */


typedef struct {
	CIR0                            	cir0                            ;	// 0x2100 : ''
	CIR1                            	cir1                            ;	// 0x2101 : ''
	CIR2                            	cir2                            ;	// 0x2102 : ''
	CIR3                            	cir3                            ;	// 0x2103 : ''
	CIR4                            	cir4                            ;	// 0x2104 : ''
	CIR5                            	cir5                            ;	// 0x2105 : ''
	CIR6                            	cir6                            ;	// 0x2106 : ''
	CIR7                            	cir7                            ;	// 0x2107 : ''
	CIR8                            	cir8                            ;	// 0x2108 : ''
	CIR9                            	cir9                            ;	// 0x2109 : ''
	CIR10                           	cir10                           ;	// 0x210a : ''
	CIR11                           	cir11                           ;	// 0x210b : ''
	CIR12                           	cir12                           ;	// 0x210c : ''
	CIR13                           	cir13                           ;	// 0x210d : ''
	CIR14                           	cir14                           ;	// 0x210e : ''
	CIR15                           	cir15                           ;	// 0x210f : ''
	CIR16                           	cir16                           ;	// 0x2110 : ''
	CIR17                           	cir17                           ;	// 0x2111 : ''
	CIR18                           	cir18                           ;	// 0x2112 : ''
	CIR19                           	cir19                           ;	// 0x2113 : ''
	CIR20                           	cir20                           ;	// 0x2114 : ''
	CIR21                           	cir21                           ;	// 0x2115 : ''
	CIR22                           	cir22                           ;	// 0x2116 : ''
	CIR23                           	cir23                           ;	// 0x2117 : ''
	CIR24                           	cir24                           ;	// 0x2118 : ''
	UINT8                           	cir25                           ;	// 0x2119 : ''
	CIR26                           	cir26                           ;	// 0x211a : ''
	UINT8                           	                 __rsvd_00[   1];	// 0x211b
	EQ_CONTROL0                     	eq_control0                     ;	// 0x211c : ''
	EQ_CONTROL1                     	eq_control1                     ;	// 0x211d : ''
	EQ_CONTROL2                     	eq_control2                     ;	// 0x211e : ''
	EQ_CONTROL3                     	eq_control3                     ;	// 0x211f : ''
	EQ_CONTROL4                     	eq_control4                     ;	// 0x2120 : ''
	EQ_CONTROL5                     	eq_control5                     ;	// 0x2121 : ''
	EQ_CONTROL6                     	eq_control6                     ;	// 0x2122 : ''
	EQ_CONTROL7                     	eq_control7                     ;	// 0x2123 : ''
	EQ_CONTROL8                     	eq_control8                     ;	// 0x2124 : ''
	EQ_CONTROL9                     	eq_control9                     ;	// 0x2125 : ''
	EQ_CONTROL10                    	eq_control10                    ;	// 0x2126 : ''
	EQ_CONTROL11                    	eq_control11                    ;	// 0x2127 : ''
	EQ_CONTROL12                    	eq_control12                    ;	// 0x2128 : ''
	EQ_CONTROL13                    	eq_control13                    ;	// 0x2129 : ''
	EQ_CONTROL14                    	eq_control14                    ;	// 0x212a : ''
	EEQ_CONTROL15                   	eeq_control15                   ;	// 0x212b : ''
	EQ_CONTROL16                    	eq_control16                    ;	// 0x212c : ''
	EQ_CONTROL17                    	eq_control17                    ;	// 0x212d : ''
	EQ_CONTROL18                    	eq_control18                    ;	// 0x212e : ''
	EQ_CONTROL19                    	eq_control19                    ;	// 0x212f : ''
	EQ_CONTROL20                    	eq_control20                    ;	// 0x2130 : ''
	FDLMS0                          	fdlms0                          ;	// 0x2131 : ''
	FDLMS1                          	fdlms1                          ;	// 0x2132 : ''
	UINT8                           	                 __rsvd_01[   2];	// 0x2133 ~ 0x2134
	ERROR_GEN0                      	error_gen0                      ;	// 0x2135 : ''
	ERROR_GEN1                      	error_gen1                      ;	// 0x2136 : ''
	ERROR_GEN2                      	error_gen2                      ;	// 0x2137 : ''
	ERROR_GEN3                      	error_gen3                      ;	// 0x2138 : ''
	UINT8                           	                 __rsvd_02[   2];	// 0x2139 ~ 0x213a
	PHASE_DEROTATOR                 	phase_derotator                 ;	// 0x213b : ''
	UINT8                           	                 __rsvd_03[   2];	// 0x213c ~ 0x213d
	COMB0                           	comb0                           ;	// 0x213e : ''
	UINT8                           	                 __rsvd_04[   1];	// 0x213f
	ISOLATION0                      	isolation0                      ;	// 0x2140 : ''
	ISOLATION1                      	isolation1                      ;	// 0x2141 : ''
	ISOLATION2                      	isolation2                      ;	// 0x2142 : ''
	ISOLATION3                      	isolation3                      ;	// 0x2143 : ''
	ISOLATION4                      	isolation4                      ;	// 0x2144 : ''
	ISOLATION5                      	isolation5                      ;	// 0x2145 : ''
	UINT8                           	                 __rsvd_05[   2];	// 0x2146 ~ 0x2147
	BURST_DETECT0                   	burst_detect0                   ;	// 0x2148 : ''
	BURST_DETECT1                   	burst_detect1                   ;	// 0x2149 : ''
	BURST_DETECT2                   	burst_detect2                   ;	// 0x214a : ''
	BURST_DETECT3                   	burst_detect3                   ;	// 0x214b : ''
	BURST_DETECT4                   	burst_detect4                   ;	// 0x214c : ''
	BURST_DETECT5                   	burst_detect5                   ;	// 0x214d : ''
	BURST_DETECT6                   	burst_detect6                   ;	// 0x214e : ''
	BURST_DETECT7                   	burst_detect7                   ;	// 0x214f : ''
	BURST_DETECT8                   	burst_detect8                   ;	// 0x2150 : ''
	BURST_DETECT9                   	burst_detect9                   ;	// 0x2151 : ''
	BURST_DETECT10                  	burst_detect10                  ;	// 0x2152 : ''
	BURST_DETECT11                  	burst_detect11                  ;	// 0x2153 : ''
	BURST_DETECT12                  	burst_detect12                  ;	// 0x2154 : ''
	BURST_DETECT13                  	burst_detect13                  ;	// 0x2155 : ''
	EQ_DYNDET0                      	eq_dyndet0                      ;	// 0x2156 : ''
	EQ_DYNDET1                      	eq_dyndet1                      ;	// 0x2157 : ''
	UINT8                           	                 __rsvd_06[  40];	// 0x2158 ~ 0x217f
	CIR27                           	cir27                           ;	// 0x2180 : ''
	CIR28                           	cir28                           ;	// 0x2181 : ''
	CIR29                           	cir29                           ;	// 0x2182 : ''
	CIR30                           	cir30                           ;	// 0x2183 : ''
	CIR31                           	cir31                           ;	// 0x2184 : ''
	CIR32                           	cir32                           ;	// 0x2185 : ''
	CIR33                           	cir33                           ;	// 0x2186 : ''
	CIR34                           	cir34                           ;	// 0x2187 : ''
	CIR35                           	cir35                           ;	// 0x2188 : ''
	CIR36                           	cir36                           ;	// 0x2189 : ''
	CIR37                           	cir37                           ;	// 0x218a : ''
	CIR38                           	cir38                           ;	// 0x218b : ''
	UINT8                           	                 __rsvd_07[   2];	// 0x218c ~ 0x218d
	EQ_CONTROL21                    	eq_control21                    ;	// 0x218e : ''
	EQ_CONTROL22                    	eq_control22                    ;	// 0x218f : ''
	EQ_CONTROL23                    	eq_control23                    ;	// 0x2190 : ''
	EQ_CONTROL24                    	eq_control24                    ;	// 0x2191 : ''
	EQ_CONTROL25                    	eq_control25                    ;	// 0x2192 : ''
	EQ_CONTROL26                    	eq_control26                    ;	// 0x2193 : ''
	EQ_CONTROL27                    	eq_control27                    ;	// 0x2194 : ''
	EQ_CONTROL28                    	eq_control28                    ;	// 0x2195 : ''
	FDLMS2                          	fdlms2                          ;	// 0x2196 : ''
	UINT8                           	                 __rsvd_08[   2];	// 0x2197 ~ 0x2198
	ERROR_GEN4                      	error_gen4                      ;	// 0x2199 : ''
	UINT8                           	                 __rsvd_09[   2];	// 0x219a ~ 0x219b
	COMB1                           	comb1                           ;	// 0x219c : ''
	UINT8                           	                 __rsvd_10[   1];	// 0x219d
	BURST_DETECT14                  	burst_detect14                  ;	// 0x219e : ''
	BURST_DETECT15                  	burst_detect15                  ;	// 0x219f : ''
	BURST_DETECT16                  	burst_detect16                  ;	// 0x21a0 : ''
	BURST_DETECT17                  	burst_detect17                  ;	// 0x21a1 : ''
	BURST_DETECT18                  	burst_detect18                  ;	// 0x21a2 : ''
	BURST_DETECT19                  	burst_detect19                  ;	// 0x21a3 : ''
	BURST_DETECT20                  	burst_detect20                  ;	// 0x21a4 : ''
} LX_DEMOD_EQ_V_REG_T;
/* 108 regs, 108 types */


typedef struct {
	STO_CTRL0                       	sto_ctrl0                       ;	// 0x2200 : ''
	UINT8                           	                 __rsvd_00[   1];	// 0x2201
	STO_CTRL1                       	sto_ctrl1                       ;	// 0x2202 : ''
	STO_CTRL2                       	sto_ctrl2                       ;	// 0x2203 : ''
	STO_CTRL3                       	sto_ctrl3                       ;	// 0x2204 : ''
	STO_CTRL4                       	sto_ctrl4                       ;	// 0x2205 : ''
	STO_CTRL5                       	sto_ctrl5                       ;	// 0x2206 : ''
	UINT8                           	                 __rsvd_01[   1];	// 0x2207
	PALREJ_CTRL0                    	palrej_ctrl0                    ;	// 0x2208 : ''
	PALREJ_CTRL1                    	palrej_ctrl1                    ;	// 0x2209 : ''
	PALREJ_CTRL2                    	palrej_ctrl2                    ;	// 0x220a : ''
	BEEK_CTRL0                      	beek_ctrl0                      ;	// 0x220b : ''
	CSTO_CTRL0                      	csto_ctrl0                      ;	// 0x220c : ''
	CSTO_CTRL1                      	csto_ctrl1                      ;	// 0x220d : ''
	UINT8                           	                 __rsvd_02[   2];	// 0x220e ~ 0x220f
	FSTO_CTRL0                      	fsto_ctrl0                      ;	// 0x2210 : ''
	FSTO_CTRL1                      	fsto_ctrl1                      ;	// 0x2211 : ''
	FSTO_CTRL2                      	fsto_ctrl2                      ;	// 0x2212 : ''
	UINT8                           	                 __rsvd_03[   1];	// 0x2213
	CIR_CTRL0                       	cir_ctrl0                       ;	// 0x2214 : ''
	CIR_CTRL1                       	cir_ctrl1                       ;	// 0x2215 : ''
	CIR_CTRL2                       	cir_ctrl2                       ;	// 0x2216 : ''
	CIR_CTRL3                       	cir_ctrl3                       ;	// 0x2217 : ''
	CIR_CTRL4                       	cir_ctrl4                       ;	// 0x2218 : ''
	UINT8                           	                 __rsvd_04[   3];	// 0x2219 ~ 0x221b
	DIEQ_CTRL0                      	dieq_ctrl0                      ;	// 0x221c : ''
	DIEQ_CTRL1                      	dieq_ctrl1                      ;	// 0x221d : ''
	DIEQ_CTRL2                      	dieq_ctrl2                      ;	// 0x221e : ''
	DIEQ_CTRL3                      	dieq_ctrl3                      ;	// 0x221f : ''
	UINT8                           	                 __rsvd_05[   1];	// 0x2220
	DIEQ_CTRL4                      	dieq_ctrl4                      ;	// 0x2221 : ''
	DIEQ_CTRL5                      	dieq_ctrl5                      ;	// 0x2222 : ''
	DIEQ_CTRL6                      	dieq_ctrl6                      ;	// 0x2223 : ''
	DIEQ_CTRL7                      	dieq_ctrl7                      ;	// 0x2224 : ''
	DIEQ_CTRL8                      	dieq_ctrl8                      ;	// 0x2225 : ''
	DIEQ_CTRL9                      	dieq_ctrl9                      ;	// 0x2226 : ''
	UINT8                           	                 __rsvd_06[   1];	// 0x2227
	DIEQ_CTRL10                     	dieq_ctrl10                     ;	// 0x2228 : ''
	DIEQ_CTRL11                     	dieq_ctrl11                     ;	// 0x2229 : ''
	DIEQ_CTRL12                     	dieq_ctrl12                     ;	// 0x222a : ''
	DIEQ_CTRL13                     	dieq_ctrl13                     ;	// 0x222b : ''
	DIEQ_CTRL14                     	dieq_ctrl14                     ;	// 0x222c : ''
	UINT8                           	                 __rsvd_07[   3];	// 0x222d ~ 0x222f
	FSTO_CTRL3                      	fsto_ctrl3                      ;	// 0x2230 : ''
	FSTO_CTRL4                      	fsto_ctrl4                      ;	// 0x2231 : ''
	FSTO_CTRL5                      	fsto_ctrl5                      ;	// 0x2232 : ''
	UINT8                           	                 __rsvd_08[  77];	// 0x2233 ~ 0x227f
	STO_MON0                        	sto_mon0                        ;	// 0x2280 : ''
	STO_MON1                        	sto_mon1                        ;	// 0x2281 : ''
	STO_MON2                        	sto_mon2                        ;	// 0x2282 : ''
	STO_MON3                        	sto_mon3                        ;	// 0x2283 : ''
	UINT8                           	                 __rsvd_09[   2];	// 0x2284 ~ 0x2285
	IIR_MON0                        	iir_mon0                        ;	// 0x2286 : ''
	IIR_MON1                        	iir_mon1                        ;	// 0x2287 : ''
	UINT8                           	                 __rsvd_10[   3];	// 0x2288 ~ 0x228a
	FI_MON0                         	fi_mon0                         ;	// 0x228b : ''
	FI_MON1                         	fi_mon1                         ;	// 0x228c : ''
	UINT8                           	                 __rsvd_11[   3];	// 0x228d ~ 0x228f
	POSTEQ_MON0                     	posteq_mon0                     ;	// 0x2290 : ''
	UINT8                           	                 __rsvd_12[   1];	// 0x2291
	FSTO_MON0                       	fsto_mon0                       ;	// 0x2292 : ''
	FSTO_MON1                       	fsto_mon1                       ;	// 0x2293 : ''
	FSTO_MON2                       	fsto_mon2                       ;	// 0x2294 : ''
} LX_DEMOD_EQ_DI_REG_T;
/* 50 regs, 50 types */


typedef struct {
	CR_DEROT_CTRL0                  	cr_derot_ctrl0                  ;	// 0x2800 : ''
	UINT8                           	                 __rsvd_00[   3];	// 0x2801 ~ 0x2803
	BMSE_SNR_CTRL0                  	bmse_snr_ctrl0                  ;	// 0x2804 : ''
	BMSE_SNR_CTRL1                  	bmse_snr_ctrl1                  ;	// 0x2805 : ''
	BMSE_SNR_CTRL2                  	bmse_snr_ctrl2                  ;	// 0x2806 : ''
	BMSE_SNR_CTRL3                  	bmse_snr_ctrl3                  ;	// 0x2807 : ''
	BMSE_SNR_CTRL4                  	bmse_snr_ctrl4                  ;	// 0x2808 : ''
	BMSE_SNR_CTRL5                  	bmse_snr_ctrl5                  ;	// 0x2809 : ''
	BMSE_SNR_CTRL6                  	bmse_snr_ctrl6                  ;	// 0x280a : ''
	BMSE_SNR_CTRL7                  	bmse_snr_ctrl7                  ;	// 0x280b : ''
	BMSE_SNR_CTRL8                  	bmse_snr_ctrl8                  ;	// 0x280c : ''
	BMSE_SNR_CTRL9                  	bmse_snr_ctrl9                  ;	// 0x280d : ''
	BMSE_SNR_CTRL10                 	bmse_snr_ctrl10                 ;	// 0x280e : ''
	BMSE_SNR_CTRL11                 	bmse_snr_ctrl11                 ;	// 0x280f : ''
	BMSE_SNR_CTRL12                 	bmse_snr_ctrl12                 ;	// 0x2810 : ''
	BMSE_SNR_CTRL13                 	bmse_snr_ctrl13                 ;	// 0x2811 : ''
	BMSE_SNR_CTRL14                 	bmse_snr_ctrl14                 ;	// 0x2812 : ''
	BMSE_SNR_CTRL15                 	bmse_snr_ctrl15                 ;	// 0x2813 : ''
	BMSE_SNR_CTRL16                 	bmse_snr_ctrl16                 ;	// 0x2814 : ''
	BMSE_SNR_CTRL17                 	bmse_snr_ctrl17                 ;	// 0x2815 : ''
	BMSE_SNR_CTRL18                 	bmse_snr_ctrl18                 ;	// 0x2816 : ''
	BMSE_SNR_CTRL19                 	bmse_snr_ctrl19                 ;	// 0x2817 : ''
	BMSE_SNR_CTRL20                 	bmse_snr_ctrl20                 ;	// 0x2818 : ''
	UINT8                           	                 __rsvd_01[   3];	// 0x2819 ~ 0x281b
	AWGN_CTRL0                      	awgn_ctrl0                      ;	// 0x281c : ''
	AWGN_CTRL1                      	awgn_ctrl1                      ;	// 0x281d : ''
	AWGN_CTRL2                      	awgn_ctrl2                      ;	// 0x281e : ''
	AWGN_CTRL3                      	awgn_ctrl3                      ;	// 0x281f : ''
	AWGN_CTRL4                      	awgn_ctrl4                      ;	// 0x2820 : ''
	AWGN_CTRL5                      	awgn_ctrl5                      ;	// 0x2821 : ''
	AWGN_CTRL6                      	awgn_ctrl6                      ;	// 0x2822 : ''
	AWGN_CTRL7                      	awgn_ctrl7                      ;	// 0x2823 : ''
	UINT8                           	                 __rsvd_02[   2];	// 0x2824 ~ 0x2825
	GS_BURST_CTRL0                  	gs_burst_ctrl0                  ;	// 0x2826 : ''
	GS_BURST_CTRL1                  	gs_burst_ctrl1                  ;	// 0x2827 : ''
	GS_BURST_CTRL2                  	gs_burst_ctrl2                  ;	// 0x2828 : ''
	GS_BURST_CTRL3                  	gs_burst_ctrl3                  ;	// 0x2829 : ''
	GS_BURST_CTRL4                  	gs_burst_ctrl4                  ;	// 0x282a : ''
	GS_BURST_CTRL5                  	gs_burst_ctrl5                  ;	// 0x282b : ''
	GS_BURST_CTRL6                  	gs_burst_ctrl6                  ;	// 0x282c : ''
	UINT8                           	                 __rsvd_03[   3];	// 0x282d ~ 0x282f
	RADIUS_CTRL0                    	radius_ctrl0                    ;	// 0x2830 : ''
	RADIUS_CTRL1                    	radius_ctrl1                    ;	// 0x2831 : ''
	RADIUS_CTRL2                    	radius_ctrl2                    ;	// 0x2832 : ''
	RADIUS_CTRL31                   	radius_ctrl31                   ;	// 0x2833 : ''
	RADIUS_CTRL4                    	radius_ctrl4                    ;	// 0x2834 : ''
	RADIUS_CTRL5                    	radius_ctrl5                    ;	// 0x2835 : ''
	UINT8                           	                 __rsvd_04[   3];	// 0x2836 ~ 0x2838
	EQ_CTL0                         	eq_ctl0                         ;	// 0x2839 : ''
	EQ_CTL1                         	eq_ctl1                         ;	// 0x283a : ''
	EQ_CTL2                         	eq_ctl2                         ;	// 0x283b : ''
	EQ_CTL3                         	eq_ctl3                         ;	// 0x283c : ''
	UINT8                           	                 __rsvd_05[   2];	// 0x283d ~ 0x283e
	EQ_CTL4                         	eq_ctl4                         ;	// 0x283f : ''
	EQ_CTL5                         	eq_ctl5                         ;	// 0x2840 : ''
	UINT8                           	                 __rsvd_06[   3];	// 0x2841 ~ 0x2843
	FF_FB_FLT_CTL0                  	ff_fb_flt_ctl0                  ;	// 0x2844 : ''
	FF_FB_FLT_CTL1                  	ff_fb_flt_ctl1                  ;	// 0x2845 : ''
	FF_FB_FLT_CTL2                  	ff_fb_flt_ctl2                  ;	// 0x2846 : ''
	UINT8                           	                 __rsvd_07[  57];	// 0x2847 ~ 0x287f
	CR_DEROT_MON0                   	cr_derot_mon0                   ;	// 0x2880 : ''
	UINT8                           	                 __rsvd_08[   5];	// 0x2881 ~ 0x2885
	AWGN_MON0                       	awgn_mon0                       ;	// 0x2886 : ''
	UINT8                           	                 __rsvd_09[   2];	// 0x2887 ~ 0x2888
	GS_BURST_MON0                   	gs_burst_mon0                   ;	// 0x2889 : ''
	GS_BURST_MON1                   	gs_burst_mon1                   ;	// 0x288a : ''
	GS_BURST_MON2                   	gs_burst_mon2                   ;	// 0x288b : ''
	UINT8                           	                 __rsvd_10[   2];	// 0x288c ~ 0x288d
	RADIUS_MON0                     	radius_mon0                     ;	// 0x288e : ''
} LX_DEMOD_EQ_CQS_REG_T;
/* 58 regs, 58 types */

typedef struct {
	FEC_SET0                        	fec_set0                        ;	// 0x3000 : ''
	UINT8                           	                 __rsvd_00[  31];	// 0x3001 ~ 0x301f
	FEC_SET1                        	fec_set1                        ;	// 0x3020 : ''
	UINT8                           	                 __rsvd_01[   4];	// 0x3021 ~ 0x3024
	FEC_SET2                        	fec_set2                        ;	// 0x3025 : ''
	FEC_SET3                        	fec_set3                        ;	// 0x3026 : ''
	FEC_SET4                        	fec_set4                        ;	// 0x3027 : ''
	UINT8                           	                 __rsvd_02[   3];	// 0x3028 ~ 0x302a
	FEC_SET5                        	fec_set5                        ;	// 0x302b : ''
	FEC_SET6                        	fec_set6                        ;	// 0x302c : ''
	FEC_SET7                        	fec_set7                        ;	// 0x302d : ''
	FEC_SET8                        	fec_set8                        ;	// 0x302e : ''
	FEC_SET9                        	fec_set9                        ;	// 0x302f : ''
	UINT8                           	                 __rsvd_03[   2];	// 0x3030 ~ 0x3031
	FEC_SET10                       	fec_set10                       ;	// 0x3032 : ''
	UINT8                           	                 __rsvd_04[   2];	// 0x3033 ~ 0x3034
	FEC_SET11                       	fec_set11                       ;	// 0x3035 : ''
	UINT8                           	                 __rsvd_05[   4];	// 0x3036 ~ 0x3039
	FEC_SET12                       	fec_set12                       ;	// 0x303a : ''
	FEC_SET13                       	fec_set13                       ;	// 0x303b : ''
	FEC_SET14                       	fec_set14                       ;	// 0x303c : ''
	FEC_SET15                       	fec_set15                       ;	// 0x303d : ''
	FEC_SET16                       	fec_set16                       ;	// 0x303e : ''
	UINT8                           	                 __rsvd_06[   2];	// 0x303f ~ 0x3040
	FEC_SET17                       	fec_set17                       ;	// 0x3041 : ''
	FEC_SET18                       	fec_set18                       ;	// 0x3042 : ''
	FEC_SET19                       	fec_set19                       ;	// 0x3043 : ''
	UINT8                           	                 __rsvd_07[  79];	// 0x3044 ~ 0x3092
	FEC_CHK0                        	fec_chk0                        ;	// 0x3093 : ''
	FEC_CHK1                        	fec_chk1                        ;	// 0x3094 : ''
	FEC_CHK2                        	fec_chk2                        ;	// 0x3095 : ''
	FEC_CHK3                        	fec_chk3                        ;	// 0x3096 : ''
	FEC_CHK4                        	fec_chk4                        ;	// 0x3097 : ''
	FEC_CHK5                        	fec_chk5                        ;	// 0x3098 : ''
	FEC_CHK6                        	fec_chk6                        ;	// 0x3099 : ''
	FEC_CHK7                        	fec_chk7                        ;	// 0x309a : ''
	FEC_CHK8                        	fec_chk8                        ;	// 0x309b : ''
	FEC_CHK9                        	fec_chk9                        ;	// 0x309c : ''
	FEC_CHK10                       	fec_chk10                       ;	// 0x309d : ''
	FEC_CHK11                       	fec_chk11                       ;	// 0x309e : ''
	FEC_CHK12                       	fec_chk12                       ;	// 0x309f : ''
	FEC_CHK13                       	fec_chk13                       ;	// 0x30a0 : ''
	FEC_CHK14                       	fec_chk14                       ;	// 0x30a1 : ''
	FEC_CHK15                       	fec_chk15                       ;	// 0x30a2 : ''
	FEC_CHK16                       	fec_chk16                       ;	// 0x30a3 : ''
	FEC_CHK17                       	fec_chk17                       ;	// 0x30a4 : ''
	UINT8                           	                 __rsvd_08[   4];	// 0x30a5 ~ 0x30a8
	FEC_CHK18                       	fec_chk18                       ;	// 0x30a9 : ''
	FEC_CHK19                       	fec_chk19                       ;	// 0x30aa : ''
	FEC_CHK20                       	fec_chk20                       ;	// 0x30ab : ''
	FEC_CHK21                       	fec_chk21                       ;	// 0x30ac : ''
} LX_DEMOD_FEC_REG_T;
/* 42 regs, 42 types */


//extern LX_DEMOD_COMMON_REG_T 	gpRealL9COMMON_Bx;
//extern LX_DEMOD_SYNC_REG_T 		gpRealL9SYNC_Bx;
//extern LX_DEMOD_EQ_V_REG_T 		gpRealL9EQ_V_Bx;
//extern LX_DEMOD_EQ_DI_REG_T 		gpRealL9EQ_DI_Bx;
//extern LX_DEMOD_EQ_CQS_REG_T 	gpRealL9CQS_Bx;
//extern LX_DEMOD_FEC_REG_T	 		gpRealL9FEC_Bx;



extern LX_DEMOD_COMMON_REG_T 	*gpRegL9COMMON_Bx;
extern LX_DEMOD_SYNC_REG_T 		*gpRegL9SYNC_Bx;
extern LX_DEMOD_EQ_V_REG_T 		*gpRegL9EQ_V_Bx;
extern LX_DEMOD_EQ_DI_REG_T 	*gpRegL9EQ_DI_Bx;
extern LX_DEMOD_EQ_CQS_REG_T 	*gpRegL9CQS_Bx;
extern LX_DEMOD_FEC_REG_T	 	*gpRegL9FEC_Bx;

#define DEMOD_COMM_OFFSET 		0x0000
#define DEMOD_SYNC_OFFSET 		0x1000
#define DEMOD_EQ_V_OFFSET 		0x2100
#define DEMOD_EQ_DI_OFFSET 		0x2200
#define DEMOD_EQ_CQS_OFFSET 	0x2800
#define DEMOD_FEC_OFFSET		0x3000



/*
 * @{
 * Naming for register pointer.
