/*
 * SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 * Copyright(c) 2013 by LG Electronics Inc.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 */

/** file
 *
 *  LQC Register Map.
 *  Lipsync Queue Control register details. ( used only within kdriver )
 *
 *  author     sooya.joo(sooya.joo@lge.com)
 *  version    1.0
 *  date       2010.04.05
 *
 */

#ifndef _LQ_REG_H_
#define _LQ_REG_H_

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/
#include "vdec_type_defs.h"
#include "../lg1154_vdec_base.h"


#ifdef __cplusplus
extern "C" {
#endif

/*-----------------------------------------------------------------------------
	0x0000 lqc_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_channel                : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	reg_lqc_lq_keep_count          : 8,	//  4:11
	                                : 3,	// 12:14 reserved
	reg_lqc_auto_end_address       : 1,	//    15
	reg_lqc_stcc_discontinuity     : 1,	//    16
	reg_lqc_lq_vsync_en            : 1,	//    17
	reg_lqc_de_vsync_en            : 1,	//    18
	reg_lqc_use_global_stc         : 1,	//    19
	reg_lqc_wait_sync1             : 1,	//    20
	reg_lqc_wait_sync0             : 1,	//    21
	reg_lqc_lq_discard             : 1,	//    22
	reg_lqc_lq_skip                : 1,	//    23
	reg_lqc_wait_wptr_dis          : 1,	//    24
	reg_lqc_ignore_stc_dts_matching: 1,	//    25
	reg_lqc_lq_delay_dis           : 1,	//    26
	reg_lqc_auto_update_rptr_dis   : 1,	//    27
	reg_lqc_no_wait_intr_ack       : 1,	//    28
	reg_lqc_pause                  : 1,	//    29
	reg_lqc_stop                   : 1,	//    30
	reg_lqc_enable                 : 1;	//    31
} LQC_CONF;

/*-----------------------------------------------------------------------------
	0x0004 lqc_lq_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_lq_base                :12,	//  0:11
	                                : 4,	// 12:15 reserved
	reg_lqc_lq_size                : 8;	// 16:23
} LQC_LQ_CONF;

/*-----------------------------------------------------------------------------
	0x0008 lqc_lq_aempty_time ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_lq_aempty_timer        :24,	//  0:23
	                                : 7,	// 24:30 reserved
	reg_lqc_lq_aempty_timer_en     : 1;	//    31
} LQC_LQ_AEMPTY_TIME;

/*-----------------------------------------------------------------------------
	0x000c lqc_stc_lower ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_lq_stc_ignore_lower 	:29,	//  0:28
	                                : 2,	// 29:30 reserved
	reg_lqc_lq_stc_lower_limit_en	: 1;	//    31
} LQC_STC_LOWER;

/*-----------------------------------------------------------------------------
	0x0010 lqc_lq_wptr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_lq_wptr                : 8;	//  0: 7
} LQC_LQ_WPTR;

/*-----------------------------------------------------------------------------
	0x0014 lqc_lq_rptr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_lq_rptr                : 8;	//  0: 7
} LQC_LQ_RPTR;

/*-----------------------------------------------------------------------------
	0x0018 lqc_lq_afull_lev ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_lq_afull_lev           : 8;	//  0: 7
} LQC_LQ_AFULL_LEV;

/*-----------------------------------------------------------------------------
	0x001c lqc_lq_aempty_lev ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_lq_aempty_lev          : 8;	//  0: 7
} LQC_LQ_AEMPTY_LEV;

/*-----------------------------------------------------------------------------
	0x0020 lqc_stc_upper ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_stc_ignore_upper       :29,	//  0:28
	                                : 2,	// 29:30 reserved
	reg_lqc_stc_upper_limit_en     : 1;	//    31
} LQC_STC_UPPER;

/*-----------------------------------------------------------------------------
	0x0024 lqc_stc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_stc                    :28;	//  0:27
} LQC_STC;

/*-----------------------------------------------------------------------------
	0x0028 lqc_stc_gstc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_stc_gstcc_diff         :28;	//  0:27
} LQC_STC_GSTC;

/*-----------------------------------------------------------------------------
	0x002c lqc_intr_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_intr_timer             :28,	//  0:27
	                                : 3,	// 28:30 reserved
	reg_lqc_intr_timer_en          : 1;	//    31
} LQC_INTR_TIMER;

/*-----------------------------------------------------------------------------
	0x0030 lqc_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_lq_st                  : 8,	//  0: 7
	                                : 8,	//  8:15 reserved
	reg_lqc_discont_cnt            : 8;	// 16:23
} LQC_STATUS;

/*-----------------------------------------------------------------------------
	0x0034 lqc_sync_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_sync_cnt_init_value    :16,	//  0:15
	reg_lqc_sync_cnt_adj_num       : 8;	// 16:23
} LQC_SYNC_CNT;

/*-----------------------------------------------------------------------------
	0x0038 lqc_dts_stc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_dts_stc_diff           :29;	//  0:28
} LQC_DTS_STC;

/*-----------------------------------------------------------------------------
	0x003c lqc_dts_gstc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_dts_gstc_diff          :29;	//  0:28
} LQC_DTS_GSTC;

/*-----------------------------------------------------------------------------
	0x0104 lq_reset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                :28,	//  0:27 reserved
	reg_lqc0_srst                   : 1,	//    28
	reg_lqc1_srst                   : 1,	//    29
	reg_lqc2_srst                   : 1,	//    30
	reg_lqc3_srst                   : 1;	//    31
} LQ_RESET;

/*-----------------------------------------------------------------------------
	0x0108 lq_apb_prt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lq_apb_s0_prt               : 4,	//  0: 3
	reg_lq_apb_s1_prt               : 4,	//  4: 7
	reg_lq_apb_s2_prt               : 4,	//  8:11
	reg_lq_apb_s3_prt               : 4,	// 12:15
	reg_lq_apb_s4_prt               : 4;	// 16:19
} LQ_APB_PRT;

/*-----------------------------------------------------------------------------
	0x01e0 lqc_cmd_type ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_cmd_type               : 8;	//  0: 7
} LQC_CMD_TYPE;

/*-----------------------------------------------------------------------------
	0x01e4 lqc0_cmd_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_lqc_cmd_data               ;   	// 31: 0
} LQC_CMD_DATA;

typedef struct {
	LQC_CMD_TYPE	cmd_type;
	UINT32			cmd_data;
} LQC_CMD_T;


typedef struct {
	LQC_CONF                       	lqc_conf                       ;	// 0x0000 : ''
	LQC_LQ_CONF                    	lqc_lq_conf                    ;	// 0x0004 : ''
	LQC_LQ_AEMPTY_TIME             	lqc_lq_aempty_time             ;	// 0x0008 : ''
	LQC_STC_LOWER                   lqc_stc_lower                  ;	// 0x000c
	LQC_LQ_WPTR                    	lqc_lq_wptr                    ;	// 0x0010 : ''
	LQC_LQ_RPTR                    	lqc_lq_rptr                    ;	// 0x0014 : ''
	LQC_LQ_AFULL_LEV               	lqc_lq_afull_lev               ;	// 0x0018 : ''
	LQC_LQ_AEMPTY_LEV              	lqc_lq_aempty_lev              ;	// 0x001c : ''
	LQC_STC_UPPER                  	lqc_stc_upper                  ;	// 0x0020 : ''
	LQC_STC                         	lqc_stc                         ;	// 0x0024 : ''
	LQC_STC_GSTC                   	lqc_stc_gstc                   ;	// 0x0028 : ''
	LQC_INTR_TIMER                 	lqc_intr_timer                 ;	// 0x002c : ''
	LQC_STATUS                     	lqc_status                     ;	// 0x0030 : ''
	LQC_SYNC_CNT                   	lqc_sync_cnt                   ;	// 0x0034 : ''
	LQC_DTS_STC                    	lqc_dts_stc                    ;	// 0x0038 : ''
	LQC_DTS_GSTC                   	lqc_dts_gstc                   ;	// 0x003c : ''
} LQC_REG_T;
/* 15 regs, 15 types */

typedef struct {
	UINT32                          	lq_ver                          ;	// 0x0100 : ''
	LQ_RESET                        	lq_reset                        ;	// 0x0104 : ''
	LQ_APB_PRT                      	lq_apb_prt                      ;	// 0x0108 : ''
	UINT32                          	                 __rsvd_01[  53];	// 0x010c ~ 0x01dc
	LQC_CMD_T				lqc_cmd[4]					;	// 0x01e0 ~ 0x01fc
} LQ_REG_T;
/* 10 regs, 10 types */

/* 72 regs, 72 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegLQC0 : real register of LQC0.
 * gpRegLQC0     : shadow register.
 *
 * @def LQC0_RdFL: Read  FLushing : Shadow <- Real.
 * @def LQC0_WrFL: Write FLushing : Shadow -> Real.
 * @def LQC0_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def LQC0_Wr  : Write whole register(UINT32) from Shadow register.
 * @def LQC0_Rd01 ~ LQC0_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def LQC0_Wr01 ~ LQC0_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define LQC0_RdFL(_r)			((gpRegLQC0->_r)=(gpRealRegLQC0->_r))
#define LQC0_WrFL(_r)			((gpRealRegLQC0->_r)=(gpRegLQC0->_r))

#define LQC0_Rd(_r)			*((UINT32*)(&(gpRegLQC0->_r)))
#define LQC0_Wr(_r,_v)			((LQC0_Rd(_r))=((UINT32)(_v)))

#define LQC0_Rd01(_r,_f01,_v01)													\
								do { 											\
