/*
 * SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 * Copyright(c) 2013 by LG Electronics Inc.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 */

/** @file
 *
 *  VDO register details. ( used only within kdriver )
 *
 *  author     user name (user_name@lge.com)
 *  version    1.0
 *  date       2010.xx.xx
 *
 */

#ifndef _VDO_REG_H_
#define _VDO_REG_H_

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/
#include "vdec_type_defs.h"
#include "../lg1154_vdec_base.h"


#ifdef __XTENSA__
#define VDEC_VDO_BASE		(MCU_REG_BASE + 0x1F00)
#else
#define VDEC_VDO_BASE		(H13_VDEC_BASE + 0x0F00)
#endif


/////////////////////////////////////////////////////////////////////////////////////////
// VDO Register
// VDEC_VDO_BASE    : 0xF00
// VDO              : 0xF00 - 0xFFC
/////////////////////////////////////////////////////////////////////////////////////////

#define VDO_VERSION                      (*(volatile UINT32 *)(stpVdoReg + 0x000))

#define VDO_GDI_RBC2_AXI_6               (*(volatile UINT32 *)(stpVdoReg + 0x0B8))  //800
#define VDO_GDI_RBC2_AXI_7               (*(volatile UINT32 *)(stpVdoReg + 0x0BC))  //800
#define VDO_GDI_RBC2_AXI_8               (*(volatile UINT32 *)(stpVdoReg + 0x0C0))  //800
#define VDO_GDI_RBC2_AXI_9               (*(volatile UINT32 *)(stpVdoReg + 0x0C4))  //800
#define VDO_GDI_RBC2_AXI_A               (*(volatile UINT32 *)(stpVdoReg + 0x0C8))  //800
#define VDO_GDI_RBC2_AXI_B               (*(volatile UINT32 *)(stpVdoReg + 0x0CC))  //800
#define VDO_GDI_RBC2_AXI_C               (*(volatile UINT32 *)(stpVdoReg + 0x0D0))  //800
#define VDO_GDI_RBC2_AXI_D               (*(volatile UINT32 *)(stpVdoReg + 0x0D4))  //800
#define VDO_GDI_RBC2_AXI_E               (*(volatile UINT32 *)(stpVdoReg + 0x0D8))  //800
#define VDO_GDI_RBC2_AXI_F               (*(volatile UINT32 *)(stpVdoReg + 0x0DC))  //800
#define VDO_GDI_RBC2_AXI_10              (*(volatile UINT32 *)(stpVdoReg + 0x0E0))  //800
#define VDO_GDI_RBC2_AXI_11              (*(volatile UINT32 *)(stpVdoReg + 0x0E4))  //800
#define VDO_GDI_RBC2_AXI_12              (*(volatile UINT32 *)(stpVdoReg + 0x0E8))  //800
#define VDO_GDI_RBC2_AXI_13              (*(volatile UINT32 *)(stpVdoReg + 0x0EC))  //800
#define VDO_GDI_RBC2_AXI_14              (*(volatile UINT32 *)(stpVdoReg + 0x0F0))  //800
#define VDO_GDI_RBC2_AXI_15              (*(volatile UINT32 *)(stpVdoReg + 0x0F4))  //800
#define VDO_GDI_RBC2_AXI_16              (*(volatile UINT32 *)(stpVdoReg + 0x0F8))  //800
#define VDO_GDI_RBC2_AXI_17              (*(volatile UINT32 *)(stpVdoReg + 0x0FC))  //800
/////////////////////////////////////////////////////////
// Must set RC0 APB_CONF register
// reg_apb_vdo_gdi_sel[   24] = 0x1
// reg_apb_vdo_offset [31:28] = 0x9
/////////////////////////////////////////////////////////
#define VDO_GDI_RBC2_AXI_18              (*(volatile UINT32 *)(stpVdoReg + 0x000))  //900
#define VDO_GDI_RBC2_AXI_19              (*(volatile UINT32 *)(stpVdoReg + 0x004))  //900
#define VDO_GDI_RBC2_AXI_1A              (*(volatile UINT32 *)(stpVdoReg + 0x008))  //900
#define VDO_GDI_RBC2_AXI_1B              (*(volatile UINT32 *)(stpVdoReg + 0x00C))  //900
#define VDO_GDI_RBC2_AXI_1C              (*(volatile UINT32 *)(stpVdoReg + 0x010))  //900
#define VDO_GDI_RBC2_AXI_1D              (*(volatile UINT32 *)(stpVdoReg + 0x014))  //900
#define VDO_GDI_RBC2_AXI_1E              (*(volatile UINT32 *)(stpVdoReg + 0x018))  //900
#define VDO_GDI_RBC2_AXI_1F              (*(volatile UINT32 *)(stpVdoReg + 0x01C))  //900
#define VDO_GDI_TILEDBUF_BASE            (*(volatile UINT32 *)(stpVdoReg + 0x020))  //900
/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/

#if 0
#ifdef __cplusplus
extern "C" {
#endif

/*-----------------------------------------------------------------------------
	0x0000 version ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	yyyymmdd                        ;   	// 31: 0
} VERSION;

/*-----------------------------------------------------------------------------
	0x0008 vdo_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_dual_mode                   : 1,	//     0
	                                : 3,	//  1: 3 reserved
	reg_chan_sel                    : 1,	//     4
	                                : 3,	//  5: 7 reserved
	reg_vdo_ch0_vsync_sel           : 1,	//     8
	reg_vdo_ch1_vsync_sel           : 1,	//     9
	                                : 2,	// 10:11 reserved
	reg_vdo_endian                  : 2,	// 12:13
	                                : 2,	// 14:15 reserved
	reg_reqb_hlen                   : 8,	// 16:23
	reg_reqb_wlen                   : 8;	// 24:31
} VDO_CONF;

/*-----------------------------------------------------------------------------
	0x000c vdo_cmd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_run                         : 1,	//     0
	                                : 3,	//  1: 3 reserved
	pic_init                        : 1,	//     4
	                                :23,	//  5:27 reserved
	vdo_en                          : 1;	//    28
} VDO_CMD;

/*-----------------------------------------------------------------------------
	0x0010 ch0_pic_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0_pic_height                  :12,	//  0:11
	                                : 4,	// 12:15 reserved
	ch0_pic_width                   :12;	// 16:27
} CH0_PIC_SIZE;

/*-----------------------------------------------------------------------------
	0x0014 ch0_buf_idx ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0_buf_idx                     : 5;	//  0: 4
} CH0_BUF_IDX;

/*-----------------------------------------------------------------------------
	0x0018 ch0_chroma_format ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0_cformat                     : 3,	//  0: 2
	                                :13,	//  3:15 reserved
	ch0_cformat_int                 : 3;	// 16:18
} CH0_CHROMA_FORMAT;

/*-----------------------------------------------------------------------------
	0x001c ch0_scan_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0_field                       : 1,	//     0
	                                : 3,	//  1: 3 reserved
	ch0_prog_scan                   : 1;	//     4
} CH0_SCAN_MODE;

/*-----------------------------------------------------------------------------
	0x0020 ch1_pic_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1_pic_height                  :12,	//  0:11
	                                : 4,	// 12:15 reserved
	ch1_pic_width                   :12;	// 16:27
} CH1_PIC_SIZE;

/*-----------------------------------------------------------------------------
	0x0024 ch1_buf_idx ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1_buf_idx                     : 5;	//  0: 4
} CH1_BUF_IDX;

/*-----------------------------------------------------------------------------
	0x0028 ch1_chroma_format ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1_cformat                     : 3,	//  0: 2
	                                :13,	//  3:15 reserved
	ch1_cformat_int                 : 3;	// 16:18
} CH1_CHROMA_FORMAT;

/*-----------------------------------------------------------------------------
	0x002c ch1_scan_mode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1_field                       : 1,	//     0
	                                : 3,	//  1: 3 reserved
	ch1_prog_scan                   : 1;	//     4
} CH1_SCAN_MODE;

/*-----------------------------------------------------------------------------
	0x0030 mif_wait_reqb ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reqb_wait_cycle                 :16,	//  0:15
	                                :12,	// 16:27 reserved
	reqb_wait_en                    : 1;	//    28
} MIF_WAIT_REQB;

/*-----------------------------------------------------------------------------
	0x0100 ch0_vbp_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0_vbp_num                     :16;	//  0:15
} CH0_VBP_NUM;

/*-----------------------------------------------------------------------------
	0x0104 ch0_vfp_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0_vfp_num                     :16;	//  0:15
} CH0_VFP_NUM;

/*-----------------------------------------------------------------------------
	0x0108 ch0_vsync_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch0_vsync_num                   :16;	//  0:15
} CH0_VSYNC_NUM;

/*-----------------------------------------------------------------------------
	0x0110 ch1_vbp_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1_vbp_num                     :16;	//  0:15
} CH1_VBP_NUM;

/*-----------------------------------------------------------------------------
	0x0114 ch1_vfp_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1_vfp_num                     :16;	//  0:15
} CH1_VFP_NUM;

/*-----------------------------------------------------------------------------
	0x0118 ch1_vsync_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch1_vsync_num                   :16;	//  0:15
} CH1_VSYNC_NUM;

typedef struct {
	VERSION                         	version                         ;	// 0x0000 : ''
	UINT32                          	                 __rsvd_00[   1];	// 0x0004
	VDO_CONF                        	vdo_conf                        ;	// 0x0008 : ''
	VDO_CMD                         	vdo_cmd                         ;	// 0x000c : ''
	CH0_PIC_SIZE                    	ch0_pic_size                    ;	// 0x0010 : ''
	CH0_BUF_IDX                     	ch0_buf_idx                     ;	// 0x0014 : ''
	CH0_CHROMA_FORMAT               	ch0_chroma_format               ;	// 0x0018 : ''
	CH0_SCAN_MODE                   	ch0_scan_mode                   ;	// 0x001c : ''
	CH1_PIC_SIZE                    	ch1_pic_size                    ;	// 0x0020 : ''
	CH1_BUF_IDX                     	ch1_buf_idx                     ;	// 0x0024 : ''
	CH1_CHROMA_FORMAT               	ch1_chroma_format               ;	// 0x0028 : ''
	CH1_SCAN_MODE                   	ch1_scan_mode                   ;	// 0x002c : ''
	MIF_WAIT_REQB                   	mif_wait_reqb                   ;	// 0x0030 : ''
	UINT32                          	                 __rsvd_01[  51];	// 0x0034 ~ 0x00fc
	CH0_VBP_NUM                     	ch0_vbp_num                     ;	// 0x0100 : ''
	CH0_VFP_NUM                     	ch0_vfp_num                     ;	// 0x0104 : ''
	CH0_VSYNC_NUM                   	ch0_vsync_num                   ;	// 0x0108 : ''
	UINT32                          	                 __rsvd_02[   1];	// 0x010c
	CH1_VBP_NUM                     	ch1_vbp_num                     ;	// 0x0110 : ''
	CH1_VFP_NUM                     	ch1_vfp_num                     ;	// 0x0114 : ''
	CH1_VSYNC_NUM                   	ch1_vsync_num                   ;	// 0x0118 : ''
} VDO_REG_T;
/* 18 regs, 18 types */

/* 18 regs, 18 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegVDO : real register of VDO.
 * gpRegVDO     : shadow register.
 *
 * @def VDO_RdFL: Read  FLushing : Shadow <- Real.
 * @def VDO_WrFL: Write FLushing : Shadow -> Real.
 * @def VDO_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def VDO_Wr  : Write whole register(UINT32) from Shadow register.
 * @def VDO_Rd01 ~ VDO_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def VDO_Wr01 ~ VDO_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define VDO_RdFL(_r)			((gpRegVDO->_r)=(gpRealRegVDO->_r))
#define VDO_WrFL(_r)			((gpRealRegVDO->_r)=(gpRegVDO->_r))

#define VDO_Rd(_r)			*((UINT32*)(&(gpRegVDO->_r)))
#define VDO_Wr(_r,_v)			((VDO_Rd(_r))=((UINT32)(_v)))

#define VDO_Rd01(_r,_f01,_v01)													\
								do { 											\
