/*
 * SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 * Copyright(c) 2013 by LG Electronics Inc.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 */

/** @file
 *
 *  #MOD# register details. ( used only within kdriver )
 *
 *  author     user name (user_name@lge.com)
 *  version    1.0
 *  date       2010.xx.xx
 *
 */

#ifndef _VSYNC_REG_H_
#define _VSYNC_REG_H_

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/


#ifdef __cplusplus
extern "C" {
#endif

/*-----------------------------------------------------------------------------
	0x0000 version ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	yyyymmdd                        ;   	// 31: 0
} VERSION;

/*-----------------------------------------------------------------------------
	0x0004 sync_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_int_vsync0_field_sel        : 1,	//     0
	reg_int_vsync1_field_sel        : 1,	//     1
	reg_int_vsync2_field_sel        : 1,	//     2
	reg_int_vsync3_field_sel        : 1,	//     3
	reg_vsync0_update_mode          : 1,	//     4
	reg_vsync1_update_mode          : 1,	//     5
	reg_vsync2_update_mode          : 1,	//     6
	reg_vsync3_update_mode          : 1,	//     7
	reg_vsync0_first_pul_en         : 1,	//     8
	reg_vsync1_first_pul_en         : 1,	//     9
	reg_vsync2_first_pul_en         : 1,	//    10
	reg_vsync3_first_pul_en         : 1,	//    11
	reg_ext_vsync0_field_sel        : 1,	//    12
	reg_ext_vsync1_field_sel        : 1,	//    13
	reg_ext_vsync2_field_sel        : 1,	//    14
	reg_ext_vsync3_field_sel        : 1,	//    15
	                                : 8,	// 16:23 reserved
	reg_vsync0_srst                 : 1,	//    24
	reg_vsync1_srst                 : 1,	//    25
	reg_vsync2_srst                 : 1,	//    26
	reg_vsync3_srst                 : 1,	//    27
	reg_vsync0_en                   : 1,	//    28
	reg_vsync1_en                   : 1,	//    29
	reg_vsync2_en                   : 1,	//    30
	reg_vsync3_en                   : 1;	//    31
} VDISP_CONF;

/*-----------------------------------------------------------------------------
	0x0008 sync_update ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync0_update               : 1,	//     0
	reg_vsync1_update               : 1,	//     1
	reg_vsync2_update               : 1,	//     2
	reg_vsync3_update               : 1;	//     3
} VDISP_UPDATE;

/*-----------------------------------------------------------------------------
	0x0010~0x002c vsync0_field_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32	reg_field0_num           ;   	// 31: 0
	UINT32	reg_field1_num           ;   	// 31: 0
} VSYNC_FIELD_NUM;

/*-----------------------------------------------------------------------------
	0x0010 vsync0_field0_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync0_field0_num           ;   	// 31: 0
} VSYNC0_FIELD0_NUM;

/*-----------------------------------------------------------------------------
	0x0014 vsync0_field1_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync0_field1_num           ;   	// 31: 0
} VSYNC0_FIELD1_NUM;

/*-----------------------------------------------------------------------------
	0x0018 vsync1_field0_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync1_field0_num           ;   	// 31: 0
} VSYNC1_FIELD0_NUM;

/*-----------------------------------------------------------------------------
	0x001c vsync1_field1_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync1_field1_num           ;   	// 31: 0
} VSYNC1_FIELD1_NUM;

/*-----------------------------------------------------------------------------
	0x0020 vsync2_field0_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync2_field0_num           ;   	// 31: 0
} VSYNC2_FIELD0_NUM;

/*-----------------------------------------------------------------------------
	0x0024 vsync2_field1_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync2_field1_num           ;   	// 31: 0
} VSYNC2_FIELD1_NUM;

/*-----------------------------------------------------------------------------
	0x0028 vsync3_field0_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync3_field0_num           ;   	// 31: 0
} VSYNC3_FIELD0_NUM;

/*-----------------------------------------------------------------------------
	0x002c vsync3_field1_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vsync3_field1_num           ;   	// 31: 0
} VSYNC3_FIELD1_NUM;

/*-----------------------------------------------------------------------------
	0x0030~0x003c vsync_int_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_int_vsync_field         : 1;   	//     0
} VSYNC_INT_FIELD;

/*-----------------------------------------------------------------------------
	0x0030 vsync0_int_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_int_vsync0_field            : 1;	//     0
} VSYNC0_INT_FIELD;

/*-----------------------------------------------------------------------------
	0x0034 vsync1_int_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_int_vsync1_filed            : 1;	//     0
} VSYNC1_INT_FIELD;

/*-----------------------------------------------------------------------------
	0x0038 vsync2_int_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_int_vsync2_filed            : 1;	//     0
} VSYNC2_INT_FIELD;

/*-----------------------------------------------------------------------------
	0x003c vsync3_int_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_int_vsync3_filed            : 1;	//     0
} VSYNC3_INT_FIELD;

/*-----------------------------------------------------------------------------
	0x0040~0x004C vsync_ext_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_ext_vsync_field         : 1;   	//     0
} VSYNC_EXT_FIELD;

/*-----------------------------------------------------------------------------
	0x0040 vsync0_ext_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_ext_vsync0_field            : 1;	//     0
} VSYNC0_EXT_FIELD;

/*-----------------------------------------------------------------------------
	0x0044 vsync1_ext_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_ext_vsync1_field            : 1;	//     0
} VSYNC1_EXT_FIELD;

/*-----------------------------------------------------------------------------
	0x0048 vsync2_ext_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_ext_vsync2_field            : 1;	//     0
} VSYNC2_EXT_FIELD;

/*-----------------------------------------------------------------------------
	0x004c vsync3_ext_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_ext_vsync3_field            : 1;	//     0
} VSYNC3_EXT_FIELD;

/*-----------------------------------------------------------------------------
	0x0050 timer_conf ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 4,	//  0: 3 reserved
	reg_timer0_update_mode          : 1,	//     4
	reg_timer1_update_mode          : 1,	//     5
	reg_timer2_update_mode          : 1,	//     6
	reg_timer3_update_mode          : 1,	//     7
	                                :16,	//  8:23 reserved
	reg_timer0_srst                 : 1,	//    24
	reg_timer1_srst                 : 1,	//    25
	reg_timer2_srst                 : 1,	//    26
	reg_timer3_srst                 : 1,	//    27
	reg_timer0_en                   : 1,	//    28
	reg_timer1_en                   : 1,	//    29
	reg_timer2_en                   : 1,	//    30
	reg_timer3_en                   : 1;	//    31
} TIMER_CONF;

/*-----------------------------------------------------------------------------
	0x0058 timer_update ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_timer0_update               : 1,	//     0
	reg_timer1_update               : 1,	//     1
	reg_timer2_update               : 1,	//     2
	reg_timer3_update               : 1;	//     3
} TIMER_UPDATE;

/*-----------------------------------------------------------------------------
	0x0060 timer0_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_timer0_num                  ;   	// 31: 0
} TIMER0_NUM;

/*-----------------------------------------------------------------------------
	0x0064 timer1_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_timer1_num                  ;   	// 31: 0
} TIMER1_NUM;

/*-----------------------------------------------------------------------------
	0x0068 timer2_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_timer2_num                  ;   	// 31: 0
} TIMER2_NUM;

/*-----------------------------------------------------------------------------
	0x006c timer3_num ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_timer3_num                  ;   	// 31: 0
} TIMER3_NUM;


typedef struct {
	UINT32              		version       ;	// 0x0000 : ''
	VDISP_CONF               	sync_conf     ;	// 0x0004 : ''
	VDISP_UPDATE				sync_update   ; // 0x0008 : ''
	UINT32         	           __rsvd_00[   1];	// 0x000c

	VSYNC_FIELD_NUM     	vsync_field_num[4];	// 0x0010 ~ 0x002c
	VSYNC_INT_FIELD			vsync_int_field[4]  ; // 0x030~0x03c
	VSYNC_EXT_FIELD			vsync_ext_field[4]  ; // 0x040~0x04c

	TIMER_CONF                      	timer_conf                      ;	// 0x0050 : ''
	UINT32                          	                 __rsvd_01[   1];	// 0x0054
	TIMER_UPDATE                    	timer_update                    ;	// 0x0058 : ''
	UINT32                          	                 __rsvd_02[   1];	// 0x005c
	TIMER0_NUM                      	timer0_num                      ;	// 0x0060 : ''
	TIMER1_NUM                      	timer1_num                      ;	// 0x0064 : ''
	TIMER2_NUM                      	timer2_num                      ;	// 0x0068 : ''
	TIMER3_NUM                      	timer3_num                      ;	// 0x006c : ''
} Sync_REG_T;
/* 6 regs, 6 types */

/*
 * @{
 * Naming for register pointer.
 * gpRealRegSync : real register of Sync.
 * gpRegSync     : shadow register.
 *
 * @def Sync_RdFL: Read  FLushing : Shadow <- Real.
 * @def Sync_WrFL: Write FLushing : Shadow -> Real.
 * @def Sync_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def Sync_Wr  : Write whole register(UINT32) from Shadow register.
 * @def Sync_Rd01 ~ Sync_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def Sync_Wr01 ~ Sync_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define Sync_RdFL(_r)			((gpRegSync->_r)=(gpRealRegSync->_r))
#define Sync_WrFL(_r)			((gpRealRegSync->_r)=(gpRegSync->_r))

#define Sync_Rd(_r)			*((UINT32*)(&(gpRegSync->_r)))
#define Sync_Wr(_r,_v)			((Sync_Rd(_r))=((UINT32)(_v)))

#define Sync_Rd01(_r,_f01,_v01)													\
								do { 											\
