#ifndef __CPU_TOP_REG_M14B0_H__
#define __CPU_TOP_REG_M14B0_H__

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/


#ifdef __cplusplus
extern "C" {
#endif

/*-----------------------------------------------------------------------------
	0x0000 gp_reg0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0004 gp_reg1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0008 gp_reg2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x000c gp_reg3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0010 cpu0_addr_sw_reg_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reserved                        :10,	//  0: 9
	cpu0_paddr_app_nor_boot         : 6,	// 10:15
	reserved_1                      :12,	// 16:27
	cpu0_laddr_app_nor_boot         : 4;	// 28:31
} CPU0_ADDR_SW_REG_0_M14B0;

/*-----------------------------------------------------------------------------
	0x0014 cpu0_addr_sw_reg_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cpu0_paddr_app_rom_boot         :14,	//  0:13
	reserved                        : 4,	// 14:17
	cpu0_laddr_app_rom_boot         :14;	// 18:31
} CPU0_ADDR_SW_REG_1_M14B0;

/*-----------------------------------------------------------------------------
	0x0018 cpu0_addr_sw_reg_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reserved                        :16,	//  0:15
	reserved_1                      : 2,	// 16:17
	cpu0_paddr_app_shadow           : 4,	// 18:21
	reserved_2                      : 6,	// 22:27
	cpu0_laddr_app_shadow           : 4;	// 28:31
} CPU0_ADDR_SW_REG_2_M14B0;

/*-----------------------------------------------------------------------------
	0x0068 peri0_addr_sw_reg_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reserved                        :10,	//  0: 9
	peri0_paddr_app_nor_boot        : 4,	// 10:13
	reserved_1                      :14,	// 14:27
	peri0_laddr_app_nor_boot        : 4;	// 28:31
} PERI0_ADDR_SW_REG_0_M14B0;

/*-----------------------------------------------------------------------------
	0x006c peri0_addr_sw_reg_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	peri0_paddr_app_rom_boot        :14,	//  0:13
	reserved                        : 4,	// 14:17
	peri0_laddr_app_rom_boot        :14;	// 18:31
} PERI0_ADDR_SW_REG_1_M14B0;

/*-----------------------------------------------------------------------------
	0x0070 peri0_addr_sw_reg_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reserved                        :16,	//  0:15
	reserved_1                      : 2,	// 16:17
	peri0_paddr_app_shadow          : 4,	// 18:21
	reserved_2                      : 6,	// 22:27
	peri0_laddr_app_shadow          : 4;	// 28:31
} PERI0_ADDR_SW_REG_2_M14B0;

/*-----------------------------------------------------------------------------
	0x0128 io_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ci_en                           : 1,	//     0
	nfc_intr_sel                    : 1,	//     1
	reserved                        : 2,	//  2: 3
	monitor_sig_sel                 : 4,	//  4: 7
	reserved_1                      : 8,	//  8:15
	ahb_port_sel                    :14,	// 16:29
	reserved_2                      : 2;	// 30:31
} IO_CTRL_M14B0;

/*-----------------------------------------------------------------------------
	0x0148 stcc0_ref_time_stamp_32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc0_ref_time_stamp_high       : 1;	//     0
} STCC0_REF_TIME_STAMP_32_M14B0;

/*-----------------------------------------------------------------------------
	0x014c stcc0_ref_time_stamp_31_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc0_ref_time_stamp_low        ;   	// 31: 0
} STCC0_REF_TIME_STAMP_31_0_M14B0;

/*-----------------------------------------------------------------------------
	0x0150 stcc0_real_time_stamp_32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc0_real_time_stamp_high      : 1;	//     0
} STCC0_REAL_TIME_STAMP_32_M14B0;

/*-----------------------------------------------------------------------------
	0x0154 stcc0_real_time_stamp_31_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc0_real_time_stamp_low       ;   	// 31: 0
} STCC0_REAL_TIME_STAMP_31_0_M14B0;

/*-----------------------------------------------------------------------------
	0x0158 flush_done_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_flush_done                   : 1,	//     0
	                                : 1,	//     1 reserved
	vdec_flush_done                 : 1,	//     2
	icod_flush_done                 : 1,	//     3
	venc_flush_done                 : 1,	//     4
	te_flush_done                   : 1,	//     5
	gpu_flush_done                  : 1,	//     6
	gfx_flush_done                  : 1,	//     7
	de_gmau_flush_done_dp           : 1,	//     8
	de_gmau_flush_done              : 1,	//     9
	aud_dsp1_flush_done             : 1,	//    10
	aud_dsp0_flush_done             : 1,	//    11
	dvi_flush_done                  : 1,	//    12
	dvo_flush_done                  : 1,	//    13
	mc_flush_done                   : 1,	//    14
	ma_flush_done                   : 1,	//    15
	mb_flhsu_done                   : 1,	//    16
	sre_flush_done                  : 1,	//    17
	dppa_flush_done                 : 1,	//    18
	dppb_flush_done                 : 1;	//    19
} FLUSH_DONE_STATUS_M14B0;

/*-----------------------------------------------------------------------------
	0x015c flush_req ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_flush_en                     : 1,	//     0
	                                : 1,	//     1 reserved
	vdec_flush_en                   : 1,	//     2
	icod_flush_en                   : 1,	//     3
	venc_flush_en                   : 1,	//     4
	te_flush_en                     : 1,	//     5
	gpu_flush_en                    : 1,	//     6
	gfx_flush_en                    : 1,	//     7
	de_gmau_flush_en_dp             : 1,	//     8
	de_gmau_flush_en                : 1,	//     9
	aud_dsp1_flush_en               : 1,	//    10
	aud_dsp0_flush_en               : 1,	//    11
	dvi_flush_en                    : 1,	//    12
	dvo_flush_en                    : 1,	//    13
	mc_flush_en                     : 1,	//    14
	ma_flush_en                     : 1,	//    15
	mb_flhsu_en                     : 1,	//    16
	sre_flush_en                    : 1,	//    17
	dppa_flush_en                   : 1,	//    18
	dppb_flush_en                   : 1;	//    19
} FLUSH_REQ_M14B0;

/*-----------------------------------------------------------------------------
	0x016c bandwidth_limiter_cpu_axi0_dly_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bw_cpu_raxi0_dly_cnt            :16,	//  0:15
	bw_cpu_waxi0_dly_cnt            :16;	// 16:31
} BANDWIDTH_LIMITER_CPU_AXI0_DLY_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0170 bandwidth_limiter_cpu_axi1_dly_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bw_cpu_raxi1_dly_cnt            :16,	//  0:15
	bw_cpu_waxi1_dly_cnt            :16;	// 16:31
} BANDWIDTH_LIMITER_CPU_AXI1_DLY_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0174 gpio_interrupt_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gpio0_intr                      : 1,	//     0
	gpio1_intr                      : 1,	//     1
	gpio2_intr                      : 1,	//     2
	gpio3_intr                      : 1,	//     3
	gpio4_intr                      : 1,	//     4
	gpio5_intr                      : 1,	//     5
	gpio6_intr                      : 1,	//     6
	gpio7_intr                      : 1,	//     7
	gpio8_intr                      : 1,	//     8
	gpio9_intr                      : 1,	//     9
	gpio10_intr                     : 1,	//    10
	gpio11_intr                     : 1,	//    11
	gpio12_intr                     : 1,	//    12
	gpio13_intr                     : 1,	//    13
	gpio14_intr                     : 1,	//    14
	gpio15_intr                     : 1,	//    15
	gpio16_intr                     : 1,	//    16
	gpio17_intr                     : 1;	//    17
} GPIO_INTERRUPT_STATUS_M14B0;

/*-----------------------------------------------------------------------------
	0x017c l2_cache_drreq_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_drreq_evnt_cnt               ;   	// 31: 0
} L2_CACHE_DRREQ_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0180 l2_cache_drhit_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_drhit_evnt_cnt               ;   	// 31: 0
} L2_CACHE_DRHIT_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0184 l2_cache_dwreq_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_dwreq_evnt_cnt               ;   	// 31: 0
} L2_CACHE_DWREQ_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0188 l2_cache_dwtreq_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_dwtreq_evnt_cnt              ;   	// 31: 0
} L2_CACHE_DWTREQ_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x018c l2_cache_dwhit_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_dwhit_evnt_cnt               ;   	// 31: 0
} L2_CACHE_DWHIT_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0190 l2_cache_irreq_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_irreq_evnt_cnt               ;   	// 31: 0
} L2_CACHE_IRREQ_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0194 l2_cache_irhit_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_irhit_evnt_cnt               ;   	// 31: 0
} L2_CACHE_IRHIT_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0198 l2_cache_wa_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_wa_evnt_cnt                  ;   	// 31: 0
} L2_CACHE_WA_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x019c l2_cache_co_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_co_evnt_cnt                  ;   	// 31: 0
} L2_CACHE_CO_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x01a4 l2_cache_event_monitor_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	evnt_en                         : 1,	//     0
	evnt_cnt_reset                  : 1;	//     1
} L2_CACHE_EVENT_MONITOR_CTRL_M14B0;

/*-----------------------------------------------------------------------------
	0x01b4 stcc1_ref_time_stamp_32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc1_ref_time_stamp_high       : 1;	//     0
} STCC1_REF_TIME_STAMP_32_M14B0;

/*-----------------------------------------------------------------------------
	0x01b8 stcc1_ref_time_stamp_31_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc1_ref_time_stamp_low        ;   	// 31: 0
} STCC1_REF_TIME_STAMP_31_0_M14B0;

/*-----------------------------------------------------------------------------
	0x01bc stcc1_real_time_stamp_32 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc1_real_time_stamp_high      : 1;	//     0
} STCC1_REAL_TIME_STAMP_32_M14B0;

/*-----------------------------------------------------------------------------
	0x01c0 stcc1_real_time_stamp_31_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	stcc1_real_time_stamp_low       ;   	// 31: 0
} STCC1_REAL_TIME_STAMP_31_0_M14B0;

/*-----------------------------------------------------------------------------
	0x01ec l2_cache_epfalloc_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_epfalloc_event_cnt           ;   	// 31: 0
} L2_CACHE_EPFALLOC_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x01f0 l2_cache_epfhit_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_epfhit_event_cnt             ;   	// 31: 0
} L2_CACHE_EPFHIT_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x01f4 l2_cache_epfrcvds0_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_epfrcvds0_event_cnt          ;   	// 31: 0
} L2_CACHE_EPFRCVDS0_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x01f8 l2_cache_epfrcvds1_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_epfrcvds1_event_cnt          ;   	// 31: 0
} L2_CACHE_EPFRCVDS1_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x01fc l2_cache_srconfs0_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_srconfs0_event_cnt           ;   	// 31: 0
} L2_CACHE_SRCONFS0_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0200 l2_cache_srconfs1_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_srconfs1_event_cnt           ;   	// 31: 0
} L2_CACHE_SRCONFS1_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0204 l2_cache_srrcvds0_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_srrcvds0_event_cnt           ;   	// 31: 0
} L2_CACHE_SRRCVDS0_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0208 l2_cache_srrcvds1_event_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_srrcvds1_event_cnt           ;   	// 31: 0
} L2_CACHE_SRRCVDS1_EVENT_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x020c l2_cache_ipfalloc_cnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	l2_ipfalloc_cnt                 ;   	// 31: 0
} L2_CACHE_IPFALLOC_CNT_M14B0;

/*-----------------------------------------------------------------------------
	0x0210 l2_cache_clock_stoped ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                :31,	//  0:30 reserved
	l2_clock_stoped                 : 1;	//    31
} L2_CACHE_CLOCK_STOPED_M14B0;

/*-----------------------------------------------------------------------------
	0x0214 ctr76 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	syncreq0                        : 1,	//     0
	syncreq1                        : 1,	//     1
	te_enable                       : 1;	//     2
} CTR76_M14B0;

/*-----------------------------------------------------------------------------
	0x0270 look_up_shadow_address_space ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	look_up_shadow_address_space    : 1;	//     0
} LOOK_UP_SHADOW_ADDRESS_SPACE_M14B0;

/*-----------------------------------------------------------------------------
	0x0280 emmc_host_control_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	itap_dly_sel                    : 6,	//  0: 5
	looped_back_clock_enable        : 1,	//     6
	                                : 1,	//     7 reserved
	itap_dly_ena                    : 1,	//     8
	itap_dly_chg_win                : 1,	//     9
	itap_tune_ctrl                  : 1,	//    10
	                                : 5,	// 11:15 reserved
	otap_dly_sel                    : 4,	// 16:19
	otap_dly_ena                    : 1;	//    20
} EMMC_HOST_CONTROL_0_M14B0;

/*-----------------------------------------------------------------------------
	0x0284 emmc_host_control_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	time_out_clk_freq               : 6,	//  0: 5
	time_out_clk_unit               : 1,	//     6
	base_clk_freq                   : 8,	//  7:14
	max_blk_length                  : 2,	// 15:16
	                                : 1,	//    17 reserved
	adma2_support                   : 1,	//    18
	high_speed_support              : 1,	//    19
	sdma_support                    : 1,	//    20
	suspres_support                 : 1,	//    21
	                                : 3,	// 22:24 reserved
	async_intr_support              : 1,	//    25
	                                : 1,	//    26 reserved
	slot_type                       : 2,	// 27:28
	sdr50_support                   : 1,	//    29
	sdr104_support                  : 1,	//    30
	ddr50_support                   : 1;	//    31
} EMMC_HOST_CONTROL_1_M14B0;

/*-----------------------------------------------------------------------------
	0x0288 emmc_host_control_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adriver_support                 : 1,	//     0
	cdriver_support                 : 1,	//     1
	ddriver_support                 : 1,	//     2
	                                : 1,	//     3 reserved
	retuning_timer_cnt              : 4,	//  4: 7
	tuning_for_sdr50                : 1,	//     8
	retuning_modes                  : 2,	//  9:10
	                                : 1,	//    11 reserved
	clock_multiplier                : 8,	// 12:19
	spi_supoprt                     : 1,	//    20
	spi_blk_mode                    : 1,	//    21
	async_wkup_ena                  : 1,	//    22
	                                : 1,	//    23 reserved
	tuning_count                    : 6;	// 24:29
} EMMC_HOST_CONTROL_2_M14B0;

/*-----------------------------------------------------------------------------
	0x028c emmc_host_control_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	initpresetval                   :13,	//  0:12
	                                : 3,	// 13:15 reserved
	dspdpresetval                   :13;	// 16:28
} EMMC_HOST_CONTROL_3_M14B0;

/*-----------------------------------------------------------------------------
	0x0290 emmc_host_control_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hspdpresetval                   :13,	//  0:12
	                                : 3,	// 13:15 reserved
	sdr12presetval                  :13;	// 16:28
} EMMC_HOST_CONTROL_4_M14B0;

/*-----------------------------------------------------------------------------
	0x0294 emmc_host_control_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sdr25presetval                  :13,	//  0:12
	                                : 3,	// 13:15 reserved
	sdr50presetval                  :13;	// 16:28
} EMMC_HOST_CONTROL_5_M14B0;

/*-----------------------------------------------------------------------------
	0x0298 emmc_host_control_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sdr104presetval                 :13,	//  0:12
	                                : 3,	// 13:15 reserved
	ddr50presetval                  :13;	// 16:28
} EMMC_HOST_CONTROL_6_M14B0;

/*-----------------------------------------------------------------------------
	0x029c emmc_host_control_7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	high_speed_preset_in_s1         :13;	//  0:12
} EMMC_HOST_CONTROL_7_M14B0;

/*-----------------------------------------------------------------------------
	0x02a0 emmc_host_control_8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sdr12_preset_in_s1              :13;	//  0:12
} EMMC_HOST_CONTROL_8_M14B0;

/*-----------------------------------------------------------------------------
	0x02a4 emmc_host_control_9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sdr25_preset_in_s1              :13;	//  0:12
} EMMC_HOST_CONTROL_9_M14B0;

/*-----------------------------------------------------------------------------
	0x02a8 sd_host_control_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	itap_dly_sel                    : 6,	//  0: 5
	looped_back_clock_enable        : 1,	//     6
	                                : 1,	//     7 reserved
	itap_dly_ena                    : 1,	//     8
	itap_dly_chg_win                : 1,	//     9
	itap_tune_ctrl                  : 1,	//    10
	                                : 5,	// 11:15 reserved
	otap_dly_sel                    : 4,	// 16:19
	otap_dly_ena                    : 1;	//    20
} SD_HOST_CONTROL_0_M14B0;

/*-----------------------------------------------------------------------------
	0x02ac sd_host_control_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	time_out_clk_freq               : 6,	//  0: 5
	time_out_clk_unit               : 1,	//     6
	base_clk_freq                   : 8,	//  7:14
	max_blk_length                  : 2,	// 15:16
	                                : 1,	//    17 reserved
	adma2_support                   : 1,	//    18
	high_speed_support              : 1,	//    19
	sdma_support                    : 1,	//    20
	suspres_support                 : 1,	//    21
	                                : 3,	// 22:24 reserved
	async_intr_support              : 1,	//    25
	                                : 1,	//    26 reserved
	slot_type                       : 2,	// 27:28
	sdr50_support                   : 1,	//    29
	sdr104_support                  : 1,	//    30
	ddr50_support                   : 1;	//    31
} SD_HOST_CONTROL_1_M14B0;

/*-----------------------------------------------------------------------------
	0x02b0 sd_host_control_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adriver_support                 : 1,	//     0
	cdriver_support                 : 1,	//     1
	ddriver_support                 : 1,	//     2
	                                : 1,	//     3 reserved
	retuning_timer_cnt              : 4,	//  4: 7
	tuning_for_sdr50                : 1,	//     8
	retuning_modes                  : 2,	//  9:10
	                                : 1,	//    11 reserved
	clock_multiplier                : 8,	// 12:19
	spi_supoprt                     : 1,	//    20
	spi_blk_mode                    : 1,	//    21
	async_wkup_ena                  : 1,	//    22
	                                : 1,	//    23 reserved
	tuning_count                    : 6;	// 24:29
} SD_HOST_CONTROL_2_M14B0;

/*-----------------------------------------------------------------------------
	0x02b4 sd_host_control_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	initpresetval                   :13,	//  0:12
	                                : 3,	// 13:15 reserved
	dspdpresetval                   :13;	// 16:28
} SD_HOST_CONTROL_3_M14B0;

/*-----------------------------------------------------------------------------
	0x02b8 sd_host_control_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hspdpresetval                   :13,	//  0:12
	                                : 3,	// 13:15 reserved
	sdr12presetval                  :13;	// 16:28
} SD_HOST_CONTROL_4_M14B0;

/*-----------------------------------------------------------------------------
	0x02bc sd_host_control_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sdr25presetval                  :13,	//  0:12
	                                : 3,	// 13:15 reserved
	sdr50presetval                  :13;	// 16:28
} SD_HOST_CONTROL_5_M14B0;

/*-----------------------------------------------------------------------------
	0x02c0 sd_host_control_6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sdr104presetval                 :13,	//  0:12
	                                : 3,	// 13:15 reserved
	ddr50presetval                  :13;	// 16:28
} SD_HOST_CONTROL_6_M14B0;

/*-----------------------------------------------------------------------------
	0x02c4 sd_host_control_7 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02c8 sd_host_control_8 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02cc sd_host_control_9 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02dc sync_reg0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sync_reg0                       ;   	// 31: 0
} SYNC_REG0_M14B0;

/*-----------------------------------------------------------------------------
	0x02e0 sync_reg1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sync_reg1                       ;   	// 31: 0
} SYNC_REG1_M14B0;

/*-----------------------------------------------------------------------------
	0x02e4 gp_reg4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gp_reg4                         ;   	// 31: 0
} GP_REG4_M14B0;

/*-----------------------------------------------------------------------------
	0x02e8 gp_reg5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gp_reg5                         ;   	// 31: 0
} GP_REG5_M14B0;

/*-----------------------------------------------------------------------------
	0x02ec gp_reg6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gp_reg6                         ;   	// 31: 0
} GP_REG6_M14B0;

/*-----------------------------------------------------------------------------
	0x02f0 gp_reg7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gp_reg7                         ;   	// 31: 0
} GP_REG7_M14B0;

/*-----------------------------------------------------------------------------
	0x02f4 gp_reg8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gp_reg8                         ;   	// 31: 0
} GP_REG8_M14B0;

/*-----------------------------------------------------------------------------
	0x02f8 gp_reg9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gp_reg9                         ;   	// 31: 0
} GP_REG9_M14B0;

/*-----------------------------------------------------------------------------
	0x02fc gp_reg10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gp_reg10                        ;   	// 31: 0
} GP_REG10_M14B0;

/*-----------------------------------------------------------------------------
	0x0300 osprey_ctrl7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwrctrli0                       : 2,	//  0: 1
	                                : 4,	//  2: 5 reserved
	pwrctrli1                       : 2;	//  6: 7
} OSPREY_CTRL7_M14B0;

/*-----------------------------------------------------------------------------
	0x0304 osprey_ctrl8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cfgfiltend                      :12,	//  0:11
	cfgfiltstart                    :12,	// 12:23
	                                : 7,	// 24:30 reserved
	cfgaddrfilten                   : 1;	//    31
} OSPREY_CTRL8_M14B0;

/*-----------------------------------------------------------------------------
	0x0308 osprey_ctrl9 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	csysreqm1vsoc                   : 1,	//     0
	                                :30,	//  1:30 reserved
	csysreqm0vsoc                   : 1;	//    31
} OSPREY_CTRL9_M14B0;

/*-----------------------------------------------------------------------------
	0x030c osprey_ctrl10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpmaxdatasize                   : 5;	//  0: 4
} OSPREY_CTRL10_M14B0;

/*-----------------------------------------------------------------------------
	0x0310 osprey_ctrl11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cihsbypass                      : 4,	//  0: 3
	                                :27,	//  4:30 reserved
	cisbypass                       : 1;	//    31
} OSPREY_CTRL11_M14B0;

/*-----------------------------------------------------------------------------
	0x0314 osprey_ctrl12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                :31,	//  0:30 reserved
	cdbgrstack                      : 1;	//    31
} OSPREY_CTRL12_M14B0;

/*-----------------------------------------------------------------------------
	0x0318 gp_reg11 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x031c gp_reg12 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0320 gp_reg13 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0324 gp_reg14 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0328 gp_reg15 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x032c gp_reg16 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0330 gp_reg17 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0334 osprey_status0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	smpnamp                         : 2,	//  0: 1
	pl310idle                       : 1,	//     2
	                                : 6,	//  3: 8 reserved
	deflags0                        : 7,	//  9:15
	deflags1                        : 7,	// 16:22
	pmusecure                       : 2,	// 23:24
	pmupriv                         : 2,	// 25:26
	ptmpwrup1                       : 1,	//    27
	ptmidleack1                     : 1,	//    28
	ptmpwrup0                       : 1,	//    29
	ptmidleack0                     : 1,	//    30
	scuevabort                      : 1;	//    31
} OSPREY_STATUS0_M14B0;

/*-----------------------------------------------------------------------------
	0x0338 osprey_status1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	datawritelat                    : 3,	//  0: 2
	datareadlat                     : 3,	//  3: 5
	datasetuplat                    : 3,	//  6: 8
	tagwritelat                     : 3,	//  9:11
	tagreadlat                      : 3,	// 12:14
	tagsetuplat                     : 3,	// 15:17
	pwrctlo0                        : 2,	// 18:19
	                                : 2,	// 20:21 reserved
	pwrctlo1                        : 2,	// 22:23
	                                : 2,	// 24:25 reserved
	standbywfi                      : 2,	// 26:27
	                                : 2,	// 28:29 reserved
	standbywfe                      : 2;	// 30:31
} OSPREY_STATUS1_M14B0;

/*-----------------------------------------------------------------------------
	0x033c osprey_status2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	csysackm1vsoc                   : 1,	//     0
	cdbgrstreq                      : 1,	//     1
	                                :18,	//  2:19 reserved
	nfiqout                         : 2,	// 20:21
	nirqout                         : 2,	// 22:23
	                                : 2,	// 24:25 reserved
	dbgnoppwrdn                     : 2,	// 26:27
	                                : 1,	//    28 reserved
	dbgcpudone                      : 2,	// 29:30
	csysackm0vsoc                   : 1;	//    31
} OSPREY_STATUS2_M14B0;

/*-----------------------------------------------------------------------------
	0x0340 osprey_status3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cpuready                        : 2,	//  0: 1
	neonready                       : 2,	//  2: 3
	                                :27,	//  4:30 reserved
	scuready                        : 1;	//    31
} OSPREY_STATUS3_M14B0;

/*-----------------------------------------------------------------------------
	0x03c4 version ''
------------------------------------------------------------------------------*/
/*	no field */

typedef struct {
	UINT32                          	gp_reg0                         ;	// 0x0000 : ''
	UINT32                          	gp_reg1                         ;	// 0x0004 : ''
	UINT32                          	gp_reg2                         ;	// 0x0008 : ''
	UINT32                          	gp_reg3                         ;	// 0x000c : ''
	CPU0_ADDR_SW_REG_0_M14B0        	cpu0_addr_sw_reg_0              ;	// 0x0010 : ''
	CPU0_ADDR_SW_REG_1_M14B0        	cpu0_addr_sw_reg_1              ;	// 0x0014 : ''
	CPU0_ADDR_SW_REG_2_M14B0        	cpu0_addr_sw_reg_2              ;	// 0x0018 : ''
	UINT32                          	                 __rsvd_00[  19];	// 0x001c ~ 0x0064
	PERI0_ADDR_SW_REG_0_M14B0       	peri0_addr_sw_reg_0             ;	// 0x0068 : ''
	PERI0_ADDR_SW_REG_1_M14B0       	peri0_addr_sw_reg_1             ;	// 0x006c : ''
	PERI0_ADDR_SW_REG_2_M14B0       	peri0_addr_sw_reg_2             ;	// 0x0070 : ''
	UINT32                          	                 __rsvd_01[  45];	// 0x0074 ~ 0x0124
	IO_CTRL_M14B0                   	io_ctrl                         ;	// 0x0128 : ''
	UINT32                          	                 __rsvd_02[   7];	// 0x012c ~ 0x0144
	STCC0_REF_TIME_STAMP_32_M14B0   	stcc0_ref_time_stamp_32         ;	// 0x0148 : ''
	STCC0_REF_TIME_STAMP_31_0_M14B0 	stcc0_ref_time_stamp_31_0       ;	// 0x014c : ''
	STCC0_REAL_TIME_STAMP_32_M14B0  	stcc0_real_time_stamp_32        ;	// 0x0150 : ''
	STCC0_REAL_TIME_STAMP_31_0_M14B0	stcc0_real_time_stamp_31_0      ;	// 0x0154 : ''
	FLUSH_DONE_STATUS_M14B0         	flush_done_status               ;	// 0x0158 : ''
	FLUSH_REQ_M14B0                 	flush_req                       ;	// 0x015c : ''
	UINT32                          	                 __rsvd_03[   3];	// 0x0160 ~ 0x0168
	BANDWIDTH_LIMITER_CPU_AXI0_DLY_CNT_M14B0	bandwidth_limiter_cpu_axi0_dly_cnt;	// 0x016c : ''
	BANDWIDTH_LIMITER_CPU_AXI1_DLY_CNT_M14B0	bandwidth_limiter_cpu_axi1_dly_cnt;	// 0x0170 : ''
	GPIO_INTERRUPT_STATUS_M14B0     	gpio_interrupt_status           ;	// 0x0174 : ''
	UINT32                          	                 __rsvd_04[   1];	// 0x0178
	L2_CACHE_DRREQ_EVENT_CNT_M14B0  	l2_cache_drreq_event_cnt        ;	// 0x017c : ''
	L2_CACHE_DRHIT_EVENT_CNT_M14B0  	l2_cache_drhit_event_cnt        ;	// 0x0180 : ''
	L2_CACHE_DWREQ_EVENT_CNT_M14B0  	l2_cache_dwreq_event_cnt        ;	// 0x0184 : ''
	L2_CACHE_DWTREQ_EVENT_CNT_M14B0 	l2_cache_dwtreq_event_cnt       ;	// 0x0188 : ''
	L2_CACHE_DWHIT_EVENT_CNT_M14B0  	l2_cache_dwhit_event_cnt        ;	// 0x018c : ''
	L2_CACHE_IRREQ_EVENT_CNT_M14B0  	l2_cache_irreq_event_cnt        ;	// 0x0190 : ''
	L2_CACHE_IRHIT_EVENT_CNT_M14B0  	l2_cache_irhit_event_cnt        ;	// 0x0194 : ''
	L2_CACHE_WA_EVENT_CNT_M14B0     	l2_cache_wa_event_cnt           ;	// 0x0198 : ''
	L2_CACHE_CO_EVENT_CNT_M14B0     	l2_cache_co_event_cnt           ;	// 0x019c : ''
	UINT32                          	                 __rsvd_05[   1];	// 0x01a0
	L2_CACHE_EVENT_MONITOR_CTRL_M14B0	l2_cache_event_monitor_ctrl     ;	// 0x01a4 : ''
	UINT32                          	                 __rsvd_06[   3];	// 0x01a8 ~ 0x01b0
	STCC1_REF_TIME_STAMP_32_M14B0   	stcc1_ref_time_stamp_32         ;	// 0x01b4 : ''
	STCC1_REF_TIME_STAMP_31_0_M14B0 	stcc1_ref_time_stamp_31_0       ;	// 0x01b8 : ''
	STCC1_REAL_TIME_STAMP_32_M14B0  	stcc1_real_time_stamp_32        ;	// 0x01bc : ''
	STCC1_REAL_TIME_STAMP_31_0_M14B0	stcc1_real_time_stamp_31_0      ;	// 0x01c0 : ''
	UINT32                          	                 __rsvd_07[  10];	// 0x01c4 ~ 0x01e8
	L2_CACHE_EPFALLOC_EVENT_CNT_M14B0	l2_cache_epfalloc_event_cnt     ;	// 0x01ec : ''
	L2_CACHE_EPFHIT_EVENT_CNT_M14B0 	l2_cache_epfhit_event_cnt       ;	// 0x01f0 : ''
	L2_CACHE_EPFRCVDS0_EVENT_CNT_M14B0	l2_cache_epfrcvds0_event_cnt    ;	// 0x01f4 : ''
	L2_CACHE_EPFRCVDS1_EVENT_CNT_M14B0	l2_cache_epfrcvds1_event_cnt    ;	// 0x01f8 : ''
	L2_CACHE_SRCONFS0_EVENT_CNT_M14B0	l2_cache_srconfs0_event_cnt     ;	// 0x01fc : ''
	L2_CACHE_SRCONFS1_EVENT_CNT_M14B0	l2_cache_srconfs1_event_cnt     ;	// 0x0200 : ''
	L2_CACHE_SRRCVDS0_EVENT_CNT_M14B0	l2_cache_srrcvds0_event_cnt     ;	// 0x0204 : ''
	L2_CACHE_SRRCVDS1_EVENT_CNT_M14B0	l2_cache_srrcvds1_event_cnt     ;	// 0x0208 : ''
	L2_CACHE_IPFALLOC_CNT_M14B0     	l2_cache_ipfalloc_cnt           ;	// 0x020c : ''
	L2_CACHE_CLOCK_STOPED_M14B0     	l2_cache_clock_stoped           ;	// 0x0210 : ''
	CTR76_M14B0                     	ctr76                           ;	// 0x0214 : ''
	UINT32                          	                 __rsvd_08[  22];	// 0x0218 ~ 0x026c
	LOOK_UP_SHADOW_ADDRESS_SPACE_M14B0	look_up_shadow_address_space    ;	// 0x0270 : ''
	UINT32                          	                 __rsvd_09[   3];	// 0x0274 ~ 0x027c
	EMMC_HOST_CONTROL_0_M14B0       	emmc_host_control_0             ;	// 0x0280 : ''
	EMMC_HOST_CONTROL_1_M14B0       	emmc_host_control_1             ;	// 0x0284 : ''
	EMMC_HOST_CONTROL_2_M14B0       	emmc_host_control_2             ;	// 0x0288 : ''
	EMMC_HOST_CONTROL_3_M14B0       	emmc_host_control_3             ;	// 0x028c : ''
	EMMC_HOST_CONTROL_4_M14B0       	emmc_host_control_4             ;	// 0x0290 : ''
	EMMC_HOST_CONTROL_5_M14B0       	emmc_host_control_5             ;	// 0x0294 : ''
	EMMC_HOST_CONTROL_6_M14B0       	emmc_host_control_6             ;	// 0x0298 : ''
	EMMC_HOST_CONTROL_7_M14B0       	emmc_host_control_7             ;	// 0x029c : ''
	EMMC_HOST_CONTROL_8_M14B0       	emmc_host_control_8             ;	// 0x02a0 : ''
	EMMC_HOST_CONTROL_9_M14B0       	emmc_host_control_9             ;	// 0x02a4 : ''
	SD_HOST_CONTROL_0_M14B0         	sd_host_control_0               ;	// 0x02a8 : ''
	SD_HOST_CONTROL_1_M14B0         	sd_host_control_1               ;	// 0x02ac : ''
	SD_HOST_CONTROL_2_M14B0         	sd_host_control_2               ;	// 0x02b0 : ''
	SD_HOST_CONTROL_3_M14B0         	sd_host_control_3               ;	// 0x02b4 : ''
	SD_HOST_CONTROL_4_M14B0         	sd_host_control_4               ;	// 0x02b8 : ''
	SD_HOST_CONTROL_5_M14B0         	sd_host_control_5               ;	// 0x02bc : ''
	SD_HOST_CONTROL_6_M14B0         	sd_host_control_6               ;	// 0x02c0 : ''
	UINT32                          	sd_host_control_7               ;	// 0x02c4 : ''
	UINT32                          	sd_host_control_8               ;	// 0x02c8 : ''
	UINT32                          	sd_host_control_9               ;	// 0x02cc : ''
	UINT32                          	                 __rsvd_10[   3];	// 0x02d0 ~ 0x02d8
	SYNC_REG0_M14B0                 	sync_reg0                       ;	// 0x02dc : ''
	SYNC_REG1_M14B0                 	sync_reg1                       ;	// 0x02e0 : ''
	GP_REG4_M14B0                   	gp_reg4                         ;	// 0x02e4 : ''
	GP_REG5_M14B0                   	gp_reg5                         ;	// 0x02e8 : ''
	GP_REG6_M14B0                   	gp_reg6                         ;	// 0x02ec : ''
	GP_REG7_M14B0                   	gp_reg7                         ;	// 0x02f0 : ''
	GP_REG8_M14B0                   	gp_reg8                         ;	// 0x02f4 : ''
	GP_REG9_M14B0                   	gp_reg9                         ;	// 0x02f8 : ''
	GP_REG10_M14B0                  	gp_reg10                        ;	// 0x02fc : ''
	OSPREY_CTRL7_M14B0              	osprey_ctrl7                    ;	// 0x0300 : ''
	OSPREY_CTRL8_M14B0              	osprey_ctrl8                    ;	// 0x0304 : ''
	OSPREY_CTRL9_M14B0              	osprey_ctrl9                    ;	// 0x0308 : ''
	OSPREY_CTRL10_M14B0             	osprey_ctrl10                   ;	// 0x030c : ''
	OSPREY_CTRL11_M14B0             	osprey_ctrl11                   ;	// 0x0310 : ''
	OSPREY_CTRL12_M14B0             	osprey_ctrl12                   ;	// 0x0314 : ''
	UINT32                          	gp_reg11                        ;	// 0x0318 : ''
	UINT32                          	gp_reg12                        ;	// 0x031c : ''
	UINT32                          	gp_reg13                        ;	// 0x0320 : ''
	UINT32                          	gp_reg14                        ;	// 0x0324 : ''
	UINT32                          	gp_reg15                        ;	// 0x0328 : ''
	UINT32                          	gp_reg16                        ;	// 0x032c : ''
	UINT32                          	gp_reg17                        ;	// 0x0330 : ''
	OSPREY_STATUS0_M14B0            	osprey_status0                  ;	// 0x0334 : ''
	OSPREY_STATUS1_M14B0            	osprey_status1                  ;	// 0x0338 : ''
	OSPREY_STATUS2_M14B0            	osprey_status2                  ;	// 0x033c : ''
	OSPREY_STATUS3_M14B0            	osprey_status3                  ;	// 0x0340 : ''
	UINT32                          	                 __rsvd_11[  32];	// 0x0344 ~ 0x03c0
	UINT32                          	version                         ;	// 0x03c4 : ''
} CPU_TOP_REG_M14B0_T;
/* 93 regs, 93 types */

/* 93 regs, 93 types in Total*/

#ifdef __cplusplus
}
#endif


#endif	/* __CPU_TOP_REG_M14B0_H__ */

