/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2013 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
	GNU General Public License for more details.
*/



/** @file
 *
 *  ADEC register details. (used only within kdriver)
 *
 *  author     Jong-Sang Oh(jongsang.oh@lge.com)
 *  version    3.2.0
 *  date       2014.07.23
 *
 */

#ifndef _AUD_REG_H15_A0_H_
#define _AUD_REG_H15_A0_H_

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/


#ifdef __cplusplus
extern "C" {
#endif

/*-----------------------------------------------------------------------------
	0x0000 ram_reserved ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0200 aud_int0_id ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0204 aud_int0_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_int0_clr                    : 1;	//     0
} AUD_H15_A0_INT0_CLR;

/*-----------------------------------------------------------------------------
	0x0208 aud_int0_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_int0_en                     : 1;	//     0
} AUD_H15_A0_INT0_EN;

/*-----------------------------------------------------------------------------
	0x020c aud_int1_id ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0210 aud_int1_clr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_int1_clr                    : 1;	//     0
} AUD_H15_A0_INT1_CLR;

/*-----------------------------------------------------------------------------
	0x0214 aud_int1_en ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_int1_en                     : 1;	//     0
} AUD_H15_A0_INT1_EN;

/*-----------------------------------------------------------------------------
	0x0218 aud_runstall0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_runstall0                   : 1;	//     0
} AUD_H15_A0_RUNSTALL0;

/*-----------------------------------------------------------------------------
	0x021c aud_runstall1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_runstall1                   : 1;	//     0
} AUD_H15_A0_RUNSTALL1;

/*-----------------------------------------------------------------------------
	0x0220 aud_statvecsel0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_statvecsel0                 : 1;	//     0
} AUD_H15_A0_STATVECSEL0;

/*-----------------------------------------------------------------------------
	0x0224 aud_statvecsel1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_statvecsel1                 : 1;	//     0
} AUD_H15_A0_STATVECSEL1;

/*-----------------------------------------------------------------------------
	0x0228 aud_pwaitmode0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_pwaitmode0                  : 1;	//     0
} AUD_H15_A0_PWAITMODE0;

/*-----------------------------------------------------------------------------
	0x022c aud_pwaitmode1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_pwaitmode1                  : 1;	//     0
} AUD_H15_A0_PWAITMODE1;

/*-----------------------------------------------------------------------------
	0x0230 aud_dsp0prid ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0234 aud_dsp1prid ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0238 aud_swreset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
		aresetout						: 1,	//	   0
		apbresetout 					: 1,	//	   1
		aversetout						: 1,	//	   2
		veresetout						: 1,	//	   3
		fs20resetout					: 1,	//	   4
		fs21resetout					: 1,	//	   5
		fs23resetout                    : 1,	//     6
		fs24resetout                    : 1,	//     7
		fs25resetout                    : 1,	//     8
		asrcrstout						: 1,	//	   9
		dsp0ocdresetout 				: 1,	//	  10
		dsp1ocdresetout 				: 1,	//	  11
		dsp0bresetout					: 1,	//	  12
		dsp1bresetout					: 1,	//	  13
		aadresetout 					: 1,	//	  14
		aadapbresetout					: 1,	//	  15
		uartresetout                    : 1;	//    16
} AUD_H15_A0_SWRESET;

/*-----------------------------------------------------------------------------
	0x023c aud_mon_sel ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0240 aud_dirq0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_dirq0                       : 1;	//     0
} AUD_H15_A0_DIRQ0;

/*-----------------------------------------------------------------------------
	0x0244 aud_dirq1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_dirq1                       : 1;	//     0
} AUD_H15_A0_DIRQ1;

/*-----------------------------------------------------------------------------
	0x0248 aud_debugen0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_debugen0                    : 1;	//     0
} AUD_H15_A0_DEBUGEN0;

/*-----------------------------------------------------------------------------
	0x024c aud_debugen1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_debugen1                    : 1;	//     0
} AUD_H15_A0_DEBUGEN1;

/*-----------------------------------------------------------------------------
	0x0250 aud_nmiint0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_nmiint0                     : 1;	//     0
} AUD_H15_A0_NMIINT0;

/*-----------------------------------------------------------------------------
	0x0254 aud_mmiint1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_mmiint1                     : 1;	//     0
} AUD_H15_A0_MMIINT1;

/*-----------------------------------------------------------------------------
	0x0258 aud_xocdmode0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_xocdmode0                   : 1;	//     0
} AUD_H15_A0_XOCDMODE0;

/*-----------------------------------------------------------------------------
	0x025c aud_xocdmode1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_xocdmode1                   : 1;	//     0
} AUD_H15_A0_XOCDMODE1;

/*-----------------------------------------------------------------------------
	0x0260 aud_debugdata0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0264 aud_debugdata1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0268 aud_debugpc0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x026c aud_debugpc1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0270 aud_debugstat0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0274 aud_debugstat1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0278 aud_gstcc0hreg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_gstcc0hreg                  : 1;	//     0
} AUD_H15_A0_GSTCC0HREG;

/*-----------------------------------------------------------------------------
	0x027c aud_gstcc0lreg ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0280 aud_dsp0offset0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0284 aud_dsp0offset1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0288 aud_dsp0offset2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x028c aud_dsp0offset3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0290 aud_dsp0offset4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0294 aud_dsp0offset5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0298 aud_dsp0offset6 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x029c aud_dsp0offset7 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02a0 aud_dsp1offset0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02a4 aud_dsp1offset1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02a8 aud_dsp1offset2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02ac aud_dsp1offset3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02b0 aud_dsp1offset4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02b4 aud_dsp1offset5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02b8 aud_dsp1offset6 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02bc aud_dsp1offset7 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02c0 memtab0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02c4 memtab1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02c8 memtab2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02cc memtab3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02d0 memtab4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02d4 memtab5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02d8 aud_dsp0offset61 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02dc aud_dsp1offset61 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02e0 aud_gstcc1hreg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_gstcc1hreg                  : 1;	//     0
} AUD_H15_A0_GSTCC1HREG;

/*-----------------------------------------------------------------------------
	0x02e4 aud_gstcc1lreg ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02e8 aud_uarttxstaus ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	uarttx_data                     : 8,	//  0: 7
	uarttx_status                   : 1,	//     8
	uarttx_enablle                  : 1;	//     9
} AUD_H15_A0_UARTTXSTAUS;

/*-----------------------------------------------------------------------------
	0x02ec hostsct0bypasscmda ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sct0_bypass                     : 5;	//  0: 4
} HOSTSCT0BYPASSCMDA;

/*-----------------------------------------------------------------------------
	0x02f0 hostsct1bypasscmda ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sct1_bypass                     : 5;	//  0: 4
} HOSTSCT1BYPASSCMDA;

/*-----------------------------------------------------------------------------
	0x02f4 hostmainbypasscmda ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	main_bypass                     : 5;	//  0: 4
} HOSTMAINBYPASSCMDA;

/*-----------------------------------------------------------------------------
	0x0300 aud_mem_share_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0304 aud_mem_dsp0_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0308 aud_mem_dsp1_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x030c aud_mem_ipc_a2p_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0310 aud_mem_ipc_a2p_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0314 aud_mem_ipc_p2a_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0318 aud_mem_ipc_p2a_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x031c aud_mem_ipc_a2d_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0320 aud_mem_ipc_a2d_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0324 aud_mem_ipc_d2a_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0328 aud_mem_ipc_d2a_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x032c aud_mem_ipc_d2p_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0330 aud_mem_ipc_d2p_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0334 aud_mem_ipc_p2d_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0338 aud_mem_ipc_p2d_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x033c aud_mem_ipc_dbgp_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0340 aud_mem_ipc_dbgp_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0344 aud_mem_ipc_dbgd_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0348 aud_mem_ipc_dbgd_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x034c aud_mem_se_param_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0350 aud_mem_se_param_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0370 aud_ipc_a2p_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0374 aud_ipc_a2p_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0378 aud_ipc_p2a_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x037c aud_ipc_p2a_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0380 aud_ipc_a2d_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0384 aud_ipc_a2d_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0388 aud_ipc_d2a_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x038c aud_ipc_d2a_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0390 aud_ipc_d2p_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0394 aud_ipc_d2p_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0398 aud_ipc_p2d_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x039c aud_ipc_p2d_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x03a0 aud_ipc_dbgp_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x03a4 aud_ipc_dbgp_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x03a8 aud_ipc_dbgd_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x03ac aud_ipc_dbgd_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x03c0 aud_buf_mpb0_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB0_WO;

/*-----------------------------------------------------------------------------
	0x03c4 aud_buf_mpb0_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB0_RO;

/*-----------------------------------------------------------------------------
	0x03c8 aud_buf_mpb0_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB0_WI;

/*-----------------------------------------------------------------------------
	0x03cc aud_buf_mpb0_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB0_RI;

/*-----------------------------------------------------------------------------
	0x03d0 aud_buf_mpb1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB1_WO;

/*-----------------------------------------------------------------------------
	0x03d4 aud_buf_mpb1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB1_RO;

/*-----------------------------------------------------------------------------
	0x03d8 aud_buf_mpb1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB1_WI;

/*-----------------------------------------------------------------------------
	0x03dc aud_buf_mpb1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB1_RI;

/*-----------------------------------------------------------------------------
	0x03e0 aud_buf_mpb2_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB2_WO;

/*-----------------------------------------------------------------------------
	0x03e4 aud_buf_mpb2_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB2_RO;

/*-----------------------------------------------------------------------------
	0x03e8 aud_buf_mpb2_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB2_WI;

/*-----------------------------------------------------------------------------
	0x03ec aud_buf_mpb2_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB2_RI;

/*-----------------------------------------------------------------------------
	0x03f0 aud_buf_mpb3_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB3_WO;

/*-----------------------------------------------------------------------------
	0x03f4 aud_buf_mpb3_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB3_RO;

/*-----------------------------------------------------------------------------
	0x03f8 aud_buf_mpb3_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB3_WI;

/*-----------------------------------------------------------------------------
	0x03fc aud_buf_mpb3_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB3_RI;

/*-----------------------------------------------------------------------------
	0x0400 aud_buf_mpb4_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB4_WO;

/*-----------------------------------------------------------------------------
	0x0404 aud_buf_mpb4_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB4_RO;

/*-----------------------------------------------------------------------------
	0x0408 aud_buf_mpb4_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB4_WI;

/*-----------------------------------------------------------------------------
	0x040c aud_buf_mpb4_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB4_RI;

/*-----------------------------------------------------------------------------
	0x0410 aud_buf_mpb5_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB5_WO;

/*-----------------------------------------------------------------------------
	0x0414 aud_buf_mpb5_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB5_RO;

/*-----------------------------------------------------------------------------
	0x0418 aud_buf_mpb5_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB5_WI;

/*-----------------------------------------------------------------------------
	0x041c aud_buf_mpb5_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB5_RI;

/*-----------------------------------------------------------------------------
	0x0420 aud_buf_mpb6_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB6_WO;

/*-----------------------------------------------------------------------------
	0x0424 aud_buf_mpb6_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB6_RO;

/*-----------------------------------------------------------------------------
	0x0428 aud_buf_mpb6_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB6_WI;

/*-----------------------------------------------------------------------------
	0x042c aud_buf_mpb6_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB6_RI;

/*-----------------------------------------------------------------------------
	0x0430 aud_buf_mpb7_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB7_WO;

/*-----------------------------------------------------------------------------
	0x0434 aud_buf_mpb7_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB7_RO;

/*-----------------------------------------------------------------------------
	0x0438 aud_buf_mpb7_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB7_WI;

/*-----------------------------------------------------------------------------
	0x043c aud_buf_mpb7_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_MPB7_RI;

/*-----------------------------------------------------------------------------
	0x0440 aud_buf_cpb0_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_CPB0_WO;

/*-----------------------------------------------------------------------------
	0x0444 aud_buf_cpb0_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_CPB0_RO;

/*-----------------------------------------------------------------------------
	0x0448 aud_buf_cpb0_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_CPB0_WI;

/*-----------------------------------------------------------------------------
	0x044c aud_buf_cpb0_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_CPB0_RI;

/*-----------------------------------------------------------------------------
	0x0450 aud_buf_cpb1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_CPB1_WO;

/*-----------------------------------------------------------------------------
	0x0454 aud_buf_cpb1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_CPB1_RO;

/*-----------------------------------------------------------------------------
	0x0458 aud_buf_cpb1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_CPB1_WI;

/*-----------------------------------------------------------------------------
	0x045c aud_buf_cpb1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_CPB1_RI;

/*-----------------------------------------------------------------------------
	0x0460 aud_buf_dpb0_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DPB0_WO;

/*-----------------------------------------------------------------------------
	0x0464 aud_buf_dpb0_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DPB0_RO;

/*-----------------------------------------------------------------------------
	0x0468 aud_buf_dpb0_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DPB0_WI;

/*-----------------------------------------------------------------------------
	0x046c aud_buf_dpb0_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DPB0_RI;

/*-----------------------------------------------------------------------------
	0x0470 aud_buf_dpb1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DPB1_WO;

/*-----------------------------------------------------------------------------
	0x0474 aud_buf_dpb1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DPB1_RO;

/*-----------------------------------------------------------------------------
	0x0478 aud_buf_dpb1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DPB1_WI;

/*-----------------------------------------------------------------------------
	0x047c aud_buf_dpb1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DPB1_RI;

/*-----------------------------------------------------------------------------
	0x0480 aud_buf_iec_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_IEC_WO;

/*-----------------------------------------------------------------------------
	0x0484 aud_buf_iec_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_IEC_RO;

/*-----------------------------------------------------------------------------
	0x0488 aud_buf_iec_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_IEC_WI;

/*-----------------------------------------------------------------------------
	0x048c aud_buf_iec_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_IEC_RI;

/*-----------------------------------------------------------------------------
	0x0490 aud_buf_dec_sink0_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DEC_SINK0_WO;

/*-----------------------------------------------------------------------------
	0x0494 aud_buf_dec_sink0_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DEC_SINK0_RO;

/*-----------------------------------------------------------------------------
	0x0498 aud_buf_dec_sink0_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DEC_SINK0_WI;

/*-----------------------------------------------------------------------------
	0x049c aud_buf_dec_sink0_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DEC_SINK0_RI;

/*-----------------------------------------------------------------------------
	0x04a0 aud_buf_dec_sink1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DEC_SINK1_WO;

/*-----------------------------------------------------------------------------
	0x04a4 aud_buf_dec_sink1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DEC_SINK1_RO;

/*-----------------------------------------------------------------------------
	0x04a8 aud_buf_dec_sink1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DEC_SINK1_WI;

/*-----------------------------------------------------------------------------
	0x04ac aud_buf_dec_sink1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_DEC_SINK1_RI;

/*-----------------------------------------------------------------------------
	0x04b0 aud_buf_sys_sink0_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_SYS_SINK0_WO;

/*-----------------------------------------------------------------------------
	0x04b4 aud_buf_sys_sink0_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_SYS_SINK0_RO;

/*-----------------------------------------------------------------------------
	0x04b8 aud_buf_sys_sink0_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_SYS_SINK0_WI;

/*-----------------------------------------------------------------------------
	0x04bc aud_buf_sys_sink0_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_SYS_SINK0_RI;

/*-----------------------------------------------------------------------------
	0x04c0 aud_buf_sys_sink1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_SYS_SINK1_WO;

/*-----------------------------------------------------------------------------
	0x04c4 aud_buf_sys_sink1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_SYS_SINK1_RO;

/*-----------------------------------------------------------------------------
	0x04c8 aud_buf_sys_sink1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_SYS_SINK1_WI;

/*-----------------------------------------------------------------------------
	0x04cc aud_buf_sys_sink1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_SYS_SINK1_RI;

/*-----------------------------------------------------------------------------
	0x04d0 aud_buf_reverse_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_REVERSE_WO;

/*-----------------------------------------------------------------------------
	0x04d4 aud_buf_reverse_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_REVERSE_RO;

/*-----------------------------------------------------------------------------
	0x04d8 aud_buf_reverse_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_REVERSE_WI;

/*-----------------------------------------------------------------------------
	0x04dc aud_buf_reverse_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_REVERSE_RI;

/*-----------------------------------------------------------------------------
	0x04e0 aud_buf_iec1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_IEC1_WO;

/*-----------------------------------------------------------------------------
	0x04e4 aud_buf_iec1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_IEC1_RO;

/*-----------------------------------------------------------------------------
	0x04e8 aud_buf_iec1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_IEC1_WI;

/*-----------------------------------------------------------------------------
	0x04ec aud_buf_iec1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_H15_A0_BUF_IEC1_RI;

/*-----------------------------------------------------------------------------
	0x066c aud_debug_dec_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0670 aud_mute_info_outctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spk_out                         : 1,	//     0
	hp_out                          : 1,	//     1
	scart_out                       : 1,	//     2
	spdif_pcm_out                   : 1,	//     3
	spdif_es_out                    : 1;	//     4
} AUD_H15_A0_MUTE_INFO_OUTCTRL;

/*-----------------------------------------------------------------------------
	0x0674 aud_presented_pts_lip0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0678 aud_presented_pts_lip1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x067c aud_tpm_bufsize ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	free_size                       :16,	//  0:15
	max_size                        :16;	// 16:31
} AUD_H15_A0_TPM_BUFSIZE;

/*-----------------------------------------------------------------------------
	0x0680 aud_tpa_bufsize ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	free_size                       :16,	//  0:15
	max_size                        :16;	// 16:31
} AUD_H15_A0_TPA_BUFSIZE;

/*-----------------------------------------------------------------------------
	0x0684 aud_adc_in_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0688 aud_adc_in_gstc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x068c aud_aad_in_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0690 aud_aad_in_gstc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0694 aud_hdmi0_in_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0698 aud_hdmi0_in_gstc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x069c aud_hdmi1_in_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06a0 aud_hdmi1_in_gstc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06a4 aud_dbg_dsp0_reset ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06a8 aud_dbg_dsp1_reset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dsp_reset_count                 :16,	//  0:15
	clock_reset_count               : 8,	// 16:23
	mclk_reset_count                : 8;	// 24:31
} AUD_H15_A0_DBG_DSP1_RESET;

/*-----------------------------------------------------------------------------
	0x06ac aud_dsp0_gstc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06b0 aud_dsp1_gstc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06b8 aud_levelmo_l ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06bc aud_levelmo_r ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06c0 aud_dec0_cbt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06c4 aud_dec0_sbt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06c8 aud_dec1_cbt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06cc aud_dec1_sbt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06d0 aud_basepts ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06d4 aud_basestc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06d8 aud_hdmi0_fmt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06dc aud_hdmi0_pcpd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc                              :16,	//  0:15
	pd                              :16;	// 16:31
} AUD_H15_A0_HDMI0_PCPD;

/*-----------------------------------------------------------------------------
	0x06e0 aud_hdmi1_fmt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06e4 aud_hdmi1_pcpd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc                              :16,	//  0:15
	pd                              :16;	// 16:31
} AUD_H15_A0_HDMI1_PCPD;

/*-----------------------------------------------------------------------------
	0x06e8 aud_ver_chip ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06ec aud_dbg_print_mask ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06f0 aud_ver_dsp0_common ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext                             : 4,	//  0: 3
	flag                            : 8,	//  4:11
	fix                             : 8,	// 12:19
	minor                           : 8,	// 20:27
	major                           : 4;	// 28:31
} AUD_H15_A0_VER_DSP0_COMMON;

/*-----------------------------------------------------------------------------
	0x06f4 aud_ver_dsp1_common ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext                             : 4,	//  0: 3
	flag                            : 8,	//  4:11
	fix                             : 8,	// 12:19
	minor                           : 8,	// 20:27
	major                           : 4;	// 28:31
} AUD_H15_A0_VER_DSP1_COMMON;

/*-----------------------------------------------------------------------------
	0x06f8 aud_ver_dsp0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext                             : 4,	//  0: 3
	flag                            : 8,	//  4:11
	fix                             : 8,	// 12:19
	minor                           : 8,	// 20:27
	major                           : 4;	// 28:31
} AUD_H15_A0_VER_DSP0;

/*-----------------------------------------------------------------------------
	0x06fc aud_ver_dsp1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ext                             : 4,	//  0: 3
	flag                            : 8,	//  4:11
	fix                             : 8,	// 12:19
	minor                           : 8,	// 20:27
	major                           : 4;	// 28:31
} AUD_H15_A0_VER_DSP1;

typedef struct {
	UINT32                          	ram_reserved                    ;	// 0x0000 : ''
	UINT32                          	                 __rsvd_00[ 127];	// 0x0004 ~ 0x01fc
	UINT32                          	aud_int0_id                     ;	// 0x0200 : ''
	AUD_H15_A0_INT0_CLR                 aud_int0_clr                    ;	// 0x0204 : ''
	AUD_H15_A0_INT0_EN                  aud_int0_en                     ;	// 0x0208 : ''
	UINT32                          	aud_int1_id                     ;	// 0x020c : ''
	AUD_H15_A0_INT1_CLR                 aud_int1_clr                    ;	// 0x0210 : ''
	AUD_H15_A0_INT1_EN                  aud_int1_en                     ;	// 0x0214 : ''
	AUD_H15_A0_RUNSTALL0                aud_runstall0                   ;	// 0x0218 : ''
	AUD_H15_A0_RUNSTALL1                aud_runstall1                   ;	// 0x021c : ''
	AUD_H15_A0_STATVECSEL0              aud_statvecsel0                 ;	// 0x0220 : ''
	AUD_H15_A0_STATVECSEL1              aud_statvecsel1                 ;	// 0x0224 : ''
	AUD_H15_A0_PWAITMODE0               aud_pwaitmode0                  ;	// 0x0228 : ''
	AUD_H15_A0_PWAITMODE1               aud_pwaitmode1                  ;	// 0x022c : ''
	UINT32                          	aud_dsp0prid                    ;	// 0x0230 : ''
	UINT32                          	aud_dsp1prid                    ;	// 0x0234 : ''
	AUD_H15_A0_SWRESET                  aud_swreset                     ;	// 0x0238 : ''
	UINT32                          	aud_mon_sel                     ;	// 0x023c : ''
	AUD_H15_A0_DIRQ0                    aud_dirq0                       ;	// 0x0240 : ''
	AUD_H15_A0_DIRQ1                    aud_dirq1                       ;	// 0x0244 : ''
	AUD_H15_A0_DEBUGEN0                 aud_debugen0                    ;	// 0x0248 : ''
	AUD_H15_A0_DEBUGEN1                 aud_debugen1                    ;	// 0x024c : ''
	AUD_H15_A0_NMIINT0                  aud_nmiint0                     ;	// 0x0250 : ''
	AUD_H15_A0_MMIINT1                  aud_mmiint1                     ;	// 0x0254 : ''
	AUD_H15_A0_XOCDMODE0                aud_xocdmode0                   ;	// 0x0258 : ''
	AUD_H15_A0_XOCDMODE1                aud_xocdmode1                   ;	// 0x025c : ''
	UINT32                          	aud_debugdata0                  ;	// 0x0260 : ''
	UINT32                          	aud_debugdata1                  ;	// 0x0264 : ''
	UINT32                          	aud_debugpc0                    ;	// 0x0268 : ''
	UINT32                          	aud_debugpc1                    ;	// 0x026c : ''
	UINT32                          	aud_debugstat0                  ;	// 0x0270 : ''
	UINT32                          	aud_debugstat1                  ;	// 0x0274 : ''
	AUD_H15_A0_GSTCC0HREG               aud_gstcc0hreg                  ;	// 0x0278 : ''
	UINT32                          	aud_gstcc0lreg                  ;	// 0x027c : ''
	UINT32                          	aud_dsp0offset0                 ;	// 0x0280 : ''
	UINT32                          	aud_dsp0offset1                 ;	// 0x0284 : ''
	UINT32                          	aud_dsp0offset2                 ;	// 0x0288 : ''
	UINT32                          	aud_dsp0offset3                 ;	// 0x028c : ''
	UINT32                          	aud_dsp0offset4                 ;	// 0x0290 : ''
	UINT32                          	aud_dsp0offset5                 ;	// 0x0294 : ''
	UINT32                          	aud_dsp0offset6                 ;	// 0x0298 : ''
	UINT32                          	aud_dsp0offset7                 ;	// 0x029c : ''
	UINT32                          	aud_dsp1offset0                 ;	// 0x02a0 : ''
	UINT32                          	aud_dsp1offset1                 ;	// 0x02a4 : ''
	UINT32                          	aud_dsp1offset2                 ;	// 0x02a8 : ''
	UINT32                          	aud_dsp1offset3                 ;	// 0x02ac : ''
	UINT32                          	aud_dsp1offset4                 ;	// 0x02b0 : ''
	UINT32                          	aud_dsp1offset5                 ;	// 0x02b4 : ''
	UINT32                          	aud_dsp1offset6                 ;	// 0x02b8 : ''
	UINT32                          	aud_dsp1offset7                 ;	// 0x02bc : ''
	UINT32                          	memtab0                         ;	// 0x02c0 : ''
	UINT32                          	memtab1                         ;	// 0x02c4 : ''
	UINT32                          	memtab2                         ;	// 0x02c8 : ''
	UINT32                          	memtab3                         ;	// 0x02cc : ''
	UINT32                          	memtab4                         ;	// 0x02d0 : ''
	UINT32                          	memtab5                         ;	// 0x02d4 : ''
	UINT32                          	aud_dsp0offset61                ;	// 0x02d8 : ''
	UINT32                          	aud_dsp1offset61                ;	// 0x02dc : ''
	AUD_H15_A0_GSTCC1HREG               aud_gstcc1hreg                  ;	// 0x02e0 : ''
	UINT32                          	aud_gstcc1lreg                  ;	// 0x02e4 : ''
	AUD_H15_A0_UARTTXSTAUS              aud_uarttxstaus                 ;	// 0x02e8 : ''
	HOSTSCT0BYPASSCMDA              	hostsct0bypasscmda              ;	// 0x02ec : ''
	HOSTSCT1BYPASSCMDA              	hostsct1bypasscmda              ;	// 0x02f0 : ''
	HOSTMAINBYPASSCMDA              	hostmainbypasscmda              ;	// 0x02f4 : ''
	UINT32                          	                 __rsvd_01[   2];	// 0x02f8 ~ 0x02fc
	UINT32                          	aud_mem_share_base              ;	// 0x0300 : ''
	UINT32                          	aud_mem_dsp0_base               ;	// 0x0304 : ''
	UINT32                          	aud_mem_dsp1_base               ;	// 0x0308 : ''
	UINT32                          	aud_mem_ipc_a2p_base            ;	// 0x030c : ''
	UINT32                          	aud_mem_ipc_a2p_size            ;	// 0x0310 : ''
	UINT32                          	aud_mem_ipc_p2a_base            ;	// 0x0314 : ''
	UINT32                          	aud_mem_ipc_p2a_size            ;	// 0x0318 : ''
	UINT32                          	aud_mem_ipc_a2d_base            ;	// 0x031c : ''
	UINT32                          	aud_mem_ipc_a2d_size            ;	// 0x0320 : ''
	UINT32                          	aud_mem_ipc_d2a_base            ;	// 0x0324 : ''
	UINT32                          	aud_mem_ipc_d2a_size            ;	// 0x0328 : ''
	UINT32                          	aud_mem_ipc_d2p_base            ;	// 0x032c : ''
	UINT32                          	aud_mem_ipc_d2p_size            ;	// 0x0330 : ''
	UINT32                          	aud_mem_ipc_p2d_base            ;	// 0x0334 : ''
	UINT32                          	aud_mem_ipc_p2d_size            ;	// 0x0338 : ''
	UINT32                          	aud_mem_ipc_dbgp_base           ;	// 0x033c : ''
	UINT32                          	aud_mem_ipc_dbgp_size           ;	// 0x0340 : ''
	UINT32                          	aud_mem_ipc_dbgd_base           ;	// 0x0344 : ''
	UINT32                          	aud_mem_ipc_dbgd_size           ;	// 0x0348 : ''
	UINT32                          	aud_mem_se_param_base           ;	// 0x034c : ''
	UINT32                          	aud_mem_se_param_size           ;	// 0x0350 : ''
	UINT32                          	                 __rsvd_02[   7];	// 0x0354 ~ 0x036c
	UINT32                          	aud_ipc_a2p_rptr                ;	// 0x0370 : ''
	UINT32                          	aud_ipc_a2p_wptr                ;	// 0x0374 : ''
	UINT32                          	aud_ipc_p2a_rptr                ;	// 0x0378 : ''
	UINT32                          	aud_ipc_p2a_wptr                ;	// 0x037c : ''
	UINT32                          	aud_ipc_a2d_rptr                ;	// 0x0380 : ''
	UINT32                          	aud_ipc_a2d_wptr                ;	// 0x0384 : ''
	UINT32                          	aud_ipc_d2a_rptr                ;	// 0x0388 : ''
	UINT32                          	aud_ipc_d2a_wptr                ;	// 0x038c : ''
	UINT32                          	aud_ipc_d2p_rptr                ;	// 0x0390 : ''
	UINT32                          	aud_ipc_d2p_wptr                ;	// 0x0394 : ''
	UINT32                          	aud_ipc_p2d_rptr                ;	// 0x0398 : ''
	UINT32                          	aud_ipc_p2d_wptr                ;	// 0x039c : ''
	UINT32                          	aud_ipc_dbgp_rptr               ;	// 0x03a0 : ''
	UINT32                          	aud_ipc_dbgp_wptr               ;	// 0x03a4 : ''
	UINT32                          	aud_ipc_dbgd_rptr               ;	// 0x03a8 : ''
	UINT32                          	aud_ipc_dbgd_wptr               ;	// 0x03ac : ''
	UINT32                          	                 __rsvd_03[   4];	// 0x03b0 ~ 0x03bc
	AUD_H15_A0_BUF_MPB0_WO                 	aud_buf_mpb0_wo                 ;	// 0x03c0 : ''
	AUD_H15_A0_BUF_MPB0_RO                 	aud_buf_mpb0_ro                 ;	// 0x03c4 : ''
	AUD_H15_A0_BUF_MPB0_WI                 	aud_buf_mpb0_wi                 ;	// 0x03c8 : ''
	AUD_H15_A0_BUF_MPB0_RI                 	aud_buf_mpb0_ri                 ;	// 0x03cc : ''
	AUD_H15_A0_BUF_MPB1_WO                 	aud_buf_mpb1_wo                 ;	// 0x03d0 : ''
	AUD_H15_A0_BUF_MPB1_RO                 	aud_buf_mpb1_ro                 ;	// 0x03d4 : ''
	AUD_H15_A0_BUF_MPB1_WI                 	aud_buf_mpb1_wi                 ;	// 0x03d8 : ''
	AUD_H15_A0_BUF_MPB1_RI                 	aud_buf_mpb1_ri                 ;	// 0x03dc : ''
	AUD_H15_A0_BUF_MPB2_WO                 	aud_buf_mpb2_wo                 ;	// 0x03e0 : ''
	AUD_H15_A0_BUF_MPB2_RO                 	aud_buf_mpb2_ro                 ;	// 0x03e4 : ''
	AUD_H15_A0_BUF_MPB2_WI                 	aud_buf_mpb2_wi                 ;	// 0x03e8 : ''
	AUD_H15_A0_BUF_MPB2_RI                 	aud_buf_mpb2_ri                 ;	// 0x03ec : ''
	AUD_H15_A0_BUF_MPB3_WO                 	aud_buf_mpb3_wo                 ;	// 0x03f0 : ''
	AUD_H15_A0_BUF_MPB3_RO                 	aud_buf_mpb3_ro                 ;	// 0x03f4 : ''
	AUD_H15_A0_BUF_MPB3_WI                 	aud_buf_mpb3_wi                 ;	// 0x03f8 : ''
	AUD_H15_A0_BUF_MPB3_RI                 	aud_buf_mpb3_ri                 ;	// 0x03fc : ''
	AUD_H15_A0_BUF_MPB4_WO                 	aud_buf_mpb4_wo                 ;	// 0x0400 : ''
	AUD_H15_A0_BUF_MPB4_RO                 	aud_buf_mpb4_ro                 ;	// 0x0404 : ''
	AUD_H15_A0_BUF_MPB4_WI                 	aud_buf_mpb4_wi                 ;	// 0x0408 : ''
	AUD_H15_A0_BUF_MPB4_RI                 	aud_buf_mpb4_ri                 ;	// 0x040c : ''
	AUD_H15_A0_BUF_MPB5_WO                 	aud_buf_mpb5_wo                 ;	// 0x0410 : ''
	AUD_H15_A0_BUF_MPB5_RO                 	aud_buf_mpb5_ro                 ;	// 0x0414 : ''
	AUD_H15_A0_BUF_MPB5_WI                 	aud_buf_mpb5_wi                 ;	// 0x0418 : ''
	AUD_H15_A0_BUF_MPB5_RI                 	aud_buf_mpb5_ri                 ;	// 0x041c : ''
	AUD_H15_A0_BUF_MPB6_WO                 	aud_buf_mpb6_wo                 ;	// 0x0420 : ''
	AUD_H15_A0_BUF_MPB6_RO                 	aud_buf_mpb6_ro                 ;	// 0x0424 : ''
	AUD_H15_A0_BUF_MPB6_WI                 	aud_buf_mpb6_wi                 ;	// 0x0428 : ''
	AUD_H15_A0_BUF_MPB6_RI                 	aud_buf_mpb6_ri                 ;	// 0x042c : ''
	AUD_H15_A0_BUF_MPB7_WO                 	aud_buf_mpb7_wo                 ;	// 0x0430 : ''
	AUD_H15_A0_BUF_MPB7_RO                 	aud_buf_mpb7_ro                 ;	// 0x0434 : ''
	AUD_H15_A0_BUF_MPB7_WI                 	aud_buf_mpb7_wi                 ;	// 0x0438 : ''
	AUD_H15_A0_BUF_MPB7_RI                 	aud_buf_mpb7_ri                 ;	// 0x043c : ''
	AUD_H15_A0_BUF_CPB0_WO                 	aud_buf_cpb0_wo                 ;	// 0x0440 : ''
	AUD_H15_A0_BUF_CPB0_RO                 	aud_buf_cpb0_ro                 ;	// 0x0444 : ''
	AUD_H15_A0_BUF_CPB0_WI                 	aud_buf_cpb0_wi                 ;	// 0x0448 : ''
	AUD_H15_A0_BUF_CPB0_RI                 	aud_buf_cpb0_ri                 ;	// 0x044c : ''
	AUD_H15_A0_BUF_CPB1_WO                 	aud_buf_cpb1_wo                 ;	// 0x0450 : ''
	AUD_H15_A0_BUF_CPB1_RO                 	aud_buf_cpb1_ro                 ;	// 0x0454 : ''
	AUD_H15_A0_BUF_CPB1_WI                 	aud_buf_cpb1_wi                 ;	// 0x0458 : ''
	AUD_H15_A0_BUF_CPB1_RI                 	aud_buf_cpb1_ri                 ;	// 0x045c : ''
	AUD_H15_A0_BUF_DPB0_WO                 	aud_buf_dpb0_wo                 ;	// 0x0460 : ''
	AUD_H15_A0_BUF_DPB0_RO                 	aud_buf_dpb0_ro                 ;	// 0x0464 : ''
	AUD_H15_A0_BUF_DPB0_WI                 	aud_buf_dpb0_wi                 ;	// 0x0468 : ''
	AUD_H15_A0_BUF_DPB0_RI                 	aud_buf_dpb0_ri                 ;	// 0x046c : ''
	AUD_H15_A0_BUF_DPB1_WO                 	aud_buf_dpb1_wo                 ;	// 0x0470 : ''
	AUD_H15_A0_BUF_DPB1_RO                 	aud_buf_dpb1_ro                 ;	// 0x0474 : ''
	AUD_H15_A0_BUF_DPB1_WI                 	aud_buf_dpb1_wi                 ;	// 0x0478 : ''
	AUD_H15_A0_BUF_DPB1_RI                 	aud_buf_dpb1_ri                 ;	// 0x047c : ''
	AUD_H15_A0_BUF_IEC_WO                 	aud_buf_iec_wo                  ;	// 0x0480 : ''
	AUD_H15_A0_BUF_IEC_RO                   aud_buf_iec_ro                  ;	// 0x0484 : ''
	AUD_H15_A0_BUF_IEC_WI                   aud_buf_iec_wi                  ;	// 0x0488 : ''
	AUD_H15_A0_BUF_IEC_RI                   aud_buf_iec_ri                  ;	// 0x048c : ''
	AUD_H15_A0_BUF_DEC_SINK0_WO            	aud_buf_dec_sink0_wo            ;	// 0x0490 : ''
	AUD_H15_A0_BUF_DEC_SINK0_RO            	aud_buf_dec_sink0_ro            ;	// 0x0494 : ''
	AUD_H15_A0_BUF_DEC_SINK0_WI            	aud_buf_dec_sink0_wi            ;	// 0x0498 : ''
	AUD_H15_A0_BUF_DEC_SINK0_RI            	aud_buf_dec_sink0_ri            ;	// 0x049c : ''
	AUD_H15_A0_BUF_DEC_SINK1_WO            	aud_buf_dec_sink1_wo            ;	// 0x04a0 : ''
	AUD_H15_A0_BUF_DEC_SINK1_RO            	aud_buf_dec_sink1_ro            ;	// 0x04a4 : ''
	AUD_H15_A0_BUF_DEC_SINK1_WI            	aud_buf_dec_sink1_wi            ;	// 0x04a8 : ''
	AUD_H15_A0_BUF_DEC_SINK1_RI            	aud_buf_dec_sink1_ri            ;	// 0x04ac : ''
	AUD_H15_A0_BUF_SYS_SINK0_WO            	aud_buf_sys_sink0_wo            ;	// 0x04b0 : ''
	AUD_H15_A0_BUF_SYS_SINK0_RO            	aud_buf_sys_sink0_ro            ;	// 0x04b4 : ''
	AUD_H15_A0_BUF_SYS_SINK0_WI            	aud_buf_sys_sink0_wi            ;	// 0x04b8 : ''
	AUD_H15_A0_BUF_SYS_SINK0_RI            	aud_buf_sys_sink0_ri            ;	// 0x04bc : ''
	AUD_H15_A0_BUF_SYS_SINK1_WO            	aud_buf_sys_sink1_wo            ;	// 0x04c0 : ''
	AUD_H15_A0_BUF_SYS_SINK1_RO            	aud_buf_sys_sink1_ro            ;	// 0x04c4 : ''
	AUD_H15_A0_BUF_SYS_SINK1_WI            	aud_buf_sys_sink1_wi            ;	// 0x04c8 : ''
	AUD_H15_A0_BUF_SYS_SINK1_RI            	aud_buf_sys_sink1_ri            ;	// 0x04cc : ''
	AUD_H15_A0_BUF_REVERSE_WO              	aud_buf_reverse_wo              ;	// 0x04d0 : ''
	AUD_H15_A0_BUF_REVERSE_RO              	aud_buf_reverse_ro              ;	// 0x04d4 : ''
	AUD_H15_A0_BUF_REVERSE_WI              	aud_buf_reverse_wi              ;	// 0x04d8 : ''
	AUD_H15_A0_BUF_REVERSE_RI              	aud_buf_reverse_ri              ;	// 0x04dc : ''
	AUD_H15_A0_BUF_IEC1_WO                 	aud_buf_iec1_wo                 ;	// 0x04e0 : ''
	AUD_H15_A0_BUF_IEC1_RO                 	aud_buf_iec1_ro                 ;	// 0x04e4 : ''
	AUD_H15_A0_BUF_IEC1_WI                 	aud_buf_iec1_wi                 ;	// 0x04e8 : ''
	AUD_H15_A0_BUF_IEC1_RI                 	aud_buf_iec1_ri                 ;	// 0x04ec : ''
	UINT32                          	                 __rsvd_04[  95];	// 0x04f0 ~ 0x0668
	UINT32                          	aud_debug_dec_cnt               ;	// 0x066c : ''
	AUD_H15_A0_MUTE_INFO_OUTCTRL       	aud_mute_info_outctrl           ;	// 0x0670 : ''
	UINT32                          	aud_presented_pts_lip0          ;	// 0x0674 : ''
	UINT32                          	aud_presented_pts_lip1          ;	// 0x0678 : ''
	AUD_H15_A0_TPM_BUFSIZE                 	aud_tpm_bufsize                 ;	// 0x067c : ''
	AUD_H15_A0_TPA_BUFSIZE                 	aud_tpa_bufsize                 ;	// 0x0680 : ''
	UINT32                          	aud_adc_in_cnt                  ;	// 0x0684 : ''
	UINT32                          	aud_adc_in_gstc                 ;	// 0x0688 : ''
	UINT32                          	aud_aad_in_cnt                  ;	// 0x068c : ''
	UINT32                          	aud_aad_in_gstc                 ;	// 0x0690 : ''
	UINT32                          	aud_hdmi0_in_cnt                ;	// 0x0694 : ''
	UINT32                          	aud_hdmi0_in_gstc               ;	// 0x0698 : ''
	UINT32                          	aud_hdmi1_in_cnt                ;	// 0x069c : ''
	UINT32                          	aud_hdmi1_in_gstc               ;	// 0x06a0 : ''
	UINT32                          	aud_dbg_dsp0_reset              ;	// 0x06a4 : ''
	AUD_H15_A0_DBG_DSP1_RESET          	aud_dbg_dsp1_reset              ;	// 0x06a8 : ''
	UINT32                          	aud_dsp0_gstc                   ;	// 0x06ac : ''
	UINT32                          	aud_dsp1_gstc                   ;	// 0x06b0 : ''
	UINT32                          	                 __rsvd_05[   1];	// 0x06b4
	UINT32                          	aud_levelmo_l                   ;	// 0x06b8 : ''
	UINT32                          	aud_levelmo_r                   ;	// 0x06bc : ''
	UINT32                          	aud_dec0_cbt                    ;	// 0x06c0 : ''
	UINT32                          	aud_dec0_sbt                    ;	// 0x06c4 : ''
	UINT32                          	aud_dec1_cbt                    ;	// 0x06c8 : ''
	UINT32                          	aud_dec1_sbt                    ;	// 0x06cc : ''
	UINT32                          	aud_basepts                     ;	// 0x06d0 : ''
	UINT32                          	aud_basestc                     ;	// 0x06d4 : ''
	UINT32                          	aud_hdmi0_fmt                   ;	// 0x06d8 : ''
	AUD_H15_A0_HDMI0_PCPD              	aud_hdmi0_pcpd                  ;	// 0x06dc : ''
	UINT32                          	aud_hdmi1_fmt                   ;	// 0x06e0 : ''
	AUD_H15_A0_HDMI1_PCPD              	aud_hdmi1_pcpd                  ;	// 0x06e4 : ''
	UINT32                          	aud_ver_chip                    ;	// 0x06e8 : ''
	UINT32                          	aud_dbg_print_mask              ;	// 0x06ec : ''
	AUD_H15_A0_VER_DSP0_COMMON         	aud_ver_dsp0_common             ;	// 0x06f0 : ''
	AUD_H15_A0_VER_DSP1_COMMON         	aud_ver_dsp1_common             ;	// 0x06f4 : ''
	AUD_H15_A0_VER_DSP0                	aud_ver_dsp0                    ;	// 0x06f8 : ''
	AUD_H15_A0_VER_DSP1                	aud_ver_dsp1                    ;	// 0x06fc : ''
} LX_AUD_REG_H15_A0_T;
/* 212 regs, 212 types */

/* 212 regs, 212 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * g_pRealRegAud : real register of AUD.
 * g_pTempRegAud     : shadow register.
 *
 * @def AUD_H15_A0_RdFL: Read  FLushing : Shadow <- Real.
 * @def AUD_H15_A0_WrFL: Write FLushing : Shadow -> Real.
 * @def AUD_H15_A0_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def AUD_H15_A0_Wr  : Write whole register(UINT32) from Shadow register.
 * @def AUD_H15_A0_Rd01 ~ AUD_H15_A0_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def AUD_H15_A0_Wr01 ~ AUD_H15_A0_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define AUD_H15_A0_RdREG(REG)			( *((volatile UINT32*)(REG)))
#define AUD_H15_A0_WrREG(REG,VAL)		( *((volatile UINT32*)(REG)) =(VAL))

#define AUD_H15_A0_RdFL(_r)				((g_pTempRegAud->_r)=(g_pRealRegAud->_r))
