#ifndef _SDEC_CIPLUS_IPC_REG_H_
#define _SDEC_CIPLUS_IPC_REG_H_

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/


#ifdef __cplusplus
extern "C" {
#endif

/*-----------------------------------------------------------------------------
	0x0004 chan_conf0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0008 chan_conf1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x000c chan_conf2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0010 chan_conf3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lts_id                          : 8,	//  0: 7
	lts_en                          : 1,	//     8
	tei                             : 1,	//     9
	bypass                          : 1,	//    10
	synctype                        : 1,	//    11
	src_sel                         : 3,	// 12:14
	reserved                        :13,	// 15:27
	en                              : 1,	//    28
	reserved_1                      : 2,	// 29:30
	reset                           : 1;	//    31
} CIPLUS_IPC_CHAN_CONF;

/*-----------------------------------------------------------------------------
	0x0014 chan_out ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reserved                        :31,	//  0:30
	reset                           : 1;	//    31
} CIPLUS_IPC_CHAN_OUT;

/*-----------------------------------------------------------------------------
	0x0018 pidf_index ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filter_idx                      : 5,	//  0: 4
	reserved                        :11,	//  5:15
	chan_idx                        : 2,	// 16:17
	reserved_1                      :14;	// 18:31
} CIPLUS_IPC_PIDF_INDEX;

/*-----------------------------------------------------------------------------
	0x001c pidf_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ref_pid                         :13,	//  0:12
	reserved                        :18,	// 13:30
	en                              : 1;	//    31
} CIPLUS_IPC_PIDF_DATA;

/*-----------------------------------------------------------------------------
	0x0020 ddr_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32					sptr;
	UINT32					eptr;
	UINT32					wptr;
	UINT32					rptr;
} CIPLUS_IPC_DDR_CONF;


/*-----------------------------------------------------------------------------
	0x00a8 intr_rstatus ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	empty                           : 4,	//  0: 3
	full                            : 4,	//  4: 7
	reserved                        :24;	//  8:31
} CIPLUS_IPC_INTR_RSTATUS;

typedef struct {
	UINT32                    			ipc_cmd_addr                    ;	// 0x0000 : ''
	CIPLUS_IPC_CHAN_CONF               	chan_conf[4]                    ;	// 0x0004 ~ 0x0010 : ''
	CIPLUS_IPC_CHAN_OUT                	chan_out                        ;	// 0x0014 : ''
	CIPLUS_IPC_PIDF_INDEX              	pidf_index                      ;	// 0x0018 : ''
	CIPLUS_IPC_PIDF_DATA               	pidf_data                       ;	// 0x001c : ''
	CIPLUS_IPC_DDR_CONF		           	input_ddr_conf[4]               ;	// 0x0020 ~ 0x005c : ''
	CIPLUS_IPC_DDR_CONF		           	output_ddr_conf[4]              ;	// 0x0060 ~ 0x009c : ''
	UINT32								_res1[16]						;	// 0x00ac ~ 0x00d0
	UINT32								print_control					;	// 0x00e0
	UINT32								_res2[3]						;
	UINT32								mcu_cmd_ipc_done				;	// 0x00f0
	UINT32								mcu_cmd_printf					;	// 0x00f4
} CIPLUS_IPC_TOP_REG_T;
/* 21 regs, 21 types */

/* 21 regs, 21 types in Total*/

#ifdef __cplusplus
}
#endif

#endif	/* _#MOD#_REG_H_ */

/* from 'a.csv' 20140814 19:44:26 KST by getregs v2.9 */
